text = '''1 	Обґрунтування конструкційно-технологічних параметрів пневмоелектромагнітного пульсоколектора доїльного апарата 	Яцунський Петро Петрович 	133 Галузеве машинобудування 	08.09.2022 р. 	15
2 	Керування безпілотниками з елементами автономності засобами штучного інтелекту 	Яцишин Володимир Петрович 	122 Комп'ютерні науки 	15.06.2026 р. 	347
3 	Основи технології переробки високов’язких, високосірчистих нафт Яблунівського родовища України 	Ярмола Тетяна Володимирівна 	161 Хімічні технології та інженерія 	15.06.2023 р. 	42
4 	Реінжиніринг бізнес-процесів суб’єктів туристичної діяльності 	Ярмола Катерина Михайлівна 	073 Менеджмент 	21.01.2025 р. 	167
5 	Удосконалення і розвиток методів оцінки психологічного стану засобами штучного інтелекту 	Яремченко Олександр Дмитрович 	122 Комп'ютерні науки 	28.05.2026 р. 	339
6 	Просторова робота, міцність і деформативність реконструйованих залізобетонних балкових прольотних будов, підсилених зміною статичної схеми 	Яо Сінь 	192 Будівництво та цивільна інженерія 	29.12.2023 р. 	102
7 	Формування публічної політики у сфері штучного інтелекту: міжнародний досвід для України 	Янишівський Михайло Мирославович 	281 Публічне управління та адміністрування 	29.07.2025 р. 	226
8 	Біоінженерні підходи до оптимізації процесів отримання мікробних полімерів та сурфактантів 	Январьов Єгор Борисович 	162 Біотехнології та біоінженерія 	07.08.2025 р. 	257
9 	Комплексна система оцінювання ризиків інформаційної безпеки пов'язаних з персоналом в адаптивних системах управління доступом 	Ямнич Андрій Богданович 	125 Кібербезпека 		400
10 	Удосконалення технології очищення поверхні паперових аркушів стародруків лазерним випромінюванням 	Якимець Мар'ян Васильович 	186 Видавництво та поліграфія 	31.07.2026 р. 	436
11 	Використання інформаційних технологій штучного інтелекту для генерації контенту додатків віртуальної реальності 	Якимів Володимир Стефанович 	126 Інформаційні системи та технології 	05.06.2026 р. 	377
12 	Управління змінами в контексті розвитку публічного адміністрування 	Якимець Марія Миколаївна 	281 Публічне управління та адміністрування 	31.01.2025 р. 	175
13 	Формування гнучкої системи управління розвитком підприємства на засадах проєктного менеджменту 	Яворський Роман Тарасович 	073 Менеджмент 		473
14 	Організаційно-правові засади партисипації в місцевому самоврядуванні 	Ющук Роман Васильович 	281 Публічне управління та адміністрування 	10.07.2025 р. 	228
15 	Формування системи менеджменту в умовах діджиталізації 	Юрчик Андрій Іванович 	073 Менеджмент 		433
16 	Забезпечення ефективності управління персоналом на соціальних підприємствах 	Юрченко Галина Миколаївна 	073 Менеджмент 	14.11.2023 р. 	72
17 	Інформаційні технології формування освітнього контенту для систем електронного навчання. 	Юнчик Валентина Леонідівна 	126 Інформаційні системи та технології 	07.02.2024 р. 	107
18 	Методи побудови та обробки фрактальних зображень з використанням рандомізованої системи ітераційних функцій 	Юнак Остап Миронович 	172 Телекомунікації та радіотехніка 	22.12.2023 р. 	77
19 	Розвиток механізмів публічного управління медичним обслуговуванням населення України на засадах інтеграційного підходу 	Юкало Марія Василівна 	281 Публічне управління та адміністрування 	11.06.2025 р. 	204
20 	Розвиток публічного управління у сфері застосування програм допоміжних репродуктивних технологій в Україні 	Юкало Володимир Васильович 	281 Публічне управління та адміністрування 	06.12.2023 р. 	83
21 	Контрольована модифікація електрофізичних характеристик кремнійових мікрокристалів легуванням домішками перехідних металів для сенсорної техніки 	Щербань Наталія Олексівна 	153 Мікро- та наносистемна техніка 	25.08.2022 р. 	9
22 	Гносеологія органічних законів суспільства:метаантропологічні цінності 	Щербай Іванна Романівна 	081 Право 	12.05.2026 р. 	328
23 	Формування готовності педагогічних працівників закладів професійної освіти до використання змішаного навчання в освітньому процесі 	Шуплат Анастасія Ігорівна 	015 Професійна освіта (за спеціалізаціями) 	28.07.2026 р. 	355
24 	Розвиток вищої медичної освіти у США (ХХ-ХХІ століття) 	Шумило Мирослава Юріївна 	011 Освітні, педагогічні науки 	22.06.2023 р. 	40
25 	Нелінійно-оптичні взаємодії та їхня просторова анізотропія в кристалічних матеріалах та нанокомпозитах 	Шульга Дмитро Олександрович 	105 Прикладна фізика та наноматеріали 	03.07.2026 р. 	409
26 	Обліково-аналітичне забезпечення податкової політики суб'єкта господарювання 	Шулик Ірина-Людмила Анатоліївна 	071 Облік і оподаткування 	29.06.2026 р. 	343
27 	Методи та моделі побудови інтелектуальних інформаційно-комунікаційних систем автоматизованого управління інфраструктурою 	Шубин Богдан Петрович 	122 Комп'ютерні науки 	12.08.2025 р. 	265
28 	Волонтерський рух в Україні як агент суспільних трансформацій 	Штрайхер Олена Андріївна 	054 Соціологія 	18.07.2026 р. 	463
29 	Інформаційна технологія синтезу багатооперандних паралельно-потокових обчислювальних структур для нейроорієнтовавних систем реального часу 	Штогрінець Богдан Володимирович 	122 Комп’ютерні науки 	13.08.2026 р. 	493
30 	Розвиток та архітектурні аспекти модернізації висотних будівель Львова у ХХ-ХХІ ст. 	Штендера Андрій Юрійович 	191 Архітектура та містобудування 	29.08.2023 р. 	74
31 	Підвищення точності калібрування гідрофонів у водному середовищі 	Шпак Олександр Володимирович 	152 Метрологія та інформаційно-вимірювальна техніка 	21.07.2025 р. 	235
32 	Вбудована самодіагностика сенсорних пристроїв на основі ультразвукових п’єзоелектричних перетворювачів 	Шлюсар Юрій Анатолійович 	171 Електроніка 	12.08.2026 р. 	412
33 	Підвищення ефективності функціонування мобільних кіберфізичних систем на основі інтелектуального управління параметрами радіоканалу 	Шкоропад Юрій Ігорович 	172 Телекомунікації та радіотехніка 	26.06.2026 р. 	345
34 	Методи та засоби діагностики несправностей сільськогосподарської техніки 	Шихмат Антон Олександрович 	123 Комп'ютерна інженерія 	09.07.2026 р. 	398
35 	Соціально-психологічне управління підприємством 	Широн Юлія Олегівна 	073 Менеджмент 	16.05.2024 р. 	118
36 	Публічна політика у сфері надання медико-соціальних послуг 	Шипов Юрій Олександрович 	281 Публічне управління та адміністрування 	15.04.2026 р. 	297
37 	Формування двошарових біологічно активних прищеплених полімерних покриттів 	Шимборська Яна Андріївна 	102 Хімія 	09.05.2024 р. 	115
38 	Моделювання та картографування планетарних геодинамічних процесів 	Шило Ольга Миколаївна 	103 Науки про Землю 	04.04.2025 р. 	181
39 	Термодинамічні властивості 3-(1,5-диарил-1H-пірол-2-іл)-пропанових кислот та їх розчинів в органічних розчинниках 	Шевченко Дмитро Сергійович 	102 Хімія 	18.12.2025 р. 	282
40 	Підвищення ефективності механічного оброблення деталей з титанових сплавів на основі імітаційного моделювання процесу формоутворення 	Ше Сяньнін 	131 Прикладна механіка 	14.02.2023 р. 	34
41 	Удосконалення механізму державно-приватного партнерства у сфері розвитку агропромислового сектору в умовах дестабілізуючих факторів 	Шафран Андрій Іванович 	281 Публічне управління та адміністрування 	18.06.2026 р. 	410
42 	Методи та засоби опрацювання зображень для анімації статичних обʼєктів 	Шамуратов Олексій Юрійович 	122 Комп'ютерні науки 	09.09.2022 р. 	22
43 	Система адаптивного керування дозуванням розчинів у фармацевтичному виробництві 	Шалева Володимир Володимирович 	151 Автоматизація та комп’ютерно-інтегровані технології 	30.06.2025 р. 	203
44 	Філософсько-правові засади формування сучасної моделі суспільства 	Шак Роман Ігорович 	081 Право 	13.12.2023 р. 	91
45 	Розроблення інформаційної технології адаптивного управління кіберстійкістю складних систем у динамічних середовищах розробки програмного забезпечення 	Чура Тарас Русланович 	125 «Кібербезпека» 		453
46 	Адміністративно-правові засади відповідальності за несплату аліментів 	Чохрій Вікторія Степанівна 	081 Право 	02.05.2025 р. 	190
47 	Інформаційні технології аналізу даних з використанням CRM-систем 	Чорняк Володимир Орестович 	126 Інформаційні системи та технології 		449
48 	Технологічні принципи відтворення втрат деревини у творах мистецтва початку XVIII – першої половини ХХ століть 	Чорний Максим Сергійович 	023 образотворче мистецтво, декоративне мистецтво, реставрація 	31.07.2024 р. 	143
49 	Одержання та застосування додатків до дорожніх бітумів з некондиційної сировини органічного походження 	Чіпко Тарас Андрійович 	161 Хімічні технології та інженерія 	30.07.2026 р. 	430
50 	Формування готовності майбутніх бакалаврів права до професійної діяльності в умовах диджіталізації: диференційований підхід 	Чичкевич Олег Богданович 	011 Освітні, педагогічні науки 	03.08.2026 р. 	354
№ 	Тема дисертації 	Автор дисертації 	Спеціальність 	Дата захисту 	Шифр ради
51 	Закономірності фільтраційного сушіння вторинної сировини органічного походження 	Чижович Роман Андрійович 	161 Хімічні технології та інженерія 	27.12.2024 р. 	165
52 	Професійна підготовка майбутніх журналістів в умовах інтенсивного розвитку медіа технологій у Китайській Народній Республіці 	Чжу Фанчжоу 	011 Освітні, педагогічні науки 	12.02.2025 р. 	171
53 	Формування фіскальної політики в умовах розвитку українсько-китайської економічної діяльності 	Чжан Шу 	292 Міжнародні економічні відносини 	26.03.2025 р. 	186
54 	Удосконалення механізму державно-приватного партнерства у сфері інноваційного розвитку в умовах індустрії 4.0 	Чернецька Теодозія Юріївна 	281 Публічне управління та адміністрування 	05.12.2025 р. 	280
55 	Методи і засоби зменшення негативних ефектів максимально екстрактованої вигоди в публічних мережах блокчейн 	Черкас Назарій Степанович 	122 Комп’ютерні науки 	15.08.2026 р. 	492
56 	Електрофізичні та магнітотранспортні характеристики ниткоподібних кристалів GaAs для сенсорної електроніки 	Чемерис Дмитро Вікторович 	153 Мікро- та наносистемна техніка 	22.07.2024 р. 	128
57 	Методи та засоби підвищення достовірності приймання радіосигналів із використанням нейронних мереж 	Цимбалюк Іван Ростиславович 	172 Телекомунікації та радіотехніка 	14.08.2024 р. 	148
58 	Апаратно-програмне та метрологічне забезпечення дронів 	Цзен Сіньюй 	152 Метрологія та інформаційно-вимірювальна техніка 	20.03.2025 р. 	179
59 	Методи та засоби аналізу параметрів оператора з використанням комп’ютерних тренажерів 	Худоба Богдан Петрович 	122 Комп'ютерні науки 	25.04.2024 р. 	114
60 	Інформаційна технологія планування розподілених обчислень із контрольованим застосуванням великих мовних моделей 	Хорканін Максим Юрійович 	126 Інформаційні системи та технології 	12.06.2026 р. 	312
61 	Розроблення математичних моделей тиристорних модуляторів сигналів 	Хомюк Денис Сергійович 	123 «Комп’ютерна інженерія» 	07.08.2026 р. 	447
62 	Розвиток медсестринської освіти у Швейцарії (початок ХХІ століття) 	Хміляр Ірена Романівна 	011 Освітні, педагогічні науки 	30.08.2022 р. 	12
63 	Формування державної політики з розвитку приватної освіти в Україні 	Хмелюк Віта Степанівна 	281 Публічне управління та адміністрування 	20.12.2023 р. 	82
64 	Функціональне інтегрування в сигнальних перетворювачах фотовольтаїчних сенсорних пристроїв з оптичною телекомунікацією 	Хільчук Микола Олександрович 	172 Телекомунікації та радіотехніка 	22.12.2023 р. 	78
65 	Інформаційні технології екологічного моніторингу концентрації шкідливих викидів технологічних систем 	Хиляк Назарій Андрійович 	126 Інформаційні системи та технології 	03.08.2026 р. 	376
66 	Інформаційно-аналітичне забезпечення державної політики демографічної безпеки України в умовах посиленої міграції 	Хвалібота Ростислав Ігорович 	281 Публічне управління та адміністрування 	08.07.2025 р. 	227
67 	Розвиток системи публічного маркетингу для країн із перехідною економікою 	Ханик Юлія-Божена Романівна 	281 Публічне управління та адміністрування 	17.10.2023 р. 	56
68 	Маркетингова діяльність компаній на ринку цифрових продуктів 	Фукс Костянтин Володимирович 	075 Маркетинг 	08.08.2026 р. 	413
69 	Управління кадровим потенціалом підприємства в умовах післявоєнної відбудови 	Франт Юрій Васильович 	073 Менеджмент 		423
70 	Забезпечення якості середньої освіти засобами інституційного аудиту: публічно-управлінський аспект 	Форкуца Олена Анатоліївна 	281 Публічне управління та адміністрування 	14.12.2023 р. 	57
71 	Виборчі права в умовах глобалізаційних трансформацій 	Філіпчук Ксенія Володимирівна 	081 Право 	01.04.2026 р. 	290
72 	Синтез, властивості, біологічна активність тіосульфонатів та технології створення лікарських форм на їх основі 	Фізер Любов Віталіївна 	226 Фармація, промислова фармація 	05.08.2025 р. 	256
73 	Методика підвищення точності GNSS-нівелювання на основі локального коригування висот глобальних моделей геоїда 	Федорчук Аліна Володимирівна 	193 Геодезія та землеустрій 	06.06.2023 р. 	41
74 	Політика ЄС щодо підтримки реформування місцевого самоврядування в державах “Асоційованого тріо” 	Федірко Богдан Олегович 	291 Міжнародні відносини, суспільні комунікації та регіональні студії 		500
75 	Метрологічне забезпечення кібер-фізичної системи моніторингу грунтів 	Федишин Тетяна Ігорівна 	152 Метрологія та інформаційно-вимірювальна 	16.07.2024 р. 	136
76 	Утопії в архітектурі та містобудуванні: значення та механізми реалізації 	Федак Анна Ярославівна 	191 Архітектура та містобудування 	07.10.2022 р. 	24
77 	Гідравлічні розрахунки напірних трубопроводів-збирачів з дискретним входом рідини 	Фасуляк Вадим Євгенійович 	192 Будівництво та цивільна інженерія 	06.08.2024 р. 	140
78 	Формування екологічної компетентності у майбутніх фахівців будівельного профілю засобами гуманізації змісту професійної підготовки 	Фаринюк Захар Любомирович 	015 Професійна освіта (за спеціалізаціями) 	03.08.2026 р. 	350
79 	Методи та засоби оптимізації функціонування розподілених інформаційних систем на основі семантичного аналізу транзакцій 	Файзулін Олег Рустамович 	124 Системний аналіз 	23.06.2026 р. 	303
80 	Методи і засоби підвищення надійності програмного забезпечення з урахуванням процесу його старіння 	Угриновський Богдан Володимирович 	121 Інженерія програмного забезпечення 	05.07.2022 р. 	4
81 	Комерціалізація результатів інноваційної діяльності спільних підприємств 	У Кайкунь 	051 Економіка 	29.06.2026 р. 	421
82 	Формування християнських цінностей студентів юридичних спеціальностей як засіб гуманізації професійної підготовки (кінець XX – початок XXI ст.) 	Тушніцький Назар Ігорович 	011 Освітні, педагогічні науки 	16.08.2023 р. 	62
83 	Концепція міст-садів та їх реалізація у Галичині 	Турчин Богдан Романович 	191 Архітектура та містобудування 	02.05.2024 р. 	117
84 	Модернізація публічного управління у сфері надання медичних послуг в контексті реформування системи охорони здоров'я України 	Турчин Катерина Юріївна 	281 Публічне управління та адміністрування 	12.08.2025 р. 	254
85 	Моделі інформаційної системи і технології підвищення ефективності багатокритеріального сортування даних з динамічно-наслідковим обмеженням переміщення 	Турчак Володимир Романович 	126 Інформаційні системи та технології 		465
86 	Модульне конфігурування енергетично-тягових систем електричних транспортних засобів на основі безщіткових двигунів з постійними магнітами 	Турковський Валентин Павлович 	141 Електроенергетика, електротехніка та електромеханіка 	09.06.2026 р. 	305
87 	Іономерні стоматологічні цементи на основі ніобійвмісних золь–гель склопорошків 	Тупісь Ірина Михайлівна 	161 Хімічні технології та інженерія 	08.03.2024 р. 	101
88 	Публічне управління забезпеченням медико-соціальними послугами дітей з інвалідністю в України 	Тоцька Віталія Євгенівна 	281 Публічне управління та адміністрування 	11.07.2025 р. 	224
89 	Оцінювання та розвиток державно-приватного партнерства у зовнішньоекономічній діяльності 	Томич Мар'яна Ігорівна 	292 Міжнародні економічні відносини 	28.12.2022 р. 	32
90 	Методи та засоби кластеризації різнотипових даних 	Ткачик Олександр Андрійович 	122 Комп'ютерні науки 	18.03.2024 р. 	97
91 	Комплексна оцінка впливу місць сумісного видалення промислових та побутових відходів на стан екологічної безпеки (на прикладі Кременчуцького промислового регіону) 	Тітова Анна Олегівна 	101 Екологія 		495
92 	Управління підприємницькими ризиками в системі цінностей сталого розвитку 	Тиркало Юрій Євгенійович 	076 Підприємництво, торгівля та біржова діяльність 	09.12.2023 р. 	93
93 	Публічне управління у сфері соціального захисту учасників бойових дій в Україні 	Тимочко Іван Олексійович 	281 Публічне управління та адміністрування 	11.06.2026 р. 	384
94 	Інформаційна технологія проектування автоматизованої системи забезпечення діяльності студентського містечка 	Терновий Іван Михайлович 	126 Інформаційні системи та технології 	09.09.2025 р. 	275
95 	Використання технології блокчейн у публічному управлінні: вітчизняний та міжнародний досвід правового регулювання 	Терлюк Олексій Іванович 	081 Право 	15.12.2023 р. 	90
96 	Несуча здатність залізобетонних балок, підсилених композитними матеріалами за дії навантаження 	Терешко Андрій Романович 	192 Будівництво та цивільна інженерія 	14.08.2025 р. 	245
97 	Технологічне забезпечення якості друкування на флексографічних високошвидкісних машинах 	Телегіна Тетяна Євгенівна 	186 Видавництво та поліграфія 	04.08.2026 р. 	508
98 	Методи покращення якості зображень в інформаційно-комунікаційних системах на основі технологій глибокого навчання 	Теглівець Олесь Віталійович 	172 Телекомунікації та радіотехніка 	12.08.2026 р. 	387
99 	Інформаційна технологія формування шрифту Брайля за допомогою 3D-моделювання 	Тарасов Нікіта Андрійович 	126 Інформаційні системи та технології 	09.09.2025 р. 	276
100 	Методи та моделі визначення психологічного стану людини на основі інформації фізіологічних сигналів 	Сухолейстер Олександр Олегович 	123 Комп’ютерна інженерія 	30.06.2026 р. 	331
101 	Розроблення моделі системи дослідження кіберзлочинів для складових інфраструктури інформаційних систем 	Сусукайло Віталій Андрійович 	125 Кібербезпека 	13.08.2024 р. 	131
102 	Субстрати на основі органовмісних відходів для рекультивації та ремедіації полігонів твердих побутових відходів 	Сторощук Уляна Зіновіївна 	101 Екологія 	15.03.2023 р. 	36
103 	Формування організаційно-економічної платформи взаємодії підприємства із стейкхолдерами 	Стефанцов Дмитро Вікторович 	051 Економіка 		485
104 	Розвиток механізмів активізування міжнародних економічних відносин в умовах безпекових викликів 	Стефанський Юрій Степанович 	292 Міжнародні економічні відносини 	14.07.2026 р. 	422
105 	Методи підвищення доступності та відмовостійкості контейнерної інфраструктури вебпорталів 	Степанов Дмитро Сергійович 	121 Інженерія програмного забезпечення 	16.06.2026 р. 	316
106 	Формування організаційно-економічної взаємодії диверсифікованих бізнес- структур 	Степанків Назарій Зеновійович 	051 Економіка 		512
107 	Оцінювання та управління потенціалом підвищення економічної стійкості підприємств 	Степанків Володимир Зеновійович 	051 Економіка 		511
108 	Методи та моделі для автоматизованого проектування акустофлюїдних мікроелектромеханічних систем 	Стахів Володимир Михайлович 	122 Комп'ютерні науки 	12.08.2025 р. 	231
109 	Маркетингове управління логістичним потенціалом підприємств залізничного транспорту в умовах лібералізації ринку 	Стасюк Катерина Зіновіївна 	075 Маркетинг 	15.09.2022 р. 	7
110 	Фосфоровмісні поліестери L-глутамінової кислоти біомедичного призначення 	Стасюк Анна Василівна 	102 Хімія 	15.06.2023 р. 	44
111 	Ідентифікація харчових продуктів за параметрами адмітансу 	Стасишин Юрій Арсенович 	152 Метрологія та інформаційно-вимірювальна техніка 	26.05.2025 р. 	193
112 	Зовнішньополітичні орієнтири державотворення в українській політичній думці націоналістичного спрямування у 20-50-их рр. ХХ ст. 	Стародуб Тарас Петрович 	052 Політологія 	12.01.2023 р. 	31
113 	Стратегічний інструментарій розвитку кінотеатральних мереж 	Стангурська Божена Орестівна 	073 Менеджмент 	16.11.2022 р. 	27
114 	Система керування електронною документацією в Україні 	Стадник Юрій Васильович 	029 Інформаційна, бібліотечна та архівна справа 		519
115 	Особливості формування транспортних потоків в умовах війни 	Сотнікова Анна Олександрівна 	275 Транспортні технології (за видами) 	25.10.2024 р. 	161
116 	Обліково-аналітичне забезпечення фінансування житлового будівництва 	Сороковий Павло Миколайович 	071 Облік і оподаткування 	15.12.2023 р. 	96
117 	Удосконалення біотехнології переробки харчових відходів готельно-ресторанного комплексу 	Соколова Таїсія Ігорівна 	183 Технології захисту навколишнього середовища 	25.07.2025 р. 	223
118 	Методи та засоби адаптивної маршрутизації в комп'ютерних мережах 	Снайчук Яромир Любомирович 	122 Комп’ютерні науки 	22.07.2026 р. 	446
119 	Крайові задачі для еволюційних рівнянь із виродженням за часовою змінною 	Слоньовський Ярослав Олегович 	111 Математика 	17.04.2025 р. 	192
120 	Модифікація поверхні кремнієвої підкладки з використанням нанотекстурованих шарів для підвищення ефективності фотоелектричних перетворювачів 	Скрипник Ігор Ігорович 	153 Мікро- та наносистемна техніка 	22.08.2025 р. 	244
121 	Розвиток педагогічної майстерності викладачів правових дисциплін у закладі вищої освіти 	Скочиляс Андрій Богданович 	011 Освітні, педагогічні науки 	05.08.2026 р. 	300
122 	Формування знань про основи теплоенергетики у фахівців автомобільного транспорту у професійних коледжах та училищах: інтегративний підхід 	Сірант Остап-Михайло Романович 	015 Професійна освіта (за спеціалізаціями) 	28.07.2026 р. 	359
123 	Дисертація виконана на спеціальну тему 	Синявський Орест Юрійович 	125 Кібербезпека 		520
124 	Методи і засоби формування суспільно орієнтованої документації програмного забезпечення за допомогою віртуальних спільнот 	Синько Анна Іванівна 	121 Інженерія програмного забезпечення 	11.07.2023 р. 	47
125 	Моделі і методи прогнозування та аналізу надійності технічних систем з урахуванням процесу розробки ПЗ 	Симець Іван Ігорович 	121 Інженерія програмного забезпечення 	16.06.2022 р. 	3
126 	Раціональні сталеві комбіновані кроквяні ферми 	Сидорак Дмитро Павлович 	192 Будівництво та цивільна інженерія 	22.11.2024 р. 	162
127 	Адаптування умов вітчизняного митного регулювання до вимог Європейського союзу 	Сивохіп Павло Сергійович 	292 Міжнародні економічні відносини 		480
128 	Розроблення моделей інформаційної системи синусоїдального перетворення і синтезу цифрових зображень 	Сердюк Юрій Юрійович 	126 Інформаційні системи та технології 	04.08.2026 р. 	494
129 	Моделі інформаційної технології формування якості процесу розроблення програмного забезпечення 	Сеньківський Назарій Юрійович 	126 Інформаційні системи та технології 		464
130 	Дослідження фітохімічного профілю, технологічних аспектів та біологічної активності екстрактів Scorzonera purpurea 	Семенчук Юрій Михайлович 	226 Фармація, промислова фармація 	07.08.2025 р. 	255
131 	Підготовка кадрів для харчової промисловості: публічно- управлінський аспект 	Сембай Наталія Миколаївна 	281 Публічне управління та адміністрування 	29.12.2023 р. 	99
132 	Інфографіка у комунікативному дизайні вебсайту 	Селіванов Іван Сергійович 	022 Дизайн 	25.07.2025 р. 	229
133 	Розвиток управління бізнес-процесами шляхом імітаційного моделювання 	Свірський Юрій Васильович 	073 Менеджмент 	03.07.2025 р. 	211
134 	Методи та засоби нейромережевого моделювання тепломасоперенесення в анізотропних середовищах з фрактальною структурою 	Самотій Тетяна Сергіївна 	122 Комп'ютерні науки 	13.09.2025 р. 	278
135 	Метрологічне забезпечення інтегрованих систем управління якістю 	Салабай Юлія Іванівна 	152 «Метрологія та інформаційно-вимірювальна техніка» 		456
136 	Правова характеристика форм адміністративного судочинства в Україні 	Сало Павло Ігорович 	081 Право 	11.12.2023 р. 	92
137 	Обгрунтування конструкційно-режимних параметрів дозатора-змішувача сипких матеріалів в безперервному потоці 	Саган Олег Ярославович 	133 Галузеве машинобудування 	30.07.2026 р. 	365
138 	Формування професійної культури учнів закладів професійно-технічної освіти сфери обслуговування 	Рузяк Тетяна Іванівна 	015 Професійна освіта (за спеціалізаціями) 	29.08.2022 р. 	14
139 	Розвиток інноваційної діяльності підприємств в умовах екстремальних ситуацій 	Рудюк Ярослав Анатолійович 	073 Менеджмент 	17.07.2026 р. 	402
140 	Удосконалення методів та засобів біометричної автентифікації за голосом з застосуванням технологій машинного навчання 	Руда Христина Степанівна 	125 Кібербезпека 	22.08.2025 р. 	264
141 	Аграрний елемент в структурі багатоквартирного житлового середовища 	Рубай Роман Степанович 	191 Архітектура та містобудування 	24.06.2026 р. 	396
142 	Удосконалення частотного символьного методу аналізу LPTV кіл у середовищі MATLAB 	Романюк Роман Олександрович 	172 Телекомунікації та радіотехніка 	27.05.2026 р. 	296
143 	Нормативно-технічне забезпечення системи керування вимірюванням 	Романчукевич Олег Ігорович 	152 «Метрологія та інформаційно-вимірювальна техніка» 		454
144 	Розвиток інструментарію забезпечення інвестиційної діяльності фондів нерухомості 	Романишин Олександр Ігорович 	073 Менеджмент 		420
145 	Розроблення чутливих елементів перетворювачів температури на основі новітніх термометричних матеріалів 	Рокоманюк Марія Василівна 	152 Метрологія та інформаційно-вимірювальна техніка 	25.06.2025 р. 	205
146 	Моделі системи та інформаційної технології підвищення ефективності реклами в соціальних мережах 	Роїк Остап Орестович 	126 Інформаційні системи та технології 	21.07.2026 р. 	477
147 	Укочуваний дорожній бетон з використанням цементних композицій, модифікованих органо-мінеральними добавками 	Розмус Дмитро Іванович 	192 Будівництво та цивільна інженерія 	12.08.2026 р. 	369
148 	Бетони з підвищеними експлуатаційними властивостями на основі заповнювачів рециклінгу бетону 	Рихліцька Оксана Віталіївна 	192 Будівництво та цивільна інженерія 	23.06.2023 р. 	43
149 	Інформаційна технологія підвищення ефективності згорткових нейронних мереж з використанням перетворення Хартлі 	Рикмас Роман Володимирович 	122 Комп’ютерні науки 	12.08.2026 р. 	502
150 	Напружено-деформований стан підсилених залізобетонних труб при дії змінних навантажень і впливів 	Рибак Роман Тарасович 	192 Будівництво та цивільна інженерія 	30.07.2025 р. 	233
151 	Методика інтерактивного вебкартографування постмілітарних об’єктів історико-культурної спадщини (на прикладі Львівської області) 	Репехович Степан Ігорович 	103 Науки про Землю 	18.07.2025 р. 	246
152 	Педагогічні умови розвитку цифрової компетентності вчителя в умовах неперервної освіти 	Ратушний Володимир Романович 	011 Освітні, педагогічні науки 	04.08.2026 р. 	351
153 	Інформаційна технологія аналізу медичних даних на основі ансамблю методів обчислювального інтелекту 	Пукач Павло Петрович 	122 Комп'ютерні науки 	10.07.2023 р. 	48
154 	Формування товарної структури національного експорту на ринки Європейського Союзу 	Пузраков Анатолій Володимирович 	292 Міжнародні економічні відносини 		482
155 	Прогнозування попиту на транспортні послуги з перевезень вантажів у містах 	Пруський Євген Володимирович 	275 Транспортні технології (за видами) 	07.08.2026 р. 	368
156 	Регенерація відпрацьованих напівсинтетичних моторних олив 	Прокоп Роман Іванович 	161 Хімічні технології та інженерія 	21.12.2023 р. 	79
157 	Підвищення ефективності технологічного процесу механічного оброблення деталей з хромо-нікелевих сплавів на основі імітаційного моделювання процесу формоутворення 	Проданчук Олег Олександрович 	131 Прикладна механіка 	14.08.2025 р. 	219
158 	Підвищення ефективності міжнародних вантажних перевезень автопоїздами на основі методу аналітичної ієрархії Сааті 	Приходько Всеволод Едуардович 	275 Транспортні технології (за видами) 	11.08.2026 р. 	386
159 	Підвищення показників якості сприйняття інфокомунікаційних послуг в інтелектуальних мережах нового покоління 	Прислупський Андрій Іванович 	172 Телекомунікації та радіотехніка 	30.08.2022 р. 	17
160 	Масштабування бізнесу в умовах розвитку зовнішньоекономічної діяльності 	Потюк Юрій Борисович 	073 Менеджмент 		483
161 	Формування правової культури майбутніх магістрів менеджменту 	Попко Мар'ян Маркіянович 	011 Освітні, педагогічні науки 	04.08.2026 р. 	352
162 	Одержання амідів вищих жирних кислот рослинного походження для модифікування бітумів 	Поляк Ольга Євгенівна 	161 Хімічні технології та інженерія 	03.06.2026 р. 	330
163 	Моделі та методи інформаційної технології оцінювання рівня туристичного руху 	Поліщук Інна Вячеславівна 	126 Інформаційні системи та технології 	12.12.2025 р. 	283
164 	Біотехнологія композиційних препаратів на основі нових N-вмісних гетероциклічних похідних 1,4-нафтохінону та біосурфактантів, властивості і застосування 	Поліш Наталія Володимирівна 	162 Біотехнології та біоінженерія 	29.08.2022 р. 	18
165 	Управління та страхування ризиків інвестиційної діяльності бізнес-структур 	Покорчак Святослав Андрійович 	072 Фінанси, банківська справа та страхування 	12.06.2026 р. 	341
166 	Методи та засоби аналізу відеопотоків та пошуку подібностей у контекстно-орієнтованих системах відеоінформації 	Поберейко Петро Богданович 	122 Комп'ютерні науки 	18.07.2025 р. 	217
167 	Розробка методу анонімності користувачів у месенджерах на основі блокчейн технології 	Побережник Василь Олегович 	125 «Кібербезпека» 		445
168 	Інформаційна технологія формування та прогностичного оцінювання якості процесу верстання книжкових видань 	Плахтина Зореслава Ігорівна 	126 Інформаційні системи та технології 	04.06.2026 р. 	338
169 	Адаптивна система вимірювання кількості плинного енергоносія 	Пістун Олег Ігорович 	151 Автоматизація та комп’ютерно-інтегровані технології 	02.06.2025 р. 	202
170 	Розвиток системи управління бізнес-процесами на основі рефлексивного підходу 	Підвальний Мар’ян Володимирович 	076 Підприємництво, торгівля та біржова діяльність 	30.01.2025 р. 	168
171 	Підвищення ефективності функціонування безпровідних сенсорних мереж на основі генетичного алгоритму 	Пиріг Ярослав Романович 	172 Телекомунікації та радіотехніка 	10.02.2026 р. 	287
172 	Основи технології сорбентів з додатковими каталітичними властивостями на основі природного клиноптилоліту, модифікованого мангану (IV) оксидом 	Пиріг Марта Андріївна 	161 Хімічні технології та інженерія 	28.07.2026 р. 	391
173 	Архітектурна типологія і проєктування житла швидкого зведення в Україні 	Пиндзин Мар'ян Васильович 	191 Архітектура та містобудування 	29.07.2026 р. 	441
174 	Розвиток цифрових платіжних технологій в електронному бізнесі 	Печенко Руслан Орестович 	072 Фінанси, банківська справа та страхування 	12.06.2026 р. 	340
175 	Педагогічні умови взаємодії закладів фахової передвищої освіти та роботодавців у підготовці фахівців ІТ-сфери 	Петровський Богдан Ігорович 	015 Професійна освіта (за спеціалізаціями) 	05.08.2026 р. 	357
176 	Розробка методології побудови децентралізованих баз даних на основі блокчейн технології 	Петрів Петро Петрович 	125 «Кібербезпека» 		444
177 	Моніторинг стану хвойних лісів Прикарпатського регіону за космічними знімками 	Петрик Юлія Валеріївна 	193 Геодезія та землеустрій 	23.05.2025 р. 	195
178 	Стабілізація безпілотних літальних апаратів методами навчання з підкріпленням 	Петренко Дмитро Олександрович 	122 Комп'ютерні науки 	21.05.2026 р. 	306
179 	Український жіночий рух у вільному світі: історико-правовий вимір 	Перів Ірина Володимирівна 	081 Право 	12.05.2026 р. 	346
180 	Підвищення ефективності функціонування хмарних систем для інформаційно-комунікаційних сервісно-орієнтованих мереж 	Пелех Назар Володимирович 	172 Телекомунікації та радіотехніка 	10.06.2022 р. 	2
181 	Методи та засоби автоматизованої побудови візуальних об'єктів у задачах геймифікації 	Пастушенко Денис Сергійович 	122 Комп’ютерні науки 		516
182 	Формування цифрової компетентності майбутніх магістрів у сфері туризму 	Пастернак Володимир Васильович 	011 Освітні, педагогічні науки 	06.08.2026 р. 	364
183 	Технології FrontEnd в процесах побудови інформаційних систем для "розумних міст" 	Пасічник Сергій Олександрович 	126 Інформаційні системи та технології 	10.08.2026 р. 	313
184 	Несуча здатність і деформативність монолітних залізобетонних плит з вставками в двох напрямках 	Партута Володимир Петрович 	192 Будівництво та цивільна інженерія 	05.11.2024 р. 	163
185 	Принципи та засоби формування і розвитку медійності архітектури громадських просторів 	Парнета Мар'яна Богданівна 	191 Архітектура та містобудування 	02.05.2024 р. 	113
186 	Інформаційна технологія оптимізації ресурсів в нарізці графічних об'єктів на плотерах 	Паламарчук Дмитро Юрійович 	126 Інформаційні системи та технології 		450
187 	Побудова програмного забезпечення інформаційної системи формування спеціалізованих тематичних віртуальних спільнот 	Паздерська Руслана Степанівна 	121 Інженерія програмного забезпечення 	08.08.2024 р. 	152
188 	Основи технології окиснення ароматичних альдегідів на мікрогелевих каталізаторах 	Павлюк Анастасія Сергіївна 	161 Хімічні технології та інженерія 	01.08.2025 р. 	251
189 	Технології хмарних та туманних обчислень в перспективних медичних інформаційних системах 	Павлів Ігор Ігорович 	126 Інформаційні системи та технології 	04.06.2026 р. 	314
190 	Удосконалення публічного управління у сфері земельних відносин в контексті розвитку територіальних громад 	Павлів Оксана Володимирівна 	281 Публічне управління та адміністрування 	07.08.2025 р. 	253
191 	Сучасні цифрові бізнес-комунікації: "вербальний аспект" 	П'янковський Роман Валерійович 	061 Журналістика 		515
192 	Інститут реабілітації незаконно засуджених осіб в Україні: теоретико-правовий вимір 	Осьмак Андрій Михайлович 	081 Право 	23.06.2026 р. 	360
193 	Інформаційна технологія синтезу тривимірного зображення користувача для мобільних систем доповненої реальності 	Островка Дмитро Васильович 	122 Комп'ютерні науки 	26.12.2023 р. 	86
194 	Управління організаційними змінами в умовах глобалізації 	Осередчук Андрій Миронович 	073 Менеджмент 		406
195 	Вдосконалення виявлення кіберзагроз в Active Directory за допомогою кореляції закономірностей в кіберзлочинах та аномальної активності 	Опанович Максим Юрійович 	125 Кібербезпека 	11.06.2026 р. 	334
196 	Формування системи оптимізації імпортної діяльності в національній економіці 	Оліховський Віталій Степанович 	292 Міжнародні економічні відносини 		431
197 	Кримінально-правова протидія корупційним або пов’язаним з корупцією правопорушенням у сфері охорони здоров'я 	Олійник Андрій Миронович 	081 Право 	26.05.2026 р. 	327
198 	Кримінальна відповідальність за пропаганду, планування, підготовку, розв'язування та ведення агресивної війни 	Олійник Христина Василівна 	081 Право 	23.02.2023 р. 	33
199 	Формування бізнес-процесів ІТ-підприємств в умовах розвитку цифрової економіки 	Олексів Тарас Ігорович 	073 Менеджмент 		481
200 	Методи та засоби розроблення інтелектуальної системи біометричного захисту з елементами машинного навчання 	Олексів Назар Тарасович 	126 Інформаційні системи та технології 	29.06.2026 р. 	311
201 	Державне регулювання транскордонного співробітництва на регіональному рівні 	Олдак Людмила Ярославівна 	281 Публічне управління та адміністрування 		497
202 	Інформаційна технологія створення навчального контенту з використанням доповненої реальності 	Нікітін Віталій Олександрович 	126 Інформаційні системи та технології 	03.08.2026 р. 	437
203 	Формування державної політики національного спротиву в умовах трансформацій у військовій сфері 	Наумко Михайло Миколайович 	281 Публічне управління та адміністрування 	12.05.2026 р. 	299
204 	Інформаційна технологія інтелектуальної ієрархічної класифікації коротких описів товарів у сфері електронної комерції 	Нарушинська Ольга Олександрівна 	F3 Комп'ютерні науки 	25.03.2026 р. 	291
205 	Освітня діяльність та педагогічні погляди Омеляна Вишневського (1931–2019) 	Нанівський Роман Семенович 	011 Освітні, педагогічні науки 	10.12.2024 р. 	164
206 	Репутаційний менеджмент підприємств в умовах євроінтеграції 	Налутка Павло Васильович 	073 Менеджмент 		479
207 	Формування проєктної компетентності майбутніх бакалаврів з будівництва та цивільної інженерії в процесі вивчення фахових дисциплін 	Наконечна Марія Володимирівна 	015 Професійна освіта (за спеціалізаціями) 	27.12.2022 р. 	30
208 	Моделювання електромагнітного випромінювання 4G/5G діапазону і оцінка його впливу на організм людини в лабораторних умовах 	Назаровець Тарас Богданович 	122 Комп'ютерні науки 	05.08.2026 р. 	378
209 	Калібрування УЗ сенсорів лінійного переміщення лазерним інтерферометром 	Назаркевич Ігор Богданович 	152 Метрологія та інформаційно-вимірювальна техніка 	02.07.2024 р. 	127
210 	Інформаційна технологія адаптивного управління підприємством з використанням слабких сигналів 	Назаркевич Ганна Ярославівна 	122 Комп'ютерні науки 	18.03.2025 р. 	183
211 	Розвиток соціальної роботи у сфері здоров’я в Канаді та Україні: порівняльний аналіз 	Назар Наталія Іванівна 	231 Соціальна робота 	11.03.2023 р. 	25
212 	Очищення стічних вод магніточутливими біовуглецевими адсорбентами 	Нагурський Назар Олегович 	101 Екологія 	29.07.2026 р. 	459
213 	Організаційно-педагогічні умови інтеграції методів навчання у процесі підготовки бакалаврів галузі права 	Нагірний Володимир Васильович 	011 Освітні, педагогічні науки 	05.08.2026 р. 	302
214 	Політичні чинники абсентеїзму та особливості їхнього впливу на електоральну участь громадян 	Мущенко Яна Олександрівна 	052 Політологія 	03.07.2026 р. 	356
215 	Управління персоналом в системі забезпечення соціально-економічної безпеки підприємства 	Мусянович Олег Андрійович 	073 Менеджмент 		418
216 	Кінематографічний кластер в архітектурі міського простору 	Мусієвська Вероніка Олегівна 	191 Архітектура та містобудування 	26.06.2026 р. 	395
217 	Методи та засоби розпізнавання рухомих об’єктів в телекомунікаційних системах в реальному масштабі часу 	Мрак Василь Богданович 	172 Телекомунікації та радіотехніка 	04.10.2024 р. 	160
218 	Методи маскування об'єктів на тепловізійних зображеннях 	Мочурад Олексій Петрович 	152 Метрологія та інформаційно-вимірювальна техніка 		488
219 	Підсистеми температурного контролю кіберфізичних систем 	Мідик Андрій-Володимир Володимирович 	152 Метрологія та інформаційно-вимірювальна техніка 	16.12.2022 р. 	6
220 	Соціально-політична інтернет-поведінка молоді як чинник розвитку громадянського суспільства в Україні 	Мишок Романа Романівна 	054 Соціологія 	08.09.2023 р. 	64
221 	Несуча здатність залізобетонних балок з нерівномірними пошкодженнями при дії навантаження 	Михалевський Назарій Анатолійович 	192 Будівництво та цивільна інженерія 	11.08.2026 р. 	461
222 	Удосконалення пресів штанцювального обладнання застосуванням секційної натискової плити 	Михайлів Юрій Юрійович 	133 Галузеве машинобудування 		490
223 	Система підтримки та прийняття рішень аналізу рекрутингової діяльності на основі великих даних 	Михайлишин Владислав Юрійович 	122 Комп'ютерні науки 	13.08.2024 р. 	137
224 	Формування управлінської компетентності майбутніх лікарів в умовах університетської освіти 	Миськів Максим Андрійович 	011 Освітні, педагогічні науки 	04.08.2026 р. 	349
225 	Формування та розвиток івент-менеджменту 	Мисик Вікторія Миколаївна 	073 Менеджмент 	28.08.2023 р. 	63
226 	Методи гідравлічного розрахунку точкових дощоприймальних елементів 	Мисак Павло Васильович 	192 Будівництво та цивільна інженерія 	04.07.2024 р. 	125
227 	Удосконалення системи зв’язків з громадськістю у Збройних Силах України з урахуванням досвіду армій країн-членів НАТО 	Миронович Галина Анатоліївна 	281 Публічне управління та адміністрування 	04.04.2025 р. 	188
228 	Формування оціночної інформаційної моделі для розвитку системи земельного адміністрування в Україні 	Миронов Олександр Володимирович 	193 Геодезія та землеустрій 	03.08.2026 р. 	326
229 	Магнітотранспортні характеристики ниткоподібних кристалів Bi2Se3 для сенсорної електроніки 	Микитюк Михайло Петрович 	153 Мікро- та наносистемна техніка 	22.05.2026 р. 	295
230 	Інформаційна технологія оцінювання якості проєктування та дизайну вебдодатків 	Меренич Юліан Юліанович 	126 Інформаційні системи та технології 	16.01.2026 р. 	284
231 	Українська комп’ютерна термінологія: формування, системна організація, вектори розвитку 	Ментинська Ірина Богданівна 	035 Філологія 	10.12.2024 р. 	166
232 	Використання ефекту сповільненої флуоресценції для підвищення ефективності органічних світлодіодів 	Мельников Сергій Олександрович 	171 Електроніка 	26.07.2024 р. 	130
233 	Інформаційна технологія управління системою акумулювання електроенергії в розумних мікромережах 	Мельник Михайло Васильович 	122 Комп'ютерні науки 	05.06.2026 р. 	337
234 	Формування системи інтелектуального управління в діяльності публічної служби 	Меленчук Ігор Ігорович 	281 Публічне управління та адміністрування 	27.07.2026 р. 	474
235 	Оцінювання та розвиток корпоративної соціальної відповідальності в контексті поглиблення міжнародного співробітництва між Україною та Китаєм 	Мей Фей 	292 Міжнародні економічні відносини 	30.06.2025 р. 	214
236 	Забезпечення принципу публічності у прийнятті управлінських рішень в Україні 	Медуна Богдана Любомирівна 	281 Публічне управління та адміністрування 	09.05.2025 р. 	197
237 	Підвищення ефективності використання ресурсів та якості сприйняття послуг в інтелектуальних програмно-конфігурованих мережах 	Медвецький Михайло Богданович 	172 Телекомунікації та радіотехніка 	14.08.2025 р. 	240
238 	Методи планування шляху без колізій для надлишкового багатосуглобового шарнірного маніпулятора 	Медвідь Андрій Ярославович 	122 Комп'ютерні науки 	11.06.2026 р. 	335
239 	Багатоквартирне житло з підвищеною опірністю до поширення епідемій 	Мацола Василь Вікторович 	191 Архітектура та містобудування 		509
240 	Методи та засоби організації пасажирських перевезень у розумному місті 	Мацелюх Юрій Романович 	124 Системний аналіз 	17.06.2026 р. 	308
241 	Розвиток національної економіки на засадах міжнародного досвіду 	Матвієвський Назар Анатолійович 	292 Міжнародні економічні відносини 		344
242 	Формування громадянської компетентності студентів в освітньому середовищі закладу вищої освіти 	Маслюк Андрій Дмитрович 	011 Освітні, педагогічні науки 	03.08.2026 р. 	348
243 	Формування виробничої стратегії підприємств в умовах циркулярної економіки 	Маслак Тетяна Олександрівна 	051 Економіка 	14.08.2025 р. 	212
244 	Методи виявлення аномалій міждоменної маршрутизації з інтеграцією пояснювального штучного інтелекту 	Маруняк Станіслав Тарасович 	172 Телекомунікації та радіотехніка 	26.06.2026 р. 	385
245 	Методи і засоби пояснювального штучного інтелекту для прогнозування поширення епідемій 	Мартьянов Дмитро Ігорович 	122 Комп'ютерні науки 	11.06.2026 р. 	336
246 	Інтелектуальні сенсори тиску 	Маркович Віктор Йосифович 	175 Інформаційно-вимірювальні технології 	20.02.2026 р. 	285
247 	Правова ідеологія як державно-суспільний феномен 	Маркович Христина Михайлівна 	081 Право 	06.05.2025 р. 	189
248 	Формування енергоефективності у життєвому циклі об’єктів житлового будівництва 	Марко Олександр Йосифович 	051 Економіка 		514
249 	Сучасні PR-технології у формуванні іміджу успішних українських видавництв 	Манзик Олександр Русланович 	061 Журналістика 	08.09.2025 р. 	274
250 	Підвищення рівня екологічної безпеки антропоекосистем шляхом знешкодження техногенного забруднення біологічним методом 	Мандрик Соломія Тарасівна 	101 Екологія 	24.07.2025 р. 	232
251 	Маркетингова політика підприємства на ринку енергозберігаючих матеріалів 	Маляр Роман Васильович 	075 Маркетинг 	08.08.2026 р. 	415
252 	Розроблення системи віддаленого контролю та керування розподіленими об'єктами нафтовидобувної промисловості 	Маляр Микола Андрійович 	122 Комп’ютерні науки 	04.08.2026 р. 	435
253 	Методи еволюції схеми даних для супроводу документоорієнтованих баз даних 	Малий Роман Михайлович 	121 Інженерія програмного забезпечення 	11.06.2026 р. 	315
254 	Оцінювання впливу міжнародної міграції на національні економіки 	Маліброда Святослав Богданович 	292 Міжнародні економічні відносини 	02.04.2025 р. 	177
255 	Тактичне планування в системі циркулярних бізнес-моделей підприємств 	Малик Максим Васильович 	073 Менеджмент 		510
256 	Математичне моделювання термометричної характеристики термісторів 	Малачівський Роман Петрович 	113 Прикладна математика 	07.04.2026 р. 	288
257 	Методи та засоби покращення якості цифрових відеозображень 	Максимів Микола Романович 	123 «Комп’ютерна інженерія» 	04.08.2026 р. 	442
258 	Отримання та електрофізичні властивості низькорозмірних клатратних структур для пристроїв електроніки та автономної енергетики 	Максимич Віталій Миколайович 	105 Прикладна фізика та нанометеріали 	28.08.2023 р. 	60
259 	Філософсько-правова природа категорії «агресія» 	Максим Христина Богданівна 	081 Право 	02.02.2024 р. 	109
260 	Адміністративно-правове запобігання поширенню коронавірусної хвороби (COVID-19): світовий та вітчизняний досвід 	Макарчук Ксенія Володимирівна 	081 Право 	11.08.2025 р. 	261
261 	Синтез дискретно-континуальних міжрезонансних коливальних систем вібраційних машин з електромагнітним приводом 	Майструк Павло Володимирович 	131 Прикладна механіка 	10.01.2024 р. 	85
262 	Гідрогелеві желатинвмісні матеріали для медичних застосувань: синтез та дослідження 	Майкович Ольга Володимирівна 	102 Хімія 	07.07.2025 р. 	220
263 	Управління мультикультурною командою в ІТ-проєктах 	Мазур Назарій Ярославович 	073 Менеджмент 	09.07.2026 р. 	382
264 	Технологічні засади електрохімічного синтезу стабілізованих наночастинок срібла 	Мазур Артур Сергійович 	161 Хімічні технології та інженерія 	12.08.2024 р. 	144
265 	Громадська участь у функціонуванні судової влади як засіб формування державної євроінтеграційної політики України 	Мазовіта Андрій Богданович 	081 Право 	17.06.2026 р. 	362
266 	Синтез біомедичних зображень на основі глибоких нейронних мереж 	Лящинський Петро Борисович 	122 Комп'ютерні науки 	23.08.2024 р. 	150
267 	Психологічні умови розвитку соціального інтелекту обдарованих учнів 	Любочкіна Ганна Олексіївна 	053 Психологія 	30.06.2026 р. 	458
268 	Формування соціально-орієнтованого маркетингового середовища територіальних громад 	Любка Віталій Володимирович 	075 Маркетинг 	14.05.2026 р. 	342
269 	Методи та засоби створення адаптивних програмних систем на основі онтологій 	Луцик Ілля Ігорович 	121 Інженерія програмного забезпечення 	13.02.2025 р. 	169
270 	Інформаційна технологія захисту даних у реальному часі для мобільних смарт-систем з використанням нейроподібних мереж 	Лукащук Юрій Андрійович 	122 Комп'ютерні науки 	19.12.2023 р. 	80
271 	Розвиток інструментів участі громадян у місцевому самоврядуванні (на прикладі м. Львова) 	Лукашевський Юрій Олегович 	281 Публічне управління та адміністрування 	31.05.2024 р. 	126
272 	Удосконалення технології відтворення творів графічного мистецтва методом плоского друку (літографії) 	Локатир Богдан Іванович 	186 Видавництво та поліграфія 		501
273 	Формування та властивості наношарів прищеплених температуро-чутливих полімерних щіток з включеними неорганічними наночастинками 	Ліщинський Остап Романович 	102 Хімія 	27.05.2025 р. 	199
274 	Психологічні особливості сімейних настанов викладачів закладів вищої освіти 	Лінь Юаньюе 	053 Психологія 	30.07.2026 р. 	498
275 	Професійна підготовка магістрів з музичної терапії в університетах США 	Лі Шаньінь 	011 Освітні, педагогічні науки 	11.02.2025 р. 	174
276 	Урбаністичні фортифікаційні комплекси міст Поділля у ІI пол. XVI-I пол. XVII ст 	Литвинчук Ілля Володимирович 	191 Архітектура та містобудування 	01.07.2024 р. 	146
277 	Механізми управління інвестиційною безпекою держави в умовах сталого розвитку 	Лисачок Алла Василівна 	281 Публічне управління та адміністрування 	07.11.2023 р. 	53
278 	Розробка методів застосування рідких продуктів термічної деструкції відпрацьованих автомобільних шин 	Липко Юрій Васильович 	161 Хімічні технології та інженерія 	07.08.2024 р. 	141
279 	Впровадження цифрових онлайн-сервісів для активізації реформи децентралізації в Україні 	Леськів Тарас Сергійович 	281 Публічне управління та адміністрування 	14.07.2026 р. 	487
280 	Формування регіональних механізмів розвитку смарт-спеціалізації «креативні індустрії» 	Левицька Яна Вікторівна 	281 Публічне управління та адміністрування 	27.09.2022 р. 	23
281 	Підвищення рівня екологічної безпеки атмосферного повітря підприємств будівельної промисловості (на прикладі ПрАТ «Івано-Франківськцемент») 	Лацик Наталія Володимирівна 	101 Екологія 	23.07.2025 р. 	225
282 	Метрологічне забезпечення вимірювань характеристик іонізуючого випромінення та модернізація еталонної бази під вимоги ЄС 	Лазаренко Сергій Леонідович 	152 Метрологія та інформаційно-вимірювальна техніка 	29.08.2023 р. 	66
283 	Інтертекстуальність жанрів українського сегмента інтернету 	Лаврів Мар'яна Мирославівна 	035 Філологія 		88
284 	Методи та засоби пошуку та розпізнавання об’єктів у відеозображеннях на мобільній платформі в реальному часі 	Кушнір Дмитро Олександрович 	123 Комп'ютерна інженерія 	28.06.2023 р. 	52
285 	Інформаційна технологія блокчейн для опрацювання великих даних 	Кучковський Володимир Володимирович 	122 Комп'ютерні науки 	25.01.2023 р. 	29
286 	Розроблення білих світловипромінювальних структур на основі синіх флуоресцентних та ексиплексоутворюючих органічних емітерів 	Куцій Степан Андрійович 	171 Електроніка 	29.08.2022 р. 	16
287 	Одержання палив і модифікаторів в’яжучих матеріалів з продуктів піролізу вживаних автомобільних шин 	Кухар Олег Миронович 	161 Хімічні технології та інженерія 	06.08.2026 р. 	439
288 	Покращення захисту інформації при передачі бездротовими системами 	Кутень Роман Богданович 	125 Кібербезпека 	17.09.2024 р. 	154
289 	Методологія підвищення захищеності об'єктів критичної інфраструктури за рахунок перехресного впровадження стандартів аудиту з кібербезпеки 	Курій Євгеній Олегович 	125 Кібербезпека 	13.08.2024 р. 	133
290 	Нормативно-технічне забезпечення якості монтажу моноскляних конструкцій 	Куриляк Назар Ігорович 	152 «Метрологія та інформаційно-вимірювальна техніка» 	10.08.2026 р. 	475
291 	Взаємоспектральний аналіз періодично нестаціонарних випадкових процесів 	Курапов Павло Ростиславович 	113 Прикладна математика 	11.07.2023 р. 	50
292 	Розроблення пластифікованих полілактид-крохмальних матеріалів 	Куліш-Пеленська Божена Ігорівна 	102 Хімія 	14.08.2025 р. 	258
293 	Методи та алгоритми захищеного розподіленого зберігання даних на основі надлишкової системи залишкових класів 	Кулина Сергій Васильович 	125 Кібербезпека 	30.09.2023 р. 	75
294 	Інформаційна технологія імерсивної взаємодії користувачів та їх агентів у середовищі віртуальної реальності на базі ігрової платформи 	Кулик Юрій-Марко Романович 	122 Комп’ютерні науки 	15.08.2026 р. 	491
295 	Удосконалення технологічного процесу флексографічного друку гнучких паковань 	Кукура Тетяна Юріївна 	186 Видавництво та поліграфія 	30.07.2025 р. 	210
296 	Обмеження прав людини як засіб протидії загрозам громадського здоров’я 	Куксов Владислав Геннадійович 	081 Право 	23.06.2026 р. 	325
297 	Публічне управління інформаційною безпекою в органах місцевого самоврядування 	Кукляк Роман Ігорович 	281 Публічне управління та адміністрування 	07.07.2026 р. 	472
298 	Закономірності фільтраційного сушіння сірникової соломки 	Кузьмінчук Тетяна Анатоліївна 	161 Хімічні технології та інженерія 	24.06.2026 р. 	304
299 	Фемтосекундна лазерна обробка як інструмент покращення поверхневих властивостей металів для сенсорів та суперконденсаторів 	Кузнєцов Олександр Валентинович 	153 Мікро- та наносистемна техніка 	22.08.2025 р. 	259
300 	Синтез енергоформуючого керування електротехнічними комплексами із застосуванням декомпозиції 	Кузик Ростислав-Іван Валерійович 	141 Електроенергетика, електротехніка та електромеханіка 	03.04.2025 р. 	182
301 	Формування адаптаційних систем менеджменту підприємств до ринкових флуктуацій 	Кубант Андрій Андрійович 	073 Менеджмент 	14.07.2026 р. 	416
302 	Система підтримки прийняття рішень сумісності окремих компонент з використанням онтологічного підходу 	Крупа Дмитро Васильович 	126 Інформаційні системи та технології 	04.06.2026 р. 	310
303 	Екобезпечна утилізація побутових пластикових відходів в технологіях із завершальним біорозкладом 	Крилова Галина Василівна 	101 Екологія 	30.03.2023 р. 	38
304 	Технологія виявлення та блокування ін’єкційних атак на веб-ресурси на основі машинного навчання з інтеграцією в середовище контейнерної оркестрації 	Кравчук Назар Вікторович 	125 Кібербезпека 		399
305 	Соціально-психологічні чинники феномену імпостора в студентської молоді 	Костюченко Євгенія Анатоліївна 	053 Психологія 	04.06.2026 р. 	324
306 	Термодинамічні властивості 2-метил-1,5-диарил-1Н-пірол- 3-карбонових кислот та їх розчинів в органічних розчинниках 	Костюк Ростислав Романович 	102 Хімія 	29.07.2026 р. 	394
307 	Судові органи як суб’єкти адміністративно-правового захисту права громадян на безпечне для життя та здоров’я довкілля в Україні 	Костюк Уляна Ігорівна 	081 Право 	15.04.2025 р. 	180
308 	Системи розподілу прибутків диверсифікованих бізнес-структур 	Кособуцький Микола Олексійович 	051 Економіка 		513
309 	Розвиток інструментів управління ESG-активністю підприємств на засадах досягнення цілей сталого розвитку 	Корчагіна Любов Федорівна 	073 Менеджмент 	10.04.2025 р. 	187
310 	Підвищення ефективності інформаційної технології опрацювання графічних зображень 	Кордюк Роман Ігорович 	126 Інформаційні системи та технології 		489
311 	Несуча здатність залізобетонних балок з пошкодженнями робочої арматури, підсилених карбоновими стрічками 	Копійка Надія Сергіївна 	192 Будівництво та цивільна інженерія 	19.09.2025 р. 	271
312 	Розвиток інструментів управління людським капіталом на підприємствах 	Копач Тетяна Михайлівна 	073 Менеджмент 	30.07.2025 р. 	249
313 	Цілеспрямований пошук перспективних антимікробних та антивірусних субстанцій серед S-естерів 4-ациламінобензентіосульфокислот 	Копак Назарій Андрійович 	226 Фармація, промислова фармація 	02.08.2024 р. 	142
314 	Формування та розвиток системи моніторингу діяльності бізнес-структур 	Коновалюк Ірина Василівна 	076 Підприємництво, торгівля та біржова діяльність 	26.12.2023 р. 	94
315 	Екологічно безпечне адсорбційне очищення промислових стоків від органічних сполук 	Коновалов Олег Володимирович 	101 Екологія 	22.07.2026 р. 	457
316 	Методи і засоби розроблення інформаційної платформи з віртуальною примірочною 	Кондра Артур Ігорович 	124 Системний аналіз 	07.08.2026 р. 	373
317 	Адаптація адміністративного судочинства до викликів цифрового суспільства 	Колтун Юрій Мирославович 	081 Право 	16.06.2026 р. 	363
318 	Формування іншомовної комунікативної компетентності майбутніх фахівців ІТ-сфери у закладах фахової передвищої освіти 	Козубська Світлана Володимирівна 	015 Професійна освіта (за спеціалізаціями) 	10.12.2025 р. 	281
319 	Особливості формування однородинного житла на основі різних архітектурно-конструктивно-технологічних систем (на прикладі західних областей України) 	Козел Максим Миколайович 	191 Архітектура та містобудування 	12.08.2025 р. 	263
320 	Бізнес-моделювання інтелектуально-інноваційних підприємств 	Козевич Ростислав Ігорович 	051 Економіка 		417
321 	Несуча здатність тонких багатошарових скляних балок 	Козак Роман Петрович 	192 Будівництво та цивільна інженерія 	12.04.2024 р. 	108
322 	Формування та використання тактичних інструментів економічного розвитку підприємств в умовах євроінтеграції 	Ковток Галина Іванівна 	292 Міжнародні економічні відносини 		460
323 	Просторово-планувальна організація територій проведення зимових Олімпійських Ігор 	Ковпак Володимир Юрійович 	191 Архітектура та містобудування 	05.08.2025 р. 	243
324 	Розвиток механізмів тактичного управління в діяльності суб’єктів е-бізнесу 	Ковальчук Юрій Ігорович 	076 Підприємництво, торгівля та біржова діяльність 	26.06.2026 р. 	372
325 	Удосконалення штанцювального преса застосуванням сегментного натискного засобу 	Книш Ростислав Олегович 	133 Галузеве машинобудування 	11.08.2026 р. 	434
326 	Несуча здатність залізобетонних елементів, відновлених композитними матеріалами 	Клим Андрій Богданович 	192 Будівництво та цивільна інженерія 	15.08.2025 р. 	252
327 	Ціннісно-правові константи перехідного правосуддя 	Клим Оксана Юріївна 	081 Право 	12.11.2025 р. 	279
328 	Модель криптостійкого гібридного генератора псевдовипадкових послідовностей на основі аудіоентропії та динамічних нелінійних булевих функцій 	Кіх Михайло Васильович 	125 Кібербезпека 		383
329 	Формування систем менеджменту «розумних підприємств» в умовах розвитку 4D-індустрії 	Кісь Святослав Юліанович 	073 Менеджмент 	05.08.2025 р. 	238
330 	Розвиток системи зовнішнього інвестування підприємств у періоди воєнного стану та поствоєнного періодів 	Кісь Мар'яна Ярославівна 	292 Міжнародні економічні відносини 		404
331 	Основи технологій одержання полілактидних композитів з мінеральними наповнювачами 	Кисіль Христина Володимирівна 	161 Хімічні технології та інженерія 	08.05.2026 р. 	301
332 	Основи технологій одержання полілактидних композитів і виробів з них 3Д друком 	Кечур Дмитро Ігорович 	161 Хімічні технології та інженерія 	05.08.2025 р. 	230
333 	Інформаційна технологія розроблення специфікації при реінжинірингу ІТ-проєктів 	Керницький Олег Богданович 	122 Комп’ютерні науки 	14.08.2026 р. 	503
334 	Заборона як метод правового регулювання: теоретичні та практичні аспекти 	Кельман Ростислав Михайлович 	081 Право 	05.05.2025 р. 	191
335 	Розробка рідкокристалічних чутливих елементів оптичних сенсорів для визначення концентрації парів ацетону та спиртів 	Качурак Юрій Михайлович 	171 Електроніка 	26.07.2024 р. 	129
336 	Фармакогностичне дослідження рослин родини Ranunculaceae та розробка субстанцій різної спрямованості дії на їх основі 	Карпюк Вікторія Русланівна 	226 Фармація, промислова фармація 	31.08.2023 р. 	70
337 	Побудова системи підтримки прийняття рішень на основі онтологічних мереж 	Карпов Ігор Андрійович 	124 Системний аналіз 	19.09.2023 р. 	68
338 	Підготовка педагогічних працівників до проєктування безпечного освітнього середовища в закладі фахової передвищої освіти 	Карп Роман Васильович 	015 Професійна освіта (за спеціалізаціями) 	06.08.2026 р. 	361
339 	Функціонування та розвиток ринку інформаційних технологій на основі ціннісного підходу 	Карп'як Анастасія Орестівна 	073 Менеджмент 	09.11.2022 р. 	26
340 	Інформаційна технологія степенево-лінійного перетворення зображень у додрукарських процесах 	Кавин Святослав Ярославович 	126 Інформаційні системи та технології 	08.08.2025 р. 	250
341 	Діджиталізація державнтих послуг в контексті демократичного розвитку суспільства 	Ісаченко Дмитро Сергійович 	281 Публічне управління та адміністрування 	26.06.2026 р. 	408
342 	Стратегічні імперативи забезпечення розвитку інноваційного підприємництва в умовах міжнародного економічного співробітництва 	Ільчишин Микола Зіновійович 	292 Міжнародні економічні відносини 		432
343 	Гнучке управління проектами виробництва високотехнологічних продуктів в умовах цифровізації 	Ільницький Віталій Станіславович 	073 Менеджмент 	05.08.2024 р. 	145
344 	Формування систем міжнародних транспортних перевезень в екстремальних умовах 	Ільницький Віктор Володимирович 	292 Міжнародні економічні відносини 	17.07.2026 р. 	403
345 	Налаштування плазмонного резонансу у металевих наноструктурах для підсилення ближнього поля 	Ільїн Олександр Вікторович 	171 Електроніка 	12.08.2026 р. 	381
346 	Методи та засоби візуальної геолокації для безпілотних літальних апаратів 	Ілечко Роман Ігорович 	122 Комп’ютерні науки 		504
347 	Розроблення методів синтезу нанорозмірних полімерних та полімер-неорганічних щіток зі спеціальними електрофізичними та оптичними властивостями 	Іжик Олег Борисович 	105 Прикладна фізика та нанометеріали 	22.12.2023 р. 	87
348 	Механізми реалізації маркетингових комунікацій в органах публічного управління на регіональному рівні 	Івасюк Євгеній Олександрович 	281 Публічне управління та адміністрування 		517
349 	Охорона культурної спадщини у Східній Галичині: державний сектор та громадські ініціативи (1918–1939) 	Іваньо Святослав Михайлович 	032 Історія та археологія 	13.08.2024 р. 	147
350 	Модель комп'ютерної технології передачі даних гібридною оптико-коаксіальною кабельною мережею 	Іванець Іван Дмитрович 	126 Інформаційні системи та технології 		466
351 	Методи та засоби побудови інтелектуальних систем дослідження параметрів космічної погоди 	Івантишин Данило-Назар Олегович 	124 Системний аналіз 	14.08.2024 р. 	139
352 	Публічне управління розвитку інноваційної екосистеми 	Іванкова Наталія Олегівна 	281 Публічне управління та адміністрування 	02.07.2025 р. 	222
353 	Публічні механізми розвитку інноваційної екосистеми України в процесі трансформації до ЄС 	Зуєв Михайло Ігорович 	281 Публічне управління та адміністрування 	12.06.2026 р. 	414
354 	Трансформація корпоративної культури публічного управління 	Зубко Святослав Віталійович 	281 Публічне управління та адміністрування 	03.09.2024 р. 	158
355 	Інформаційна технологія підтримки прийняття рішень вступників ЗВО України 	Зуб Христина Віталіївна 	126 Інформаційні системи та технології 	14.08.2024 р. 	151
356 	Економічна безпека України: кримінологічні детермінанти та кримінально-правовий захист 	Зотов Нікіта Миколайович 	081 Право 	31.03.2026 р. 	289
357 	Одержання компонентів моторних палив з нафтовмісних відходів 	Знак Юрій Зеновійович 	161 Хімічні технології та інженерія 	03.08.2026 р. 	380
358 	Стратегічне управління підприємствами в умовах циркулярної економіки 	Злотнік Марта Лазарівна 	073 Менеджмент 	29.08.2023 р. 	71
359 	Методи та засоби багатоетапної генерації семантично коректних текстів 	Здебський Петро Васильович 	124 Системний аналіз 	25.07.2024 р. 	135
360 	Системи поведінки споживачів цифрових продуктів IT-підприємств 	Зварич Роман Ігорович 	292 Міжнародні економічні відносини 	07.08.2026 р. 	419
361 	Кримінологічний аспект самогубства в Україні 	Задорожний Назар Михайлович 	081 Право 	21.07.2025 р. 	208
362 	Формування управлінської звітності на логістичних підприємствах 	Заворітній Микола Васильович 	071 Облік і оподаткування 	16.07.2026 р. 	427
363 	Методи та засоби інтелектуального аналізу потокових структурованих даних в задачах моделювання 	Завалій Тарас Ігорович 	122 Комп'ютерні науки 	23.06.2026 р. 	411
364 	Удосконалення методів виявлення програм-вимагачів в режимі реального часу 	Журавчак Даниїл Юрійович 	125 Кібербезпека 	13.08.2024 р. 	132
365 	Удосконалення методології автоматизації тестування на проникнення за допомогою методів машинного навчання 	Журавчак Анастасія Юріївна 	125 Кібербезпека та захист інформації 	11.06.2026 р. 	332
366 	Одержання вуглеводневих смол суспензійною олігомеризацією фракції С9 у присутності амінопероксидів 	Журавський Євгеній Вікторович 	161 Хімічні технології та інженерія 	19.07.2024 р. 	124
367 	Підвищення ефективності стеганографічних систем на основі застосування методів обробки цифрових зображень 	Журавель Юрій Ігорович 	125 «Кібербезпека та захист інформації» 	25.09.2026 р. 	448
368 	Методи та моделі підвищення ефективності функціонування розподілених сервісних систем 	Журавель Станіслав Сергійович 	172 Телекомунікації та радіотехніка 	14.08.2025 р. 	239
369 	Нанокомпозити з підвищеною вогнезахисною ефективністю для сенсорної електроніки 	Жиденко Ілля Володимирович 	171 Електроніка 	15.08.2024 р. 	153
370 	Методи попереднього опрацювання часових рядів для підвищення точності їхнього прогнозування моделями глибинного навчання 	Ємець Кирило Вікторович 	122 Комп'ютерні науки 	01.05.2026 р. 	292
371 	Рекурентні логарифмічні аналого-цифрові перетворювачі 	Єлісєєва Ганна Сергіївна 	123 Комп'ютерна інженерія 	22.12.2023 р. 	95
372 	Обґрунтування режимів світлофорного регулювання з урахуванням пріоритету для громадського транспорту 	Євчук Юрій Юрійович 	275 Транспортні технології (за видами) 	08.08.2025 р. 	234
373 	Методи та засоби інтелектуалізації інформаційно-вимірювальних систем з мультисенсорною конфігурацією 	Дячок Роман Васильович 	123 Комп'ютерна інженерія 	14.07.2023 р. 	51
374 	Формування педагогічної компетентності майбутнього практичного психолога: інтегративно-диференційований підхід 	Дячик Наталія Юріївна 	011 Освітні, педагогічні науки 	12.05.2026 р. 	293
375 	Державний внутрішній фінансовий контроль в правоохоронних органах влади (на прикладі Національної поліції України) 	Духневич Ольга Володимирівна 	281 Публічне управління та адміністрування 	15.02.2024 р. 	110
376 	Методи та засоби інтелектуального аналізу аудіо сигналів для автоматизованого озвучування 	Думин Андрій Романович 	122 Комп'ютерні науки 	25.06.2026 р. 	374
377 	Інструментарій економічного оцінювання ефективності керівних систем бізнес-процесів підприємства 	Дума Олег Ігорович 	073 Менеджмент 	10.04.2025 р. 	184
378 	Митний контроль у системі публічного управління сталим розвитком України в умовах інтеграції України до світового простору 	Дум'як Юрій Любомирович 	281 Публічне управління та адміністрування 	04.10.2023 р. 	76
379 	Рекомендаційна система формування індивідуальних навчальних траєкторій студентів ІТ-спеціальностей 	Дубас Юрій Віталійович 	124 Системний аналіз 	06.03.2024 р. 	98
380 	Удосконалення технологій виготовлення форм глибокого друку для естампних відбитків 	Дрімайло Михайло Михайлович 	186 Видавництво та поліграфія 	05.08.2026 р. 	438
381 	Удосконалення управління персоналом в умовах економічних та інтелектуалізаційних ризиків 	Дрейчук Михайло Анатолійович 	051 Економіка 	07.08.2026 р. 	407
382 	Моделі та методи сегментації смуг у системах керування дорожнім рухом 	Древич Любомир Орестович 	124 Системний аналіз 		476
383 	Методи та засоби інтелектуального аналізу та прогнозування завантаженості транспортних мереж 	Дохняк Богдан-Олександр Олегович 	122 Комп’ютерні науки 		469
384 	Децентралізація державного управління як засіб регіонального розвитку 	Дорош Уляна Миколаївна 	281 Публічне управління та адміністрування 	08.02.2024 р. 	111
385 	Удосконалення імерсивної технології для формування та візуалізації контенту поліграфічних видань 	Дорош Соломія Михайлівна 	186 Видавництво та поліграфія 	08.09.2025 р. 	273
386 	Одержання нафтових бітумів, стійких до технологічного старіння 	Донченко Мирослава Ігорівна 	161 Хімічні технології та інженерія 	17.11.2022 р. 	21
387 	Технологічне забезпечення якості відбитків флексографічного та цифрового друку на папері тиссю 	Довганич Валентина Василівна 	186 Видавництво та поліграфія 	05.09.2025 р. 	277
388 	Удосконалення технології оздоблення друкарських відбитків методом ламінування 	Довганич Анна Василівна 	186 Видавництво та поліграфія 	05.09.2025 р. 	272
389 	Математичне моделювання процесів сушіння багатокомпонентних капілярно-пористих тіл з урахуванням фазових змін 	Дмитрук Анатолій Андрійович 	113 Прикладна математика 	21.03.2025 р. 	185
390 	Реалізація активного впливу на силове навантаження поверхні обтікання в повітряному потоці 	Дмитрів Тарас Васильович 	131 Прикладна механіка 	30.07.2026 р. 	366
391 	Розвиток державно-приватного партнерства в сфері національної безпеки 	Дідич Олег Романович 	281 Публічне управління та адміністрування 	14.08.2025 р. 	268
392 	Захист мовної інформації від лазерних систем акустичної розвідки 	Дзяний Назарій Ростиславович 	125 Кібербезпека та захист інформації 	29.05.2024 р. 	119
393 	Економічне оцінювання та розвиток менторингу в системі кадрового забезпечення суб'єктів господарювання 	Дзвоник Роман Ярославович 	051 Економіка 	06.08.2025 р. 	241
394 	Методи оптимізації безпроводових mesh мереж за допомогою динамічного перепрофілювання проміжних вузлів 	Джусь Олексій Петрович 	122 Комп’ютерні науки 	04.08.2026 р. 	467
395 	Фінанси територіальних громад 	Джурик Христина Богданівна 	072 Фінанси, банківська справа та страхування 	14.09.2022 р. 	13
396 	Підготовка майбутніх фахівців за професією «Живописець» в закладах професійної (професійно-технічної) освіти в умовах інклюзивного навчання 	Денькович Наталія Андріївна 	015 Професійна освіта (за спеціалізаціями) 	29.08.2022 р. 	11
397 	Насильство в шкільному середовищі 	Денисюк Мар'яна Михайлівна 	081 Право 	23.06.2025 р. 	200
398 	Оптимізація компетенцій органів виконавчої влади та органів місцевого самоврядування в умовах реформи децентралізації 	Денега Віталій Богданович 	281 Публічне управління та адміністрування 	05.09.2024 р. 	155
399 	Формування систем управління агропідприємствами на засадах діджиталізації бізнес-процесів 	Демчук Олексій Ігорович 	076 Підприємництво, торгівля та біржова діяльність 	25.06.2026 р. 	370
400 	Бухгалтерський облік та контроль резервів капіталу підприємств 	Демська Юлія Василівна 	071 Облік і оподаткування 	23.08.2022 р. 	8
401 	Нові підходи до застосування амбіполярних молекул у приладах органічної наноелектроніки 	Дева Лілія Ростиславівна 	105 Прикладна фізика та нанометеріали 	27.06.2025 р. 	196
402 	Методологія створення систем захисту образів контейнерів від несанкціонованого втручання 	Дарієнко Дмитро Геннадійович 	125 Кібербезпека 		506
403 	Наукові основи технології амонолізу і трансестерифікації естерів етаноламінами 	Данилюк Роман Володимирович 	161 Хімічні технології та інженерія 	22.08.2023 р. 	58
404 	Інфраструктурне забезпечення інноваційної діяльності підприємств 	Данилович Олена Тарасівна 	051 Економіка 	29.04.2024 р. 	112
405 	Цифрова справедливість: філософсько-правове дослідження 	Гущенков Євгеній Валерійович 	081 Право 	23.06.2026 р. 	388
406 	Біотехнологія косметичного засобу на основі екстракту калусної біомаси Amaranthus L 	Гуцько Катерина Ігорівна 	162 Біотехнології та біоінженерія 	04.08.2026 р. 	468
407 	Управління інноваційним розвитком підприємств в умовах післявоєнної відбудови національної економіки 	Гуцул Юрій Васильович 	073 Менеджмент 		426
408 	Особливості застосування нормативної сили у кліматичній політиці ЄС (на прикладі України) 	Гуцалюк Валерія Віталіївна 	291 Міжнародні відносини, суспільні комунікації та регіональні студії 	30.06.2025 р. 	206
409 	Науково-технічні основи управління метрологічними ризиками калібрувальної лабораторії 	Гут Тарас Павлович 	152 Метрологія та інформаційно-вимірювальна техніка 	03.07.2024 р. 	121
410 	Оцінювання та розвиток інструментів економічного захисту підприємств в умовах міжнародної діяльності 	Гурський Юрій Ярославович 	292 Міжнародні економічні відносини 	05.08.2025 р. 	221
411 	Одержання адгезійної добавки з рідких продуктів коксування вугілля і модифікування нею дорожніх бітумів 	Гурі Ісайя Борбеїйонг 	161 Хімічні технології та інженерія 	10.03.2023 р. 	35
412 	Механізми державного регулювання інвестиційного потенціалу підприємств 	Гурей Ірина Іванівна 	281 Публічне управління та адміністрування 	30.01.2025 р. 	176
413 	Методи та засоби аналізу хімічних сполук засобами штучного інтелекту 	Гурбич Олександр Вікторович 	122 Комп'ютерні науки 	10.07.2023 р. 	46
414 	Формування державної стратегії боротьби з незаконними збройними формуваннями в Україні 	Гунько Леонід Володимирович 	281 Публічне управління та адміністрування 	06.09.2024 р. 	159
415 	Структурно-семантичні та лінгвостатистичні характеристики метафор в українській художній прозі XXI ст.: корпусний підхід 	Гульцьо Олена-Анна Олексіївна 	035 Філологія 	29.05.2026 р. 	318
416 	Несуча здатність, деформативність та довговічність скляних плит, які працюють на згин 	Гула Василина Олегівна 	192 Будівництво та цивільна інженерія 	11.07.2023 р. 	55
417 	Управлінські стратегії професійної підготовки лікарів в умовах трансформації системи охорони здоров'я 	Гукова-Кушнір Гретта Євгенівна 	281 Публічне управління та адміністрування 	18.06.2025 р. 	215
418 	Демократизація судової системи України в умовах європейської інтеграції 	Гук Назар Ігорович 	081 Право 	30.12.2023 р. 	103
419 	Методи та засоби побудови інформаційної системи прогнозування ресурсів в контексті технічного управління проєктами 	Гудь Олекса Олегович 	126 Інформаційні системи та технології 	24.06.2026 р. 	393
420 	Професійна підготовка майбутніх учителів інформатики у закладах вищої освіти Польщі та України в умовах пандемії Covid-19 	Гродзь Наталія Миколаївна 	011 Освітні, педагогічні науки 	18.08.2023 р. 	59
421 	Отримання високоефективних сорбентів для очищення вод і ґрунтів від нафтових забруднювачів 	Гринишин Станіслав Олегович 	161 Хімічні технології та інженерія 	31.07.2026 р. 	379
422 	Одержання компонентів моторних палив на основі продуктів переробки відходів термопластів 	Гринишин Ксенія Олегівна 	161 Хімічні технології та інженерія 	26.06.2024 р. 	123
423 	Підготовка майбутніх фахових молодших бакалаврів з інженерії програмного забезпечення в умовах дистанційного навчання 	Грибик Тарас Тарасович 	015 Професійна освіта (за спеціалізаціями) 	04.08.2026 р. 	353
424 	Удосконалення управлінських механізмів реалізації політики соціального захисту на регіональному рівні 	Грень Тарас Ярославович 	281 Публічне управління та адміністрування 	04.09.2024 р. 	156
425 	Модифікація структури та властивостей матеріалів функціональної електроніки на основі кобальтитів рідкісноземельних елементів 	Греб Василь Миколайович 	153 Мікро- та наносистемна техніка 	15.09.2022 р. 	19
426 	Оцінювання та розвиток інноваційних інструментів маркетингу підприємств в умовах глобальної діджиталізації 	Грабович Ігор Володимирович 	292 Міжнародні економічні відносини 	09.07.2026 р. 	401
427 	Розвиток систем менеджменту рекреаційних підприємств 	Гой Юрій Ростиславович 	073 Менеджмент 	06.08.2026 р. 	478
428 	Розроблення генераторів псевдовипадкових чисел на основі покращених методів обчислення елементарних функцій для задач кібербезпеки 	Горячий Олег Ярославович 	125 Кібербезпека та захист інформації 	29.08.2025 р. 	269
429 	Методи та засоби опрацювання великих даних в розподілених інформаційних системах 	Гордійчук-Бублівська Олена Василівна 	122 Комп'ютерні науки 	29.04.2024 р. 	116
430 	Соціо-культурний контент профспілкового часопису "Czicionka" (1872-1876) 	Гончар Олег Вікторович 	029 Інформаційна, бібліотечна та архівна справа 	28.08.2026 р. 	440
431 	Оптимізація ресурсних потоків підприємств в умовах розвитку мережевої торгівлі 	Голяк Андрій Юрійович 	073 Менеджмент 	14.07.2026 р. 	425
432 	Публічна політика реформування системи медсестринської освіти в Україні 	Головчак Марія Ігорівна 	281 Публічне управління та адміністрування 	02.09.2024 р. 	157
433 	Стратегічне управління конкурентоспроможністю підприємств інформаційних технологій 	Гнат Іван Андрійович 	051 Економіка 		484
434 	Вдосконалення методології побудови безпеки систем з використанням принципів нульової довіри 	Глущенко Павло Костянтинович 	125 «Кібербезпека» 	14.08.2026 р. 	443
435 	Вплив попиту на транспортні послуги з перевезення пасажирів на функціонування транспортної системи міст 	Гіць Іванна Іванівна 	275 Транспортні технології (за видами) 	13.12.2024 р. 	89
436 	Композиційні системи з використанням термоактивованих відходів паперового виробництва для дорожнього будівництва 	Гідей Володимир Володимирович 	192 Будівництво та цивільна інженерія 	30.06.2023 р. 	49
437 	Формування системи збалансованого розвитку підприємств в контексті пріоритетів циркулярної економіки 	Гетманов Сергій Валентинович 	073 Менеджмент 	14.07.2026 р. 	428
438 	Права військовополонених та механізми їх захисту: теоретико-правове дослідження 	Гелемей Юрій Миколайович 	081 Право 	16.06.2026 р. 	323
439 	Удосконалення управління бізнес-процесами підприємства в умовах цифрової трансформації 	Гачко Богдан Мирославович 	073 Менеджмент 		424
440 	Управління трансформаціями бізнесу в умовах цифровізації 	Гарматій Мирослав Юрійович 	051 Економіка 	15.08.2025 р. 	266
441 	Архітектурно-ландшафтні трансформації та шляхи розвитку бальнеологічних курортних поселень Західного регіону України 	Гаращак Назарій Ігорович 	191 Архітектура та містобудування 	05.06.2025 р. 	201
442 	Розвиток психолого-педагогічної компетентності HR-менеджерів в умовах корпоративного навчання 	Гао Фей 	011 Освітні, педагогічні науки 	11.02.2025 р. 	173
443 	Теоретичні засади та методика гідрологічного моделювання зон затоплення з використанням матеріалів дистанційного зондування землі та геоінформаційних систем 	Галочкін Максим Костянтинович 	193 Геодезія та землеустрій 	28.03.2023 р. 	37
444 	Правовий статус іноземців та осіб без громадянства в адміністративному судочинстві 	Галаз Юлія Андріївна 	081 Право 	17.07.2024 р. 	149
445 	Методи комплексного ознакування об’єктів архітектурно-містобудівної спадщини 	Гайдар Володимир Григорович 	191 Архітектура та містобудування 	23.06.2026 р. 	397
446 	Публічне управління енергозбереженням у житловому секторі 	Гавриляк Степан Анатолійович 	281 Публічне управління та адміністрування 		518
447 	Методи та засоби інтелектуального аналізу коротких наборів медичних даних 	Гаврилюк Мирослав Андрійович 	122 Комп'ютерні науки 	03.07.2026 р. 	390
448 	Планування та регулювання ресурсного забезпечення інноваційного розвитку підприємств 	Гаврась Дмитро Русланович 	051 Економіка 	13.08.2025 р. 	213
449 	Smart технології автоматизації процесу витискання олії шнековим пресом 	Гавран Володимир Богданович 	122 Комп'ютерні науки 	09.08.2024 р. 	138
450 	Поліоксазолін- і фтороалкілвмісні поверхнево-активні макроініціатори та функціональні мікро- і наноструктури на їх основі 	Волянюк Катерина Андріївна 	102 Хімія 	02.02.2024 р. 	104
451 	Дорожні катіонні бітумні емульсії на ортофосфорній кислоті з покращеними властивостями 	Волліс Олексій Євгенович 	192 Будівництво та цивільна інженерія 	06.07.2023 р. 	45
452 	Покращення ефективності системи опалення та повітрообміну салону автобуса 	Войчишин Юрій Іванович 	133 Галузеве машинобудування 	22.07.2025 р. 	209
453 	Інформаційна технологія оцінювання проєктів з розробки програмного забезпечення 	Войтишин Володимир Володимирович 	122 Комп'ютерні науки 	29.07.2025 р. 	236
454 	Методи та засоби підвищення якості попереднього опрацювання біометричних зображень 	Возний Ярослав Васильович 	122 Комп'ютерні науки 	31.08.2022 р. 	20
455 	Методи та засоби розподіленого зберігання логістичних даних систем інтернету речей 	Вовчак Орест Володимирович 	123 Комп'ютерна інженерія 	15.07.2026 р. 	389
456 	Управління кадровою безпекою підприємства в умовах інтелектуалізації економіки 	Вітик Богдан Мирославович 	073 Менеджмент 	06.06.2025 р. 	198
457 	Автоматизована система очищення пивного сусла на основі використання нейронних мереж 	Вігуро Максим Ігорович 	141 «Електроенергетика, електротехніка та електромеханіка» 	05.08.2026 р. 	452
458 	Методи та засоби машинного навчання для підвищення енергоефективності будівель 	Вишневський Олександр Костянтинович 	121 Інженерія програмного забезпечення 	27.02.2026 р. 	286
459 	Рекультивація техногенно пошкоджених територій в межах біосферного резервату "Розточчя" 	Вихівська Катерина Миколаївна 	101 Екологія 	30.07.2025 р. 	218
460 	Структури та моделі програмованих систем на чіпі в задачах адаптивної акустики з високою частотною селективністю 	Винарович Роман Ігорович 	122 Комп'ютерні науки 	05.08.2026 р. 	375
461 	Формування та розвиток трансферного потенціалу торговельних підприємств 	Викрикач Максим Михайлович 	076 Підприємництво, торгівля та біржова діяльність 	26.06.2026 р. 	367
462 	Професійний та особистісний розвиток державних службовців на засадах впровадження європейських стандартів 	Весоловська Марія Кімсанівна 	281 Публічне управління та адміністрування 	08.07.2022 р. 	5
463 	Удосконалення публічного управління у сфері дорожнього господарства 	Вершигора Юрій Захарович 	281 Публічне управління та адміністрування 	07.07.2026 р. 	486
464 	Енергоефективні геліосистеми інтегровані в світлопрозорі конструкції будівель 	Венгрин Ірина Іванівна 	192 Будівництво та цивільна інженерія 	20.05.2022 р. 	1
465 	Інвентаризація зелених насаджень в населених пунктах методами наземного лазерного сканування 	Ваш Ярослав Іванович 	193 Геодезія та землеустрій 	28.07.2025 р. 	242
466 	Розробка методу використання програмних приманок як елементів захисту комп'ютерних мереж на основі технології Blockchain 	Василишин Святослав Ігорович 	125 Кібербезпека 	29.08.2023 р. 	67
467 	Взаємовплив глобалізаційних та локальних тенденцій у сучасній практиці візуальних комунікацій в Китаї 	Ван Цзецянь 	022 Дизайн 	18.06.2026 р. 	392
468 	Розвиток співпраці та академічних обмінів між університетами України та Китаю (початок 21 століття) 	Ван Їсюань 	011 Освітні, педагогічні науки 	12.02.2025 р. 	172
469 	Аналіз впливу динаміки числових методів на характеристики електромеханічних систем з цифровим керуванням 	Вакарчук Анастасія Борисівна 	141 Електроенергетика, електротехніка та електромеханіка 	01.02.2024 р. 	100
470 	Вплив легування на стабілізацію фазового стану та властивостей оксидної кераміки на основі ZrO2 	Ваврух Валентина Іванівна 	132 Матеріалознавство 	26.03.2025 р. 	178
471 	Моніторинг небезпечної антропогенної активності регіону міста Стебник за даними аерокосмічного знімання 	Бяла Мирослава Степанівна 	193 Геодезія та землеустрій 	16.06.2026 р. 	322
472 	Несуча здатність та деформативність балок, виготовлених за технологією 3D друку 	Бурак Дмитро Юрійович 	192 Будівництво та цивільна інженерія 	12.08.2026 р. 	462
473 	Оцінка впливу сейсмічності та неприпливних атмосферних навантажень на деформації земної кори за даними ГНСС-вимірів 	Брусак Іван Віталійович 	103 Науки про Землю 	06.12.2022 р. 	28
474 	Використання апарату пневматичного типу для одержання рослинних екстрактів як компонентів лікарських засобів 	Брида Олександр Ростиславович 	226 Фармація, промислова фармація 	27.09.2023 р. 	69
475 	Вплив річки на формування архітектурно-планувальної структури міста (на прикладі м. Ужгорода) 	Боршовський Олег Ігорович 	191 Архітектура та містобудування 	01.03.2024 р. 	106
476 	Синтез та аналіз інтелектуальних спостерігачів координат вектору стану системи керування рухом колеса електромобіля 	Боровець Тарас Васильович 	141 Електроенергетика, електротехніка та електромеханіка 	27.12.2023 р. 	81
477 	Методи та засоби підвищення ефективності розпізнавання об'єктів у закритих приміщеннях 	Борківський Богдан Петрович 	122 Комп’ютерні науки 	14.08.2026 р. 	507
478 	Перспективні стратегії утилізації харчових відходів 	Бойко Руслан Ярославович 	101 Екологія 	04.06.2026 р. 	319
479 	Локалізація прихованих витоків на магістральних водоводах і зонних водопровідних мережах 	Боднар Тарас Сергійович 	192 Будівництво та цивільна інженерія 	28.10.2025 р. 	248
480 	Організація змішаного навчання в університетській освіті США 	Боднар Тетяна Олександрівна 	011 Освітні, педагогічні науки 	17.08.2023 р. 	61
481 	Контроль та ідентифікація свіжості м'яса з використанням нейронної мережі 	Богуш Богдан Олегович 	152 «Метрологія та інформаційно-вимірювальна техніка» 		455
482 	Економічне оцінювання інтелектуально-інноваційних технологій 	Богдан Петро Іванович 	051 Економіка 	13.08.2025 р. 	267
483 	Електрофізичні властивості сенсорів Холла на основі квазівільного графену 	Біляк Роман Васильович 	153 Мікро- та наносистемна техніка 	11.06.2026 р. 	329
484 	Цифрове управління геоданими для просторового розвитку територій на прикладі Зимноводівської громади 	Білявський Максім Олегович 	193 Геодезія та землеустрій 	11.08.2025 р. 	247
485 	Забезпечення міцності і прогнозування довговічності елементів підіймальних систем бурових установок 	Біловус Андрій Романович 	131 Прикладна механіка 	13.08.2026 р. 	429
486 	Нові галузі в системі права України: ціннісно-світоглядний підхід 	Білик Павло Богданович 	081 Право 	22.08.2023 р. 	65
487 	Інформаційна технологія формування та оцінювання якості процесу тестування програмного забезпечення 	Білик Олексій Зіновійович 	126 Інформаційні системи та технології 	04.06.2026 р. 	333
488 	Організаційно-інформаційне забезпечення розвитку публічного управління в умовах цифрової трансформації 	Білик Володимир Михайлович 	281 Публічне управління та адміністрування 		496
489 	Методи та засоби обробки природньої мови для генерації програмного коду 	Бідочко Андрій Ростиславович 	122 Комп'ютерні науки 	09.07.2026 р. 	358
490 	Надстійкі катіонні бітумні емульсії для дорожнього будівництва 	Бідось Володимир Миколайович 	192 Будівництво та цивільна інженерія 	14.08.2025 р. 	237
491 	Система підтримки прийняття рішень розвитку територіальних громад 	Бігун Роман Романович 	124 Системний аналіз 	04.04.2023 р. 	39
492 	Особливості геодинаміки Передкарпатського прогину 	Бігун Микола Віталійович 	103 Науки про Землю 	28.05.2026 р. 	321
493 	Гідравлічні методи регулювання роздачі рідини з напірних розподільних трубопроводів 	Бігун Ірина Володимирівна 	192 Будівництво та цивільна інженерія 	14.09.2022 р. 	10
494 	Метод продовження строку служби закритих джерел іонізуючого випромінювання 	Берестов Руслан Володимирович 	152 Метрологія та інформаційно-вимірювальна техніка 	18.06.2024 р. 	122
495 	Методи аналізу та сегментації МРТ головного мозку на основі фрактальних фізико-інформаційних нейронних мереж 	Березюк Володимир Андрійович 	122 Комп’ютерні науки 	06.08.2026 р. 	471
496 	Нечіткі метрики у системах комп'ютерного зору 	Березький Микола Олегович 	122 Комп’ютерні науки 	11.08.2026 р. 	451
497 	Інформаційна технологія управління адаптивною системою розумного будинку 	Береговська Христина Василівна 	122 Комп'ютерні науки 	12.08.2025 р. 	262
498 	Розвиток міжнародної біржової діяльності на засадах урахування впливу сценаріїв використання програмного забезпечення 	Берднік Дмитро Анатолійович 	292 Міжнародні економічні відносини 	08.11.2023 р. 	73
499 	Вплив інформаційного простору мережі Інтернет на формування неправомірної поведінки неповнолітніх: криміналогічний аспект 	Безпалов Роман Володимирович 	081 Право 	22.05.2026 р. 	320
500 	Методи і засоби адаптивного керування параметрами розподілених програмних систем потокового опрацювання даних 	Баштовий Артем Валентинович 	121 Інженерія програмного забезпечення 	04.06.2026 р. 	317
501 	Інноваційно-організаційні підходи в адаптації державних службовців в цифровому середовищі 	Бачинський Остап-Степан Ярославович 	281 Публічне управління та адміністрування 		505
502 	Управління ризиками підприємств у системі цінностей циркулярної економіки 	Бахор Остап Романович 	076 Підприємництво, торгівля та біржова діяльність 	25.06.2026 р. 	371
503 	Інтелектуальна технологія кластеризації користувачів соціальних мереж на основі аналізу тональності повідомлень 	Батюк Тарас Миронович 	124 Системний аналіз 	12.06.2026 р. 	309
504 	Інформаційна технологія аналізу мультимодальних даних на основі ансамблю моделей машинного навчання 	Басистюк Олег Андрійович 	122 Комп'ютерні науки 	30.07.2025 р. 	216
505 	Формування податкової культури в системі публічного управління в умовах цифрової трансформації України 	Баряхтар Марина Петрівна 	281 Публічне управління та адміністрування 	14.05.2026 р. 	298
506 	Просторово-функціональний розвиток Дрогобицької агломерації 	Бардин Юрій Володимирович 	191 Архітектура та містобудування 	06.03.2024 р. 	105
507 	Розвиток державно-приватного партнерства у сфері автомобільного транспорту в Україні 	Барбір Ірина Миколаївна 	281 Публічне управління та адміністрування 	17.08.2023 р. 	54
508 	Удосконалення технології виявлення вторгнень і систем- приманок у мережах стандарту IEEE 802.11 	Банах Роман Ігорович 	125 Кібербезпека та захист інформації 	13.08.2024 р. 	134
509 	Підвищення ефективності захисту персональних даних користувачів в умовах цифрової інформатизації державних реєстрів України 	Балацька Валерія Сергіївна 	125 Кібербезпека 	22.08.2025 р. 	270
510 	Архітектура інтернатних закладів сімейного типу 	Бабич Ольга Миколаївна 	191 Архітектура та містобудування 	23.04.2025 р. 	170
511 	Застосування штучних нейронних мереж для визначення координат джерела акустичного сигналу 	Артемук Сергій Ігорович 	152 Метрологія та інформаційно-вимірювальна 	25.06.2024 р. 	120
512 	Метрологічні ризики забезпечення якості продукції на етапі виготовлення 	Артемук Ольга-Соломія Іванівна 	152 Метрологія та інформаційно-вимірювальна техніка 	03.06.2025 р. 	194
513 	Кристалізація низькотемпературного арсеніду галію для приладових структур терагерцового діапазону 	Аріков Владислав Вікторович 	153 Мікро- та наносистемна техніка 	08.01.2026 р. 	260
514 	Геоінформаційна технологія ієрархічної кластеризації та відображення геопросторових даних у вебкартографічних системах 	Арзубов Максим Валерійович 	122 Комп’ютерні науки 	30.07.2026 р. 	470
515 	Трансформація систем менеджменту підприємств в умовах розвитку ІТ-технологій 	Андрухів Ігор Тарасович 	073 Менеджмент 	06.08.2026 р. 	405
516 	Захист прав публічних службовців у сучасних умовах України 	Адамська Іоліта Петрівна 	281 Публічне управління та адміністрування 	13.12.2023 р. 	84
517 	Сигнальні перетворювачі органічних напівпровідникових оптопар для пристроїв сенсорної електроніки 	Адам'як Олег Андрійович 	171 Електроніка 	12.08.2025 р. 	207
518 	Роль ЄС у підтримці миру та безпеки в регіоні Східного партнерства 	Абрат Сергій Богданович 	291 Міжнародні відносини, суспільні комунікації та регіональні студії 		499
519 	Принцип доброчесності суддів в контексті євростратегічного курсу України 	Матвіїв Ростислав Ігорович 	081 Право 	22.05.2026 р. 	294
520 	Статистичний та метафоричний профілі ідіолекту Оксани Забужко 	Карасьов Віталій Володимирович 	035 Філологія 	28.05.2026 р. 	307
521 	Механізми реформування системи інституційного догляду дітей соціально вразливих категорій: регіональний аспект» 	Лис Володимир Володимирович 	281 Публічне управління та адміністрування 	21.01.2022 р. 	ДФ 35.052.101
522 	Державна політика щодо безпеки праці в контексті євроінтеграції України 	Лесняк-Іглінська Наталія Юріївна 	281 Публічне управління та адміністрування 	25.01.2022 р. 	ДФ 35.052.100
523 	Архітектура польських театрів України. Принципи типології та проектування 	Савчак Роман Несторович 	191 Архітектура та містобудування 	30.06.2022 р. 	ДФ 35.052.099
524 	Інформаційна технологія управління енергодинамічними режимами за наявності поновлювальних джерел енергії 	Мельник Роман Володимирович 	122 Комп’ютерні науки 	30.12.2021 р. 	ДФ 35.052.098
525 	Методи та засоби управління системою «розумного» будинку з використанням хмарних обчислень 	Казарян Артем Геннадійович 	122 Комп’ютерні науки 	30.12.2021 р. 	ДФ 35.052.097
526 	Інститут правосуддя в Україні: ціннісний вимір 	Ватаманюк Любов Василівна 	081 Право 	28.12.2021 р. 	ДФ 35.052.096
527 	Українська правова думка про юридичний процес (XIX ст. – 20-ті рр. XX ст.) 	Беліченко Олександра Валентинівна 	081 Право 	20.12.2021 р. 	ДФ 35.052.095
528 	Інтенсифікація процесу модифікації бітумів епоксидними сполуками 	Маціпура Павло Анатолійович 	161 хімічні технології та інженерія 	27.12.2021 р. 	ДФ 35.052.094
529 	Аналіз та оцінка якості часових серій координат референцних GNSS-станцій України 	Сосонка Ірина Іванівна 	103 Науки про Землю 	28.12.2021 р. 	ДФ 35.052.093
530 	Засади технології сорбентів на основі природного клиноптилоліту, модифікованого сріблом 	Машталер Анастасія Сергіївна 	161 хімічні технології та інженерія 	28.12.2021 р. 	ДФ 35.052.092
531 	Удосконалення та дослідження державного первинного еталона одиниці звукового тиску в повітряному середовищі 	Костеров Олександр Олексійович 	152 Метрологія та інформаційно-вимірювальна техніка 	23.12.2021 р. 	ДФ 35.052.091
532 	Система розпізнавання мультиспектральних образів на основі осциляторних нейронних мереж 	Пелещак Іван Романович 	124 Системний аналіз 	23.12.2021 р. 	ДФ 35.052.090
533 	Системні методи та засоби аналізу параметрів сталого зростання соціополісів 	Табачишин Данило Романович 	124 Системний аналіз 	21.12.2021 р. 	ДФ 35.052.089
534 	Методи та засоби оцінювання стану людини в медичних кіберфізичних системах 	Гаваньо Богдан Іванович 	123 Комп’ютерна інженерія 	29.12.2021 р. 	ДФ 35.052.088
535 	Моделювання поширення плазмон-поляритонних хвиль в шаруватих структурах 	Польовий Віталій Євгенович 	113 Прикладна математика 	30.12.2021 р. 	ДФ 35.052.087
536 	«Модифікація кристалів LiNbO3 шляхом термохімічних обробок у присутності іонів металів для пристроїв мікро- та наносистемної техніки» 	Яхневич Уляна Володимирівна 	153 Мікро- та наносистемна техніка 	09.12.2021 р. 	ДФ 35.052.086
537 	Електронні, оптичні та магнітні властивості металорганічних комплексів як перспективних матеріалів наноелектроніки та наноспінтроніки 	Клиско Юрій Володимирович 	153 Мікро- та наносистемна техніка 	16.12.2021 р. 	ДФ 35.052.085
538 	Сучасні соціально-правові механізми протидії злочинності в Україні 	Строїч Василь Васильович 	081 Право 	20.12.2021 р. 	ДФ 35.052.084
539 	Адміністрування стресових ситуацій в органах публічної влади 	Дорош Ірина Миронівна 	281 Публічне управління та адміністрування 	30.11.2021 р. 	ДФ 35.052.083
540 	Розроблення інформаційно-телекомунікаційної платформи електронного урядування для забезпечення інтерактивної взаємодії із соціумом 	Нажм Ахмад Байдун 	172 Телекомунікації та радіотехніка 	25.11.2021 р. 	ДФ 35.052.082
541 	Архітектурно-планувальна організація та розвиток нових територіальних громад рекреаційної спеціалізації (на прикладі Тернопільської області) 	Огоньок Юрій Володимирович 	191 Архітектура та містобудування 	02.12.2021 р. 	ДФ 35.052.081
542 	Обґрунтування параметрів дискретно-континуальних міжрезонансних вібраційних машин з керованим кривошипно-шатунним приводом 	Качур Олександр Юрійович 	131 Прикладна механіка 	22.09.2021 р. 	ДФ 35.052.080
543 	Розробка складів та технологій спреїв для лікування захворювань дихальних шляхів на основі екстрактів моху ісландського та евкаліпту 	Фітьо Ірина Валеріївна 	226 Фармація, промислова фармація 	26.08.2021 р. 	ДФ 35.052.079
544 	«Дизайн візуальних комунікацій об’єктів культурної і природної спадщини Йорданії» 	Самер Хамді Ареф Аль Равашдех 	022 Дизайн 	05.08.2021 р. 	ДФ 35.052.078
545 	«Міжнародні неурядові організації у забезпеченні миру та безпеки: інституціональний та функціональний виміри» 	Кручініна Оксана Юріївна 	291 Міжнародні відносини, суспільні комунікації та регіональні студії 	09.08.2021 р. 	ДФ 35.052.077
546 	Технологічні основи реставрації алебастрових виробів в архітектурі та мистецтві 	Лотоцька Олена Володимирівна 	023 Образотворче мистецтво, декоративне мистецтво, реставрація 	27.09.2021 р. 	ДФ 35.052.076
547 	Мистецький вистрій репрезентативних приміщень громадських будівель м. Львова другої половини ХІХ ст. 	Гетьманчук Сергій Володимирович 	023 Образотворче мистецтво, декоративне мистецтво, реставрація 	27.09.2021 р. 	ДФ 35.052.075
548 	«Ущільнення забудови території історично сформованих міст (на прикладі Львова)» 	Коник Соломія Ігорівна 	191 Архітектура та містобудування 	29.06.2021 р. 	ДФ 35.052.074
549 	«Архітектурно - театральна творчість Ф.Кізлера» 	Янчук Катерина Володимирівна 	191 Архітектура та містобудування 	29.06.2021 р. 	ДФ 35.052.073
550 	«Трансестерифікація тригліцеридів у присутності гетерогенних каталізаторів» 	Старчевський Роман Олегович 	161 хімічні технології та інженерія 	06.07.2021 р. 	ДФ 35.052.072
551 	«Вдосконалення кавітаційних технологій очищення промислових стічних вод» 	Вашкурак Уляна Юріївна 	161 хімічні технології та інженерія 	30.06.2021 р. 	ДФ 35.052.071
552 	«Міцність та деформативність згинаних залізобетонних елементів з пошкодженням бетону за дії навантаження» 	Лободанов Максим Миколайович 	192 Будівництво та цивільна інженерія 	25.06.2021 р. 	ДФ 35.052.070
553 	Використання рослин родини Ranunculaceae для отримання біологічно активних речовин в системі in vitro 	Хропот Оксана Сергіївна 	226 Фармація, промислова фармація 	16.07.2021 р. 	ДФ 35.052.069
554 	Кримінологічне забезпечення індивідуальної профілактики корисливих злочинів неповнолітніх 	Гуцул Роксолана Романівна 	081 Право 	30.09.2021 р. 	Дф 35.052.068
555 	«Динаміка навантажень та покращення пружно-демпфуючих характеристик тягово-зчіпних пристроїв триланкового автопоїзда» 	Бадейнов Олександр Михайлович 	133 Галузеве машинобудування 	31.05.2021 р. 	ДФ 35.052.067
556 	«Високоміцні бетони з підвищеною ударною в’язкістю для промислових підлог» 	Сидор Назар Іванович 	192 Будівництво та цивільна інженерія 	30.06.2021 р. 	ДФ 35.052.066
557 	Еволюція партійних систем України та Республіки Польща (1989-2019 роки) 	Балашова Оксана Володимирівна 	052 Політологія 	31.05.2021 р. 	ДФ 35.052.065
558 	«Методика розслідування погрози або насильства щодо захисника чи представника особи» 	Олійник Ярослав Святославович 	081 Право 	24.06.2021 р. 	ДФ 35.052.064
559 	«Гідравлічне моделювання мереж дощового водовідведення за наявності регулювання стоку» 	Мисак Ігор Васильович 	192 Архітектура та будівництво 	26.05.2021 р. 	ДФ 35.052.063
560 	«Термодинамічні властивості естерів 6-метил-2-оксо-4-арил-1,2,3,4- тетрагідропіримідин-5-карбонової кислоти та їх розчинів в органічних розчинниках» 	Клачко Олена Ростиславівна 	102 Хімія 	17.05.2021 р. 	ДФ 35.052.062
561 	Принципи розвитку архітектурної типології медичних закладів в університетах України 	Красильников Олег Володимирович 	191 Архітектура та містобудування 	18.05.2021 р. 	ДФ 35.052.061
562 	Архітектурна типологія театрально-видовищних центрів для дітей та молоді 	Філіпчук Юрій Володимирович 	191 Архітектура та містобудування 	18.05.2021 р. 	ДФ 35.052.060
563 	«Несуча здатність та деформативність скляних багатошарових колон» 	Ткач Роман Олександрович 	192 Будівництво та цивільна інженерія 	20.05.2021 р. 	ДФ 35.052.059
564 	«Фотокаталітичні композиційні в`яжучі та наномодифіковані оздоблювальні розчини на їх основі» 	Гоголь Марко Миронович 	192 Будівництво та цивільна інженерія 	19.05.2021 р. 	ДФ 35.052.058
565 	«Нітрифікація як екологічний чинник взаємовпливу водних об’єктів та пов’язаних з ними споруд водокористування» 	Радіонов Микитa Павлович 	101 Екологія 	07.05.2021 р. 	ДФ 35.052.057
566 	«Екологія іммобілізованого азоттрансформуючого мікробіоценозу в системах очистки стічних вод» 	Цитлішвілі Катерина Олександрівна 	101 Екологія 	07.05.2021 р. 	ДФ 35.052.056
567 	«Вдосконалення методів мінімізації затримки транспортних потоків у містах зі щільною забудовою» 	Бура Романа Романівна 	275 Транспортні технології (за видами) 	19.05.2021 р. 	ДФ 35.052.055
568 	«Моделі та засоби оцінювання рівня захищеності систем захисту інформації на основі когнітивного моделювання» 	Салієва Ольга Володимирівна 	125 Кібербезпека 	04.06.2021 р. 	ДФ 35.052.054
569 	«Вдосконалення методів і засобів біометричної автентифікації на основі електрокардіограми» 	Сабодашко Дмитро Володимирович 	125 Кібербезпека 	04.06.2021 р. 	ДФ 35.052.053
570 	«Нарцисична саморегуляція як чинник особистісного самоздійснення» 	Клименко Марія Романівна 	053 Психологія 	17.05.2021 р. 	ДФ 35.052.052
571 	«Процесуально-правові засади виконання судових рішень в адміністративних справах» 	Смотрич Дмитро Володимирович 	081 Право 	18.05.2021 р. 	ДФ 35.052.051
572 	Моделі управління потоками інфокомунікаційних мереж з використанням методів штучного інтелекту і машинного навчання 	Андрущак Володимир Степанович 	172 Телекомунікації та радіотехніка 	07.06.2021 р. 	ДФ 35.052.050
573 	Моделі та метод оптимального розподілу мережних ресурсів в програмно- конфігурованих гетерогенних мережах мобільного зв'язку 	Бешлей Галина Влодимирівна 	172 Телекомунікації та радіотехніка 	12.05.2021 р. 	ДФ 35.052.049
574 	Формування моделей кредитно-інвестиційної політики в національній економіці 	Гончар Світлана Йосипівна 	051 Економіка 	15.04.2021 р. 	ДФ 35.052.048
575 	Грошові потоки електронного бізнесу 	Костюк-Пукаляк Оксана Михайлівна 	072 Фінанси, банківська справа, страхування 	15.04.2021 р. 	ДФ 35.052.047
576 	«Удосконалення моніторингу атмосферного повітря агломерацій (на прикладі м. Полтава)» 	Максюта Наталія Сергіївна 	183 Технології захисту навколишнього середовища 	26.04.2021 р. 	ДФ 35.052.046
577 	«Ремонтні суміші з підвищеними експлуатаційними властивостями на основі лужного портландцементу» 	Камінський Андрій Тарасович 	192 Будівництво та цивільна інженерія 	19.05.2021 р. 	ДФ 35.052.045
578 	«Педагогічні умови розвитку здоров’язбережувальної компетентності вчителів основної школи у системі післядипломної педагогічної освіти» 	Шеян Марина Олександрівна 	015 Професійна освіта (за спеціалізаціями) 	15.04.2021 р. 	ДФ 35.052.044
579 	«Розвиток корпоративної освіти в Канаді» 	Носуліч Галина Андріївна 	011 Освітні, педагогічні науки 	14.04.2021 р. 	ДФ 35.052.043
580 	«Праксеологічні засади підготовки майбутніх медичних сестер до професійної діяльності» 	Лісна-Міськів Наталія Євстахівна 	015 Професійна освіта (за спеціалізаціями) 	15.04.2021 р. 	ДФ 35.052.042
581 	Публічне управління розвитком фінансових технологій в умовах реформування фінансової системи України 	Лукашевська Уляна Тарасівна 	281 Публічне управління та адміністрування 	16.04.2021 р. 	ДФ 35.052.041
582 	Адаптивне управління ресурсами та якістю обслуговування у програмно- конфігурованих сервісно-орієнтованих телекомунікаційних мережах 	Панченко Олексій Михайлович 	172 Телекомунікації та радіотехніка 	22.04.2021 р. 	ДФ 35.052.040
583 	Екологічна безпека гірничо-хімічного підприємства на стадії ліквідації 	Джумеля Ельвіра Анатоліївна 	183 Технології захисту навколишнього середовища 	17.02.2021 р. 	ДФ 35.052.039
584 	Комбіновані біологічно–адсорбційні методи очищення поверхневих та стічних вод 	Соловій Христина Михайлівна 	101 Екологія 	25.02.2021 р. 	ДФ 35.052.038
585 	Адміністративно-правове забезпечення прав дітей в інформаційному середовищі 	Нестеренко Анна Олександрівна 	081 Право 	20.04.2021 р. 	ДФ 35.052.037
586 	Правові засади взаємодії державної влади та опозиції в період демократичної трансформації: перспективи законотворення 	Пивовар Майя Сергіївна 	081 Право 	26.03.2021 р. 	ДФ 35.052.036
587 	Архітектурно-просторова організація автомобільних пунктів пропуску на західних кордонах України 	Кашуба Оксана Мирославівна 	191 Архітектура та містобудування 	04.02.2021 р. 	ДФ 35.052.035
588 	Математичне моделювання епідеміологічних та клініко-лабораторних проявів туберкульозу 	Ільницький Григорій Іванович 	113 Прикладна математика 	23.03.2021 р. 	ДФ 35.052.034
589 	Механізм державного регулювання інноваційного розвитку економіки України в глобалізаційних умовах 	Котельбан Сергій Васильович 	051 Економіка 	29.12.2020 р. 	ДФ 35.052.033
590 	Економічне оцінювання та управління бізнес-проектами підприємств 	Будинський Ростислав Зеновійович 	073 Менеджмент 	29.12.2020 р. 	ДФ 35.052.032
591 	Розвиток управління митним обслуговуванням підприємств 	Будз Олег Федорович 	292 Міжнародні економічні відносини 	29.12.2020 р. 	ДФ 35.052.031
592 	Методи та засоби управління персональними знаннями в інтелектуальних системах 	Ленько Василь Степанович 	124 Системний аналіз 	09.02.2021 р. 	ДФ 35.052.030
593 	Державне регулювання інвестиційної діяльності в сільському господарстві 	Дзюрах Юрій Михайлович 	281 Публічне управління та адміністрування 	28.01.2021 р. 	ДФ 35.052.029
594 	Покращання експлуатаційних властивостей трансмісії автомобіля застосуванням двомасового маховика 	Літвін Роман Григорович 	274 Автомобільний транспорт 	29.12.2020 р. 	ДФ 35.052.028
595 	Фотодинамічні властивості наноструктур в умовах плазмонного резонансу для біомедичних застосувань 	Булавінець Тетяна Олександрівна 	153 Мікро- та наносистемна техніка 	29.12.2020 р. 	ДФ 35.052.027
596 	Бітуми, модифіковані смолами, одержаними з фенольної фракції кам’яновугільної смоли. 	Демчук Юрій Ярославович 	161 Хімічні технології та інженерія 	15.01.2021 р. 	ДФ 35.052.026
597 	Співвідповідач у адміністративному процесі (процесуальна співучасть) 	Сало Андрій Богданович 	081 Право 	19.03.2021 р. 	ДФ 35.052.025
598 	Томографія тропосфери на основі опрацювання даних мульти-GNSS спостережень 	Хоптар Аліна Андріївна 	193 Геодезія та землеустрій 	17.12.2020 р. 	ДФ 35.052.024
599 	Екологічно безпечні технології біологічної рекультивації із використанням осадів стічних вод 	Шквірко Оксана Михайлівна 	101 Екологія 	24.12.2020 р. 	ДФ 35.052.023
600 	Автоматизація проектування систем вимірювання кількості теплової енергії на основі витратомірів змінного перепаду тиску 	Биць Оксана Михайлівна 	151 Автоматизація та комп’ютерно-інтегровані технології 	23.12.2020 р. 	ДФ 35.052.022
601 	Управління підприємницькими структурами на засадах забезпечення їх конкурентоспроможності. 	Русин-Гриник Роман Романович 	076 Підприємництво, торгівля та біржова діяльність 	28.12.2020 р. 	ДФ 35.052.021
602 	Формування та розвиток транскордонних кластерів 	Мищишин Ольга Львівна 	051 Економіка 	21.12.2020 р. 	ДФ 35.052.020
603 	Особливості становлення та функціонування системи стримувань і противаг між гілками влади в умовах демократизації політичної системи України 	Забавська Христина Юріївна 	052 Політологія 	10.12.2020 р. 	ДФ 35.052.019
604 	Становлення та розвиток Держави-міста Ватикан: історико-правове дослідження 	Гутів Богдан Ігорович 	081 Право 	28.08.2020 р. 	ДФ 35.052.018
605 	Катування: кримінологічний аспект 	Мигаль Роман Васильович 	081 Право 	15.10.2020 р. 	ДФ 35.052.017
606 	Інтегративний підхід до розвитку професійної іншомовної компетентності вчителя фізики 	Кушпіт Уляна Володимирівна 	015 Професійна освіта (за спеціалізаціями») 	15.09.2020 р. 	ДФ 35.052.015
607 	Формування професійної компетентності майбутніх фахівців автотранспортного профілю засобами інформаційних технологій 	Пукало Марія Ігорівна 	015 Професійна освіта (за спеціалізаціями») 	14.09.2020 р. 	ДФ 35.052.016
608 	Розвиток ціннісного ставлення до власного здоров’я у майбутніх фахівців з цивільної безпеки 	Корж Галина Іванівна 	015 Професійна освіта (за спеціалізаціями») 	15.09.2020 р. 	ДФ 35.052.014
609 	Низькоемісійні змішані цементи та модифіковані бетони і будівельні розчини на їх основі 	Іващишин Ганна Степанівна 	192 Будівництво та цивільна інженерія 	04.09.2020 р. 	ДФ 35.052.013
610 	Іранська ядерна програма в контексті світової та регіональної безпеки 	Завада Ярина Ігорівна 	052 Політологія 	03.09.2020 р. 	ДФ 35.052.012
611 	Інтеграція інформаційно-комунікаційних і традиційних технологій у підвищенні кваліфікації вчителя предмету«Захист Вітчизни» 	Хабюка Андрія Ярославовича 	015 Професійна освіта (за спеціалізаціями) 	14.09.2020 р. 	ДФ 35.052.011
612 	Розвиток християнської моралі дошкільників засобами пастирської діяльності в Україні наприкінці ХХ – початку ХХІ століття 	Сливка Богдан Степанович 	011 Освітні, педагогічні науки 	02.10.2020 р. 	ДФ 35.052.010
613 	Розвиток професійної освіти фахівців з медичної інформатики у Канаді (друга половина ХХ – початок ХХІ століття) 	Кобрин Надія Зіновіївна 	011Освітні, педагогічні науки 	21.07.2020 р. 	ДФ 35.052.009
614 	Розвиток освіти корінних народів Канади 	Запотічна Марія Іванівна 	011Освітні, педагогічні науки 	21.07.2020 р. 	ДФ 35.052.008
615 	Інтегративний підхід до професійної підготовки майбутніх фахівців інформаційної, бібліотечної та архівної справи 	Гузій Іванна Степанівна 	015 Професійна освіта (за спеціалізаціями») 	21.07.2020 р. 	ДФ 35.052.007
616 	Правові засади взаємодії громадянського суспільства та органів публічної влади в умовах становлення демократичної правової держави в Україні 	Ковальчук Софія Віталіївна 	081 Право 	11.07.2020 р. 	ДФ 35.052.006
617 	Кримінологічна модель особистості студента закладу вищої освіти, який вчиняє корисливо-насильницький злочин проти власності 	Болібрух Наталія Борисівна 	081 Право 	11.09.2020 р. 	ДФ 35.052.005
618 	Підвищення рівня екологічної безпеки атмосфери поглинанням вуглекислого газу хлорофілвмісними мікроводоростями 	Катишева Вікторія В’ячеславівна 	101 Екологія 	22.07.2020 р. 	ДФ 35.052.004
619 	Особливості виявлення та розслідування контрабанди наркотичних засобів, що вчиняються організованими злочинними групами 	Рудницький Іван Львович 	081 Право 	28.02.2020 р. 	ДФ 35.052.003
620 	Гарантії прав осіб дошкільного віку у глобалізаційному суспільстві 	Матяшовська Роксолана Юріївна 	081 Право 	17.02.2020 р. 	ДФ 35.052.002
621 	Методологія ефективного використання земельних ресурсів для розвитку сонячної енергетики на основі дистанційного зондування Землі та ГІС-технологій 	Кереуш Дар'я Іванівна 	193 Геодезія та землеустрій 	23.01.2020 р. 	ДФ 35.052.001'''

from datetime import datetime
thesis = [line.split('\t')[:-1] for line in text.splitlines() if line.strip()]
it_thesis = [item for item in thesis if item[3].startswith('12') and item[4]]
it_thesis.sort(key=lambda x: datetime.now() - datetime.strptime(x[4][:10], '%d.%m.%Y'))
for item in it_thesis:
    print(f"{item[0].strip()}, {item[1]}, {item[3][:3]}, {item[4]}")


