raw_text = """
#### Основні методи класифікації даних

* **Наївний Байєсівський:** ймовірнісний класифікатор, заснований на теоремі Байєса. Він передбачає сувору незалежність між ознаками. 

* **K-найближчих сусідів (KNN):** Непараметричний алгоритм, заснований на екземплярах. Він класифікує нову точку даних на основі класу більшості її $k$ найближчих сусідів у просторі ознак. 

* **Дерева рішень:** модель на основі правил, яка рекурсивно розділяє дані на підмножини на основі значень ознак, створюючи деревоподібну структуру рішень від кореня до кінцевих вузлів (класів). 

* **Метод опорних векторів (SVM):** геометричний класифікатор, який знаходить оптимальну гіперплощину, що розділяє різні класи у високорозмірному просторі. Він максимізує відстань між найближчими точками різних класів (векторами підтримки). 

* **Методи ансамблю:** Техніки, що поєднують декілька базових класифікаторів для створення більш потужної моделі прогнозування. Прикладами є випадкові ліси (bagging decision trees) та градієнтне підсилення (Gradient Boosting). 


#### Наївний баєсовий класифікатор

- Спирається на теорему Байєса про умовну ймовірність:
	P(A|B) = P(B|A) * P(A) / P(B)
- припускає, що всі ознаки незалежні між собою, і називається 'наївним', оскільки це  неможливо в практичних застосуваннях 

Нехай маємо вектор ознак X і значення приналежності до класу y

З припущення всі ознаки незалежні між собою, тому ймовірність виконання всіх ознак вектора визначимо як добуток ймовірності виконання кожної ознаки зокрема

P(X|y) = prod(i=1,n; P(x_i|y))

Відповідно за теоремою Байєеса:

P(y|X) = P(X|y) * P(y) / P(X)
P(y|X) = prod(i=1,n; P(x_i|y)) * P(y) / P(X)

Ймовірність виконання кожної окремої ознаки для кожного класу можемо визначити з матриці наявних даних 

Ймовірність P(y) так само можемо взяти з матриці

Ймовірність безумовного виконання вектору ознак P(X) - це константа, тому не грає ролі для передбачення класу. Припустімо, що  вона рівна 1

Тоді 

P(y|X) & prod(i=1,n; P(x_i|y)) * P(y)

y = argmax (prod(i=1,n; P(x_i|y)) * P(y))

Знайшовши ймовірності приналежності до кожного класу y1..yk, можемо нормалізувати значення, щоб отримати точне значення ймовірності:
	P(yi|X)  = yi/sum(y1...yk)


Переваги:
- простий у використанні, бо має невелику кількість параметрів
- Працює швидше за інші алгоритми класифікації за великої кількості ознак
- Працює непогано в обмежених наборах даних

Недоліки:
- неточність через ідеалізацію умов застосування
- Неважливі ознаки впливають на резльтат
- Не розраховний для ознак, які не зустрічалися в наборі даних

Ключові припущення:
- незалежність ознак
- рівнозначна впливовість ознак
- відсутність пропущених даних
- неперервні ознаки розподілені за нормальним законом (Гаусівський НБ)
- дискретні ознаки розподілені за мультиноміальним законом (мультиноміальний НБ)
- бінарні ознаки розподілені за законом Бернуллі (НБ Бернуллі)

Застосування:
- фільтр спаму
- Класифікація тексту
- прогнозування погоди

#### Крос-валідація, її використання в задачах класифікації

Крос-валідація - це метод перевірки ефективності і точності моделі машинного навчання в задачах класифікації на нових наборах даних з уникненням перенавчання

Види корс-валідації

1. (Holdout CV) З відкладеною вибіркою
	Набір даних ділиться на тренувальний і тестувальний (зазвичай у відношеннях від 70 на 30 до 80 на 20). Модель навчається на тренувальному наборі і перевіряється на тестувальному
2. LOOCV (leave one out cross-validation)
	Одне значення з набору даних використовується для перевірки, а решта набору - для тренування. Перевірка здійснюється для кожного значення набору даних.
3. K-fold CV (крос-валідація з k блоками)
	Набір даних ділиться на k різних блоків вибадковим чином. Один з них формує тестувальний набір, решта - тренувальний. Перевірка відбувається k разів, щоразу з іншим блоком для тестування. Результати кожної перевірки підсумовуються, щоб знайти середні показники
4. Стрвтифікована крос-валідація з k блоками
	Набір даних ділиться на k різних блоків випадковим чином зоднаковим відношення кількості класів у кожному блоці. Далі працює як звичайна K-fold CV
5. Повторювана крос-валідація з k блоками
	звичайна K-fold CV виконується багаторазово, щоразу з випадковим розподілом на kблоків. Результати кожного проходження K-fold CV підсумовуються, щоб знайти середні показники

#### Алгоритм k-ближчих сусідів (KNN)

Алгоритм KNN використовується в задачах класифікації та регресії. Його завдання - передбачити приналежність точки до класу на основі її сусідів з промаркованими класами

Алгоритм застосування KNN:
1. Обрати значення K
	k - це кількість найближчих сусідів, які визначають приналежність нової точки до певного класу. Якщо K замале - то модель може бути надто чутливою до шумів і відхилень в даних. І навпаки, якщо k завелике - модель може ігнорувати важливі патерни
	Один зі способів обрання k - це застосування крос-валідації з оцінкою точності для різних значень
2. Порахувати відстань до кожної точки в наборі даних. Зазвичай використовується евклідова відстань
	d = (sum((xi-Xi)^2))^0.5
	також може використовуватися мангетенська відстань для простішого обчислення, або щось середнє з сімейства відстаней Мінковського
3. Клас, до якого приналежть більшість з сусідів нової точки, призначається їй. Значення K має бути непарним простим числом, щоб уникнути паритету в процесі визначення класу

Переваги:
- простий в застосування
- Не потребує тренування на попередніх даних
Недоліки:
- повільний на великих обсягіх даних
- неточний для великої кількості ознак
- Складність вибору K

#### Принцип роботи дерева рішень

Дерева рішень - це набір методів МН для розв'язання задач класифікації та регресії

- Це непараметричні моделі, які підтримують як числові, так і якісні дані без припущення про розподіл даних
- Вони використовують метрики поділу (Отримана інформація, індекс GINI, зеншення дисперсії для визначення найкращих ознак для поділу даних)
- Вони є основою для більш складних ансамблевих молелей (random forests, gradient boosting)

Як і в теорії графів, дерева рішень складаються з кореня, вузлів, гілок і листя. Корінь - вхідний вузол з усіма наявними даними. Вузли - це умови, які перевіряються для поділу даних. Кінцеві вузли або листя - це фінальні класи, на які діляться всі вхідні дані

Ключова задача при створенні дерева рішень - це сформувати умови поділу або обрати ознаки таким чином, щоб оптимізувати метрики поділу

Види алгоритмів створення дерев рішень:
1. ID3
Iterative Ditochomiser 3
	1. ініціюємо корінь (повний датасет)
	2. Оцінюємо ентропію E = -sum(p_i * log_2(p_i)
	3. Розраховуємо Information Gain для розподілу датасету по кожній з можливих ознак і обираємо ту, яка дає найкращий результат
	4. Ділимо датасет на відповідну кількість вузлів
	5. Повторюємо кроки 2-4 для кожного вузла, поки не отримаємо чисті дані, або не вичерпаємо всі ознаки для поділу
Обмеження:
- легко перенавчається
- не підтримує неперервних ознак в оригінальному вигляді
- Зміщується в бік ознак з великою кількістю унікальних значень

1. C4.5
Покращена версія ID3 
Замість вибору ознак за максимальним IG, оцінюється також SI (split information), яка показує, як набір даних розподіляється між гілками. Ознаки вибираються за максимізації відношення IG до SI

Entropy:
H(S) = -sum(p_i*log2(p_i))

Information Gain - міра зменшення невизначеності після поділу
IG = H(S) - sum((|S_v|/|S)*H|S_v|)

Індекс Gini - ймовірність, що випадково вибраний елемент після поділу буде неправильно класифікований, якщо використовувати закон розподілу вузла

G(S) = 1 - sum(p_i^2)

#### Метод класифікації на основі ансамблів, його переваги та недоліки

Методи машинного навчання на основі ансамблів поєднують в собі декілька моделей, які роблять передбачення незалежно або скоординовано для досягнення більш точних результатів  

1. Незалежний метод ансамблів (Bagging): моделі навчаються на різних елементах датасету паралельно, незалежно одна від одної. В результаті вони схильні фокусуватися на різних патернах і робити різні помилки. Класифікація відбувається голосуванням моделей, і в результаті передбачений клас - той, який обрало більшість моделей
2. Скоординований (Boosting): Моделі навчаються послідовно: перша модель навчається на оригінальному датасеті, робить свої передбачення на тестувальних даних, і датасет модифікується таким чином, щоб дані чи атрибути, на яких перша модель помилилася, мали більшу вагу. Друга модель навчається на модифікованому датасеті і так далі. Фінальне передбачення формується після послідовного застосування всіх моделей

Переваги методу ансамблів:
- збільшення точності за рахунок поєднання моделей
- Зменшується чутливість до некоректних або нетипових даних

Недоліки:
- Ресурсозатратність
- Складінсть розуміння внутрішніх механізмів

#### Метод опорних векторів (SVM)

Support Vector Machine - це алгоритм МН під наглядом, результатом якого є чітке розмежування класів рівнянням n-вимірної площини (гіперплощини). Він корисний в бінарних застосуваннях (відрізнити спам, пса від кота)

Основні поняття:
- гіперплощина - межа приналежності до класів у просторі ознак. (y = kx+b для 2-мірного простору)
- опорні вектори - найближчі точки даних до гіперплощини
- hard margin SVM - метод пошуку гіперплощини, яка ідеально сепарує класи без жодних винятків
- soft margin SVM - дозволяє можливість неправильної класифікації, але вводить втрати за неправильно класифіковані дані. Краще застосовується в даних, які складно чітко класифікувати за наявними ознаками, і з екстремальними точками

Завдання алгоритму SVM - це мінімізація наступної функції: 
F = 1/margin  = lambda*sum(penalties)

Для розрахунку penalty використовується шарнірна функція втрат (hinge loss), яка працює наступним чином:

Якщо точка знаходиться за межею, втрата = 0
Якщо точка всередині меж площини і правильно класифікована, втрата  > 0
Якщо точка неправильно класифікована, втрата зростає пропорційно до відстані до площини

Якщо дані неможливо класифікувати, вводиться новий вимір через функцію ядра 

Функція гіперплощини
W^T x + b = 0
W - вектор ваг (вектор нормалі до площини)
b - зміщення площини від початку координат

Задача SVM - максимізувати margin, тому практично вона виглядає як minimize(0.5 ||w||^2)




#### Метрики для оцінки ефективності класифікаційних моделей

1. Точність (accuracy) - відношення кількості правильно передбачених класів до всіх передбачень загалом
2. Матриця помилок (confusion matrix) - дає повну картину всіх передбачень класифікаційної моделі (в ідеальному випадку всі значення матриці мали б бути 0, окрім головної діагоналі) - дає можливість побачити, з якими саме класами модель гірше працює
3. Точність (precision) TP/TP+FP
4. відтворюваність (recall) = TP/TP+NP
5. рахунок F1 - Поєднання точності і відтворюваності 2 * presicion * recall / (presision + recall)

#### Перехресне навчання і його застосування в задачі класифікації

Те саме, що Cross Validation



#### Запобігання перенавчання в класифікації

Крос валідація
Ансамблеві моделі
Вибір вагомих ознак
Регуляризація (L1,L2 чи їх поєднання)

#### Кластерний аналіз

Кластерний аналіз чи кластеризація (clustering) групує точки даних, які схожі між собою в кластери

Метрики відстані:
- Евклідова
- Мангетенська
- сімейство Мінковського
- Косинусна подібність (рахується кут між точками даних, а не відстань між ними)

Методи кластеризації:
- Методи поділу
	- K-means - визначає кожну точку як приналежну до найближчого центра, і постійно перераховує центр як середнє значення координат його точок
- Ієрархічні методи
	- Ієрархічна кластеризація будує дерево кластерів яке представляє або поступовий поділ одного великого кластера, або злиття декількох малих в залежності від обраного методу
- Методи густини групують точки даних в регіонах з великою кількістю точок, і області з малою кількістю точок визначають як шум
- Методи сітки ділять весь простір на клітини сітки і працюють схожим чином до k-means, але є більш ефективними на великих наборах даних

Застосування

- сегментація ринку
- виявлення аномалій

Обмеження
- вибір кількості кластерів
- Складність застосування для великих наборів даних
- форми кластерів

#### Асоціативні правила

AR - це концепт пошуку зв'язків, патернів, кореляцій у великому наборі даних

Асоціативне правило виглядає наступним чином:
X -> Y (ознака X приводить до появи ознаки Y)

Ключові поняття:
Антецедент - незалежна ознака (X)
Консеквент - Залежна ознака від антецедента (Y)

Для виокремлення правил і визначення їх валідності застосовують наступні поняття:
- Support(X -> Y) - яка частку з усього датасет представляють антецедент і консеквент
	N(X and Y)/N
- Confidence(X -> Y) - яка частка даних, що містять антецедент, також містять консеквент
	Support(X and Y)/Support(X)
- Lift(x -> Y) - відношення спостережуваної підтримки до очікуваної, якщо антецедент і консеквент незалежні
	Confideence(X -> Y)/Support(Y)
Якщо lift == 1, то залежності нема, якщо більший, то залежність позитивна, якщо менший - то негативна

Якщо малий Support, то правило не може бути сильним, оскільки даних надто мало
Чим більше значення | Lift -1 |, тим сильніше правило

Приклад про покупки

#### Нечіткі дерева рішень

FDT інтегрують нечітку логіку в класичні дерева рішень

FDT вводить поняття рівня приналежності до вузла mu

Якщо S - це нечітки й вузол, то к-ть елементів у ньому визначається як 
sum(mu(x_k))

рівень приналежності до кожного класу визначають як
sum(mu(x_k))

Решта логіки в розрахунку ентропії, IG та/або Gini index залишаються незмінними: 

Entropy:
H(S) = -sum(p_i*log2(p_i))

IG:
IG = H(S) - sum((|S_v|/|S)*H|S_v|)

FDT є компромісом між зрозумілістю алгоритму (як КДР) і точністю передбачень (як random forests і gradient boosting)

Для окремих наборів даних FDT дає схожі або кращі передбачення, ніж навіть великі ліси або GB 
#### Ансамблі дерев рішень.

АДР поєднують набір дерев рішень в одну модель для підвищення точності передбачень. Існує 2 основні способи застосування АДР:
- random forests (паралельне виконання) - Набір тренувальних даних випадковим чином розподіляється між деревами рішень для навчання, після навчання кожне дерево робить своє передбачення на спільному тестувальному датасеті, і фінальне передбачення лісу - це голосування (для класифікації) або усереднення (для регресії)

	Передумови застосування Random forests:
	- кожне дерево робить незалежні передбачення
	- Тренувальні дані розподіляються випадковим чином
	- є достатньо великий набір даних, щоб в ньому можна було виокремити різні ознаки різними деревами
	- Різні передбачення підвищують точність

- gradient boosting (послідовне виконання) - кожне дерево тренується для мінімізації функції втрат попереднього дерева шляхом градієнтнгого спуску: В першій ітерації перше дерево тренується на оригінальному правильно промаркованому датасеті, в другій ітерації друге дерево тренується на матриці ознак і помилках першого дерева. Таке послідовне навчання здійснюється кожним деревом для передбачення помилок попереднього

	

АДР є вирішенням проблеми перенавчання глибоких дерев: часто збільшення глибини дерева веде до стагнації або до деградації його передбачень. Замість конструювання одного глибокого дерева АДР застовує багато малих дерев рішень, які працюють скоординовано для покращення результатів. збільшення кількості дерев у ансамблі практично ніколи не веде до погіршення резльтатів, але, звичайно, передбачає вищу ресурсозатратність

TOPICSEPARATOR

#### Поняття Data Mining і його основні етапи

DM або інтелектуальний аналіз даних - це процес виявлення зв'язків, залежностей у великих наборах даних за допомогою методів машинного навчання і статистичного анілізу. Мета ІАД - отримати зрозумілу і важливу інформацію з великих наборів даних, яку можна застосувати для обґрунтованого прийняття рішень

Види ІАД:
- descriptive
- predictive
- prescriptive

Етапи ІАД:
1. Формулювання проблеми - яке саме знання я хочу отримати?
2. Приготування даних (pre-processing): витягнення, чистка, трансформація даних для приготування до подальшої обробки
3. Дослідження даних - підсумовування даних статистичними методами і візуалізація
4. Побудова моделі - застосування алгоритмів МН для подальших передбачень
5. Валідація моделі - перевірка ефективності моделі різними метриками
6. Застосування моделі
7. Оцінка результатів

#### Кластеризація, її застосування в Data Mining

Кластеризація - це процес утворення кластерів (з можливим визначенням класів) з розрізнених даних. Вона дозволяє знайти неявні або приховані зв'язки між даними в датасеті

Види кластеризації:
- жорстка: одна точка належить тільки одному клатеру
- м'яка: кожна точка може в різній мірі належати різним кластерам

Методи кластеризації:
- Центроїдні (k-means, k-medoids)
- на основі густини (DBSCAN)
- Ієрархічні (Agglomerative, divisive)
- на основі розподілу (GMM)
- Нечіткі (Fuzzy C-means)
- Сіткові (Grid clustering)

Застосування в data mining:
- обробка зображень, розпізнавання патернів
- маркетинг: поділ клієнтів на групи
- біологія: таксономія видів

#### Метод пошуку асоціативних правил в Data Mining

AR - це концепт пошуку зв'язків, патернів, кореляцій у великому наборі даних

Асоціативне правило виглядає наступним чином:
X -> Y (ознака X приводить до появи ознаки Y)

Ключові поняття:
Антецедент - незалежна ознака (X)
Консеквент - Залежна ознака від антецедента (Y)

Для виокремлення правил і визначення їх валідності застосовують наступні поняття:
- Support(X -> Y) - яка частку з усього датасет представляють антецедент і консеквент
	N(X and Y)/N
- Confidence(X -> Y) - яка частка даних, що містять антецедент, також містять консеквент
	Support(X and Y)/Support(X)
- Lift(x -> Y) - відношення спостережуваної підтримки до очікуваної, якщо антецедент і консеквент незалежні
	Confideence(X -> Y)/Support(Y)
Якщо lift == 1, то залежності нема, якщо більший, то залежність позитивна, якщо менший - то негативна

Якщо малий Support, то правило не може бути сильним, оскільки даних надто мало
Чим більше значення | Lift -1 |, тим сильніше правило

Застосування асоціативних правил в data mining:
- медицина: прогнозування ймовірності виникнення хвороби на основі наявних симптомів
- маркетинг: визначення зв'язків між продуктами, які покупці часто купляють разом 


#### Метод індуктивного моделювання в задачах інтелектуального аналізу даних

Метод індуктивного моделювання (data driven modelling) визначає оптимальну структуру і параметри моделі на основі наявних даних, на противагу дедуктивному моделюванню (theory driven modelling)

метод ІМ застосовується через груповий метод обробки даних (GMDH), який складається з наступних етапів:
1. Сепарація: поділ датасету на навчальний і тестувальний
2. Генерація базових функцій - для кожної пари вхідних значень генерується базовий квадратичний поліном
3. Еволюція - на основі навчального датасет підбираються коефіцієнти полінома методом найменших квадратів
4. Селекція - кожна модель оцінюється на тестувальному датасеті певними метриками, і відбираються найкращі з них як вхідні дані для наступних шарів
5. Кроки 2-4 повторюються для декількох шарів
6. Припинення на шарі, на якому спостерігається мінімальна похибка

Застосування в ІАД:
- передбачення часових рядів
- автоматизований відбір ознак
- Класифікація

#### Кластерний аналіз в інтелектуальних системах

Кластерний аналіз чи кластеризація (clustering) групує точки даних, які схожі між собою в кластери

Методи кластеризації:
- Методи поділу
	- K-means - визначає кожну точку як приналежну до найближчого центра, і постійно перераховує центр як середнє значення координат його точок
- Ієрархічні методи
	- Ієрархічна кластеризація будує дерево кластерів яке представляє або поступовий поділ одного великого кластера, або злиття декількох малих в залежності від обраного методу
- Методи густини групують точки даних в регіонах з великою кількістю точок, і області з малою кількістю точок визначають як шум
- Методи сітки ділять весь простір на клітини сітки і працюють схожим чином до k-means, але є більш ефективними на великих наборах даних

В інтелектуальних системах кластерний аналіз часто застосовується для виявлення аномалій: припускається, що звичайні дані групуються в тісні кластери, а розріджені точки за межами кластерів - це аномальні випадки. (DBSCAN)

Більшість методів кластеризації (K-means) працюють таким чином, що всім точкам призначається приналежність до первного кластеру, тому аномалії харакреризують за такими ознаками:
- точка знаходиться на аномально великій відстаані до найближчого сусіда у своєму кластері
- точка належить до малого або розрідженого кластера


Застосування

- сегментація ринку
- виявлення аномалій

Обмеження
- вибір кількості кластерів
- Складність застосування для великих наборів даних
- форми кластерів

#### Алгоритми нечіткого кластер-аналізу

FC на противагу класичним або жорстким методам кластеризації дозволяє кожній точці належати одразу до декількох кластерів у певній мірі

Алгоритм застосування Fuzzy C-means:
1. кожній точці призначається випадкове значення приналежності до кожного з кластерів
2. Обчислюються значення центроїдів шляхом пошуку середнього зважених координат
3. Кожній точці перепризначається приналежність до кластера на основі обчислених відстаней до центроїдів (рівні приналежностей оберненопропорційні до відстаней до центроїдів)
4. Кроки 2-3 повторюються до моменту, поки центроїди і значення приналежностей точок не стабілізуються

Переваги
- більша гнучкість
- менша чутливість до шуму
- доречний в застосуванні в наборах даних, які складно поділити на кластери

Обмеження
- Складність інтерпретування результатів
- Вища обчислювальна вартість

#### Генетичні алгоритми та еволюційне моделювання. Еволюційне програмування

Генетичні алгоритми  -  це методи еволюційної оптимізації, надхненні принципами природнього відбору та природньої еволюції. Вони працюють шляхом ітераційної еволюції популяції кандижатів рішень використовуючи оператори такі як селекція, мутації, перехрещення для пошуку рішення, близького до оптимального в умовах, коли стандартних методів оптиміхації недостатньо

Ключові поняння

- Популяція - Набір рішень на певній стадії алгоритму. Більший розмір популяції зазвичай приводить до кращих фінальних рішень запобігає ранній збіжності, але потребує більше обчислювальних ресурсів
- Хромосома - набір генів, в яких закодований кожен елемент рішення. Хромосома і являє в собі рішення з набору популяції
- Ген - найменший елемент хромосоми або рішення (змінна, переметр або ознака)
- Кодувальні методи - методи кодування елементів рішень у хромосоми
- Функція пристосованості - функція, яка оцінює якість рішення. Відрізняється для кожної задачі
- Критерій зупинки - умова виходу з алгоритму (перевищення часу виконання, отримання задовільного рішення, стагнація якості рішень, перевищення заданої кількості поколінь)
- Селекція - відбір хромосом з популяції з найкращими значеннями функції пристосованості (випадковий з розподілом ймовірностей, турнір(найкращі кандидати з випадково відібраних множин)). Хромосоми, які пройшли селекцію, стають батьками для нового покоління
- Перехрещення - перемішування генів між батьками для побудови нової популяції рішень
- Мутація - випадкові зміни в генах для збереження різноманітності популяції і запобігання ранній збіжності

Алгоритм:
1. Випадкова ініціалізація популяції
2. застосування Функція пристосованості для оцінки якості рішень
3. Селекція батьків
4. Перехрещення хромосом
5. Випадкові мутації
6. Формування нової популяції
7. Повторення кроків 2-6 до виконання критерію зупинки

#### Ройові алгоритми обчислювального інтелекту

Ройові алгоритми - це стохастичні методи пошуку оптимального значення, надхненні природньою поведінкою груп тварин (птахів, риб, мурах, бджіл). Вони застосовуються в складних завданнях зі складним, нелінійним, мультимодальним простором пошуку, де звичайні градієнтні алгоритми неефективні

Найвідоміший з ройових алгоритмів - PSO (particle swarm optimization). Він використовє набір (популяцію) частинок, кожна з яких маєЖ
- координати, 
- швидкість, 
- якість і координати найкращої особистої позиції, 
- якість і координати найкращої позиції серед частинок групи


Алгоритм PSO:
1. Випадково генеруються точки в просторі пошуку [minx, maxx], кожна точка отримує випадкову швидкість, і оцінку якості координат (fitness value)
2. Після кожної ітерації оновлюється швидкість частинок за формулою:
	v=w⋅v0​+c1​⋅r1​⋅(pBest_i​−x0​)+c2​⋅r2​⋅(gBest−x0​)
	- x0 - попередня позиція
	- v0 - попередня швидкість
	- pBest - найкраща позиція частинки
	- gBest - найкраща позиція групи
	- w - вага інерції (для конторю незалежності частинок)
	- с1, c2 - ваги попередніх рішень
	- r1, r2 - випадкові значення від 0 до 1
3. Оновлюється позиція частинок:
	x1 = x0 + v1
4. Оновлюються найкращі значення позицій для групи і для частинок
	pBest1 = max(pBest0, x1)
5. кроки 2-4 повторюються до збігання рою в одній точці


#### Гібридні алгоритми ройової оптимізації

Гібридні алгоритми ройової оптимізації поєднують традиційні моделі ройового інтелекту (SI) з еволюційними алгоритмами, методами локального пошуку або техніками машинного навчання. 

Поширені стратегії гібридизації: 
- «Рій + Рій» (багаторойовий / міжалгоритмічний): поєднує взаємодоповнюючі переваги двох різних ройових методів. Наприклад, поєднання оптимізації рою частинок (PSO) — яка забезпечує швидку математичну збіжність — з оптимізацією мурашиної колонії (ACO) — яка вирізняється ефективністю у дискретному плануванні траєкторій та глобальному комбінаторному пошуку. 
- Рій + еволюційні алгоритми (EA): інтегрує оператори з генетичних алгоритмів або диференціальної еволюції (такі як кросовер та мутація) в оновлення рою. Це вносить випадкові елементи різноманітності, що допомагають популяції уникнути локальних мінімумів. 
- Рой + локальний пошук / математичне програмування: використовує глобальний ройовий алгоритм для широкого відображення простору пошуку та виявлення перспективних областей, після чого застосовується детермінований або градієнтний метод локального пошуку (наприклад, методи Сімплекс або Пауелла) для точного налаштування та визначення точного локального оптимуму. 
- Рой + машинне навчання / системи керування: Вбудовує моделі машинного навчання, нейронні мережі або дерева поведінки в агентів для адаптивного змінення параметрів (таких як вага інерції або коефіцієнти прискорення) або управління тактичними локальними рішеннями на основі станів навколишнього середовища.

#### Основні методи попередньої обробки текстових даних для Text Mining

Попрередня обробка тексту (text preprocessing) - це сукупність методів для підготовки текстових даних для подальшої обробки методати text mining

Основні методи ПОТ включають:
1. Очистка регулярними виразами: всі великі літери замінюються на малі, забирабться пусті рядки, подвійні пробіли, пунктуація, теги html і так далі
2. Токенізація: поділ блоку тексту на малі одиниці (слова, речення, інколи частини слів (для NLP))
3. Видалення стоп-слів: з тексту прибираються слова, які не надають багато змісту (зазвичай службові частини мови: прийменники, сполучники, частки, вигуки)
4. Стемінг: скорочення слів до кореня або базової форми, відкидання закінчень
5. Лемматизація: конвертація слів у базову словникову форму
6. Конвертація емоджі: емоджі замінюються на їхню текстову назву
7. Виправлення помилок: пошук і заміна неправильно написаних слів

#### Алгоритм класифікації текстів, принцип його функціонування

Класифікація тексту - одне з найпопулярніших завдань для методів машинного навчання

Загальний принцип роботи алгоритмів класифікації тексту:

1. Отримання текстових даних
2. Попередня обробка тексту
3. векторизація (перетворення текстових даних в числовий формат)
4. Тренування моделі машинного навчання
5. Застосування моделі і передбачення класів
6. Оцінка результатів на тестувальном датасеті різними метриками (Accuracy, Precision, Recall, F1-Score)

Методи класифікації:
- класичні (наївний баєсівський, KNN, SVM, decision tree, random forest, gradient boosting)
- deep learning (RNN, CNN)
- Трансформерні моделі (BERT)
- ****Zero-shot and Few-shot Classification**** - класифікація без попереднього навчання (GPT, BART)

#### Алгоритми видобування даних з текстів

видобування даних з текстів (text mining) - це набір методів для отримання корисної інформації з масивних текстових даних і виявлення прихованих зв'язків із застосування технік машинного навчання

Алгоритми видобування даних з текстів включають:
- класифікація тексту - присвоєння текстам лейблів на основі їх змісту
- підсумовування тексту - скорочене вираження змісту довгого тексту
- кластеризація тексту - поділ текстових даних на кластери для виявлення класів або аномалій

Етапи застосування методів text mining:
1. Попередня обробка
	1. Токенізація (поділ на слова або речення)
	2. Визначення складних слів (n-грами)
	3. Нормалізація і зменшення шумів (стемінг, лемматизація, фільтрування стоп слів)
	4. лінгвістичний аналіз (теги частин мови, NER)
2. Аналіз змісту
	1. На основі словників
	2. Алгоритмічні методи (класифікація(naive bayes, knn), кластеризація(k-means, ))



#### Методи визначення ключових слів в процесі Text Mining

визначення ключових слів (keyword extracion) - це одне з ключових завдань text mining, яке слугує підґрунтям для інших завдань text mining: підсумовування, класифікація, категоризація, а також для оптимізації пошукових алгоритмів

Для застосування будь-якого методу визначення ключових слів, текст має пройти попередню обробку: токенізація, видалення стоп-слів, стеммінг або лематизація (зведення слів до їхньої кореневої форми).

Основні методи включають:
- TestRank:
	1. Побудова графа: TestRank будує графове представлення тексту, де вузли представляють слова або фрази, а ребра — взаємозв’язки між ними. 
	2. Оцінювання вузлів: Кожному вузлу у графі присвоюється оцінка на основі ступеня вузла, його центральність у графі, його положення в документі
	3. Ранжування ключових слів: Після оцінювання всіх вузлів у графі TestRank ранжує їх на основі отриманих балів. Вузли з найвищими балами вважаються найважливішими ключовими словами або фразами в документі.

- KeyBERT
	1. Вхідний текст: Ми надаємо KeyBERT фрагмент тексту, наприклад документ, статтю або абзац, з якого потрібно виокремити ключові слова.
	2. Вбудовування BERT: KeyBERT використовує BERT для перетворення слів або фраз у вхідному тексті на вектори високої розмірності, які називаються embeddings.
	3. Виділення ключових слів: застосовуються методи кластеризації, щоб визначити найважливіші слова чи фрази в тексті. 

- RAKE (Rapid Automatic Keyword Extraction)
	1. Кожному токену присвоюється оцінка, що базується на частоті його вживання в тексті та частоті його поєднання з іншими словами. Слова, що зустрічаються часто, і розташовані близько одне до одного, отримують вищі оцінки від RAKE.
	2. формується рейтинг на основі оцінок потенційних ключових слів. 
	
- YAKE (Yet another Keyword Extraction)
	1. Оцінювання термінів: На основі статистичної релевантності в межах уривка кожному потенційному ключовому слову або ключовій фразі присвоюється оцінка. Для визначення релевантності кожного терміна YAKE використовує статистичний показник, такий як TF-IDF (частота терміна — обернена частота документа). Для вдосконалення процедури оцінювання YAKE може також враховувати додаткові фактори, такі як позиція слова та спільне вживання термінів.
	2. формується рейтинг на основі оцінок потенційних ключових слів. 

#### Метрики для оцінки якості класифікації текстів

1. Точність (accuracy) - відношення кількості правильно передбачених класів до всіх передбачень загалом
2. Матриця помилок (confusion matrix) - дає повну картину всіх передбачень класифікаційної моделі (в ідеальному випадку всі значення матриці мали б бути 0, окрім головної діагоналі) - дає можливість побачити, з якими саме класами модель гірше працює
3. Точність (precision) TP/TP+FP
4. відтворюваність (recall) = TP/TP+NP
5. рахунок F1 - Поєднання точності і відтворюваності 2 * presicion * recall / (presision + recall)

Завдання класифікації тексту (наприклад, категоризація за темами) часто передбачають наявність більше ніж двох класів. Для їхньої оцінки необхідно підсумувати бінарні показники по всіх класах. Для цього можна застосувати такі методи агрегації:
- Macro-Average: рахує мертики для кожного класу окремо, потім обчислює середнє
- Micro-Average: Рахує глобальні метрики алгоритму по всіх класах
- Weighted-Average: рахує мертики для кожного класу окремо, потім обчислює зважене середнє (метрики кожного класу множаться на його support, потім нормалізуються)
#### Особливості Web Mining, основні відмінності від стандартних методів Data Mining

Веб майнінг - це процес застосування методів інтелектуального аналізу даних, машинного навчання, статистичних і аналітичних методів для видобвання значимих патернів і отримання важливої інформації з інтернету

Категорії Web mining:
- Web content mining - інформація з веб сторінок (текст, зображення, метадані)
- Web structure mining - інформація структури посилань для аналіху звйязків між сторінками
- Web usage mining - інформація про поведінку користувачів 

Процес застосування Веб майнінг
1. Збір даних (raw data)
2. попередня обробка даних: конвертація даних в числові або категоріальні формати, парсинг html, видалення шумів, обробка неіснуючих або порожніх даних
3. Виявлення закономірностей: застосування методів data mining і machine learning (кластеризація, класифікація, видобуття асоціативних правил, обробка природньої мови)
4. Аналіз та інтерпретація результатів для прийняття подальших рішень

Відмінності від стандартних методів:
- напівструктурована або неструктурована природа даних, різні формати, наявність шумів
- Використовуються методи вищого рівня абостакції (text mining, usage mining, multimeedia mining, link analysis)
- застосовуються в особливих use cases: аналіз поведінки, рекомендаційні системи, персоналізація

#### Методи зменшення розмірності в аналізі тексту

зменшення розмірності - це метод, спрямований на зменшення кількості ознак у наборі даних, зберігаючи найбільш критичну інформацію. Він трансформує багатовимірні дані, зменшуючи їх розмірність для спрощення подальшої обробки

Методи зменшення розмірності включають:
- відбір ознак (feature selection) (фльтрація всіх ознак і відбір найбільш ррелевантних)
	- Методи фільтрів - ранжування ознак за їх релевантністю
	- методи обгорток - використання ефективонсті моделі як критерію для віжбору ознак
	- вбудовані методи - вбудовує вибір ознак у процес навчання моделі
- видобування ознак (feeature extraction) (комбінування або трансформування ознак)
	- PCA (Principal Component Analysis) - конвертація корельованих змінних в некорельовані, зменшуючи розмірність
	- ICA (Independent Component Analysis) - виоркемлення статистично незалежних компонент в ознаки
	- Факторний аналіз - Групує змінні, які корелюють між собою, залишаючи найбільш релевантні для подальшого аналізу

В роботі з текстом для проведення векторизації попередньо потрібно видобути набір ознак, для цього може застосовуватися feature extraction



TOPICSEPARATOR

#### Основні етапи побудови математичної моделі

Математичне моделювання - це інстрмент для представлення реальних складних систем через математичні рівняння та алгоритми. Математичні моделі використовуються для симуляції, аналізу або прогнозування поведінки складних систем

В data science найчастіші завдання, які вирішуються ММ - це 
- класифікація
- регресія
- кластеризація
- оптимізація

Етапи побудови математичної моделі
1. Формулювання задачі - включає формування змінних, параметрів і зв'язків
2. Формулювання моделі - транслювання задачі в математичні терміни і вибір типу моделі в залежності від задачі:
	- Лінійні (з лінійним зв'язком між змінними)
	- Нелінійні (з нелінійними зв'язками)
	- Стохастичні (для систем з елементами випадковості)
	- Диференційні рівняння (для динамічних систем)
3. Застосування моделі - зазвичай включає застосування моделі в програмному середовищі (написання коду для числового розв'язання задачі)
4. Валідація та аналіз - оцінка точності застосованої моделі в порівнянні з реальними результатами і аналіз поведінки моделі з різними параметрами

#### Моделі для прогнозування, ключові фактори які враховуються при цьому

Прогностичне моделювання - це процес використання даних, статисничних алгоритмів, машинного навчання для передбачення майбутніх трендів на основі історичних даних

Види математичних моделей для прогнозування:
- Лінійна регресія - застосовується коли зв'язок між залежною інезалежною змінними є лінійним
- Логістична регресія - застосовується коли залежна змінна є бінарною
- Дерева рішень
- Random forests - набір дерев рішень, які працюють паралельно
- Метод опорних векторів
- Нейронні мережі
- Gradient boosting
- Моделі часових рядів

Для вибору моделі враховуються такі фактори:
- суть проблеми (класифікація, регресія, ...)
- Природа даних і зв'язків між змінними
- Ефективність моделей (оцінка метриками acc, prec, F1, AUC-ROC)


#### Поняття регресії, її використання для задачі прогнозування

Регресія - це метод навчання з учителем, який використовується для передбачення неперервних числових значень через вивчення зв'язків між вхідними даними та вихідним результатом (target).

Регресія використовується в завданнях прогнозування, оцінюванню ризиків, передбачення трендів, прийнятті рішень

Види регресії:
- Проста лінійна
- Множинна лінійна
- Поліноміальна
- Логістична
- Регресія Ridge(L2) і Lasso(L1)
- регресія опорних векторів
- Регресія дерев рішень
- Регресія random forest

Метрики оцінювання якості регресійних моделей:
- MSE - середнє квадрату відстані між передмаченими і реальними значеннями
- MAE - середнє абсолютної відстані між передмаченими і реальними значеннями
- RMSE - корінь MSE
- R2 score - значення від 0 до 1, вищі значення осначають кращу якість прогнозування
- huber loss - гібридна функція втрат, яка переходить від MAE до MSE для більших похибок

#### Методи прогнозування для часових рядів

Серед методів прогнозування часових рядів виділяють:
- Методи машинного навчання
	- Random Forets - паралельна ансамблева модель МН для прогнозування ЧР через регресію
	- Gratient Boosting Machine - послідовна ансамблева модель МН для прогнозування ЧР через регресію
	- Generalized additive models
- Матоди глибогого навчання
	- CNN - згорткові НМ для виявлення локальних часових закономірностей
	- RNN - рекурентні НМ для послідовних залежностей
	- LSTM (Long short-time memory networks) - Для тривалих у часі залежностей
	- GRU (Gated recurreent units) - просліша альтернатива LSTM
	- Sequence-to-Sequence - архітектура енкодер-декодер для складних рядів
- Ймовірнісні та баєсівські моделі
	- Гаусівські процеси - ймовірнісне моделювання з оцінкою невизначеності
	- State Space Models - представлення часових рядів як станів, що еволюціонують
	- DLM (Dynamic Linear Models) - змінні в часі лінійні моделі
	- HMM (Hidden Markov Models) - моделі з прихованими станами
- Статистичні моделі 
	- ARIMA (Autoregreessive Integratd Moving Average) - моледь, яка застосовує авторегресію, диференціювання, зсув середнього для передбачення часових рядів. Існує сімейство подібних методів для прогнозування даних різних форматів

#### Типи моделей прогнозування в залежності від характеру вхідних даних

Вхідні дані можуть бути:
1) Однофакторні чи багатофакторні
2) Дискретні чи неперервні
3) Великого або малого обсягу
4) Стаціонарні чи нестаціонарні
5) Сезонні чи несезонні
6) Лінійні чи нелінійні
7) Розріджені чи густі
8) Структуровані чи неструктуровані
9) Високої або низької розмірності

Моделі прогнозування ділять на такі категорії:
- Моделі машинного навчання - підходять для багатофакторних табличних даних з нелінійними залежностями
- Моделі глибокого навчання - підходять для великих обсягів неструктурованих даних з нелінійними зв'язками і високою розмірністю
- Ймовірнісні і Баєсівські моделі - підходять для невеликих наборів даних з високою мінливістю
- Статистичні методи - підходять для обмежених в часі, стаціонарних або строго сезонних часових рядів


#### Модель лінійної регресії, принцип роботи, переваги її використання при прогнозуванні

Лінійна регресія - це один з фундаментальних методів машинного навчання, який всановлює зв'язок між залежною змінною та однією або декількома незалежними змінними. Завдання лінійної регресії - побудувати пряму лінію в просторі ознак, яка найкраще репрезентує набір даних.

Ключове припущення лінійної регресії - це те, що змінні пов'язані між собою лінійною залежністю

Види ЛР:
- проста (одна незалежна змінна) - y = T0 + T1x
- множинна (декілька незалежних змінних) - y = T0 + T1x1 +T2x2 + ... +Tnxn

Принцип роботи
- Мета ЛР - знайти best-fit line (лінія найкращої відповідності) - пряма лінія, яка мінімізує суму квадрадів відстаней до всіх точок даних. Рівняння прямої y=mx+b - застосовується для простої ЛР з однією незалежною змінною
- Для вирішення задачі регресії, потрібно підібрати коефіцієнти m та b. Зазвичай це досягається одним із двох способів:
	1. Метод найменших квадратів minimize(sum((yi - yi^)^2)) (для малих наборі в даних)
	2. Градієнтний спуск - метод оптиміцязії моделі шляхом поступового зменшення функції втрат. Функція втрат - зазвичай MSE (для великих наборів даних)

Переваги
- простий в застосуванні і розумінні параметрів
- легко масштабувати для великих даних
- Чутливий до нетипових точок даних
- Має широке застосування
Обмеження
- покладається на багато припущень про природу даних (лінійна залежність, незалежність ознак)

#### Метрики для оцінки точності моделей прогнозування

- MSE - середнє квадрату відстані між передмаченими і реальними значеннями. Часто надто чутлива до нетипових точок
- MAE - середнє абсолютної відстані між передмаченими і реальними значеннями. Надає однакову увагу до малих і великих похибок
- RMSE - корінь MSE
- MAPE 
- R2 score - значення від 0 до 1, вищі значення осначають кращу якість прогнозування
- huber loss - гібридна функція втрат, яка переходить від MSE до MAE для більших похибок

#### Методи врахування сезонності при прогнозуванні

Сезонність - це характеристика наборів даних (зазвичай часових рядів), яка позначає повторюваність певних патернів на однакових проміжках часу (день, місяць, сезон)

Моделі, які застосовуються для прогнозування сезонних даних, мають ізолювати та екстраполювати циклічні патерни і базові тренди

Для цього застосовується декомпозиція часових рядів

Моделі, які враховують сезонність у прогнозуванні:
1. Holt Winters - для чіткої постійної сезонності
2. SARIMA (Seasonal Autoregressive Integrated Moving Average) - для прогнозу додає відхилення від тренду з попереднього циклу 
3. STL(Seasonal and Trend decomposition using Loess) - працює як фільтр, який вилучає повторювану хвилю (сезонність) з сигналу

#### Принципи побудови моделей для прогнозування з багатьма змінними

Моделі MTSF (Multivariative Time Series forecasting) - це прогностичні моделі, які використовуються для наборів даних, в яких декілька змінних, залежних від часу, впливають одна на одну. 

Такі моделі можна поділити на 3 категорії:

- Статистичні та економічні моделі
	- VAR (Vector Autoregression)
	- ARIMAX (Autoregression Integrated Moving Average Exogenous Variables)
	
- Моделі машинного навчання
	- Ансамблі дерев рішень (Random forests, Gradient boosting)
	- SVR (Support Vector Regression)
	
- Моделі глибокого навчання
	- LSTM (Long Short-term memory model)
	- TFT (Temporal Fusion Transformers)

Всі моделі MTSF поділяють наступні припущення та принципи:
- Всі змінні залежні від часу і своїх попередніх станів
- Всі змінні певним чином впливають одна на одну. Кожна модель ідентифікує та обчислює коваріацію різних змінних між собою
- Моделі дискретизують неперервні часові ряди на відрізки, які утворюють матрицю минулих станів. На її основі робиться передбачення про матрицю майбутніх станів
- Поділ змінних на ендогенні (які модель намагається передбачити) і екзогенні (які не залежать від інших змінних, але впливають на них)

#### Реалізація верифікації моделі прогнозування

на відміну від класичної крос-валідації з k блоками, тут набір даних не можна поділити випадковим чином, оскільки модель може навчатись лише на даних, які передують прогнозу

Для верифікації надійності і точності моделей прогнозування використовують наступні методи:

1. Хронологічна валідація: Набір даних ділиться одній хтонологічній точці, таким чином, щоб 70-80% даних опинилося зліва від неї (тренувальний набір даних), і 20-30% справа (тестувальний набір даних). Модель прогнозування навчається на більшому наборі історичних даних, потім прогнозує решту часового ряду, і результати прогнозу порівнюються з тестувальним набором.


2. Крос-валідація часових рядів: Набір даних ділиться на k відрізків, посортованих хронологічно. Модель використовує 1-й відрізок для навчання, потім прогнозує 2-й. Помилка прогнозу занотовється. Далі в залежності від варіанту крос-валідації, модель або відкидає 1-й блок і тренується лише на 2-му для передбачення 3-го, або додає до тренувального набору 2-й блок і навчається на 1-му і 2-му блоці разом для передбачення 3-го. Цей проце повторюється для всіх k блоків часового ряду


Перший спосіб менш надійний, але простіший в застосуванні, тоді як другий потребує достатньо великого набору даних для ефективного використання

TOPICSEPARATOR

#### Поняття нейронної мережі, принцип її роботи

Визначення: Нейронні мережі - це моделі машинного навчання, які відтворюють принцип функціонування нейронів людського мозку для вирішення складних задач прогнозування. Модель НМ складається зі зв'язаних між собою вузлів або нейронів, які обробляють дані і вивчають патерни напряму з даних

Ключові поняння
- Нейрони
- Зв'язки
- Ваги і зміщення
- Функції просування
- Функції активації

Структура НМ
Нейронна мережа складається з декількох шарів нейронів, серед них:
- вхідний шар, де нейрони представляють конкретні ознаки
- один або декілька прихованих шарів, де відбувається основна частина обчислень і підбору ваг і зміщень
- Вихідний шар, який видає прогноз

Принцип навчання
1. Просування вперед
	1. Лінійна трансформація: кожен нейрон кожного шару має набір ваг і зміщення, які використовуються для обчислення і передачі наступному шару
		z = w1x1 + w2x2 + ... + wnxn + b
	2. Функція активації: Для введення нелінійності і перспективи виявлення складніших закономірностей вводиться функція активації (ReLU, sigmoid, tanh), яка трансформує значення z 
2. Просування назад
	1. Після проходження всіх шарів, отримується передбачення НМ. Вводиться функція втрат, яка оцінює точність резуультату. Завдання всього процесу навчання - підібрати ваги і зміщення в нейронах таким чином, щоб мінімізувати функцію втрат. 
	2. Після оцінки результату, обчислюється градієнт функції втрат і вплив кожної ваги і зміщення на похибку
	3. Методом градієнтного спуску перераховуються ваги і зміщення в нейронах таким чином, щоб зменшити значення функції втрат при наступному проходженні
3. Ітераційне навчання
	Процес просування вперед, оцінки функції втрат, і просування назад повторюється циклічно впродовж усього процесу навчання до виконання певної умови (досягнута кількість циклів навчання або необхідна точність)


#### Принцип роботи багатошарового перцептрона

Визначення: Багатошаровий перцептрон (MLP) - це різновид НМ, яка складажться із 3-х або більше шарів (вхідний, один або декілька прихованих, вихідний), які повністю пов'язані між собою

Структура НМ
Нейронна мережа складається з декількох шарів нейронів, серед них:
- вхідний шар, де нейрони представляють конкретні ознаки
- один або декілька прихованих шарів, де відбувається основна частина обчислень і підбору ваг і зміщень
- Вихідний шар, який видає прогноз

Принцип навчання
1. Просування вперед
	1. Лінійна трансформація: кожен нейрон кожного шару має набір ваг і зміщення, які використовуються для обчислення і передачі наступному шару
		z = w1x1 + w2x2 + ... + wnxn + b
	2. Функція активації: Для введення нелінійності і перспективи виявлення складніших закономірностей вводиться функція активації (ReLU, sigmoid, tanh), яка трансформує значення z 
2. Просування назад
	1. Після проходження всіх шарів, отримується передбачення НМ. Вводиться функція втрат (MSE, бінарна перехресна ентропія), яка оцінює точність резуультату. Завдання всього процесу навчання - підібрати ваги і зміщення в нейронах таким чином, щоб мінімізувати функцію втрат. 
	2. Після оцінки результату, обчислюється градієнт функції втрат і вплив кожної ваги і зміщення на похибку
	3. Функцією оптимізації (зазвичай стохастичного градієнтного спуску) перераховуються ваги і зміщення в нейронах таким чином, щоб зменшити значення функції втрат при наступному проходженні
3. Ітераційне навчання
	Процес просування вперед, оцінки функції втрат, і просування назад повторюється циклічно впродовж усього процесу навчання до виконання певної умови (досягнута кількість циклів навчання або необхідна точність)

#### Алгоритм зворотного розповсюдження помилки в нейронних мережах

Визначення: Алгоритм зворотного розповсюдження в НМ - це алгоритм зманшення помилки прогнозування. Він працює ітеративним шляхом, постійно оновлюючи значення ваг і зміщень у нейронах НМ із застосуванням градієнтів і правил ланцюгового диференціювання 

Принцип застосування
1. Просування вперед
	1. Лінійна трансформація: кожен нейрон кожного шару має набір ваг і зміщення, які використовуються для обчислення і передачі наступному шару
		z = w1x1 + w2x2 + ... + wnxn + b
	2. Функція активації: Для введення нелінійності і перспективи виявлення складніших закономірностей вводиться функція активації (ReLU, sigmoid, tanh), яка трансформує значення z 
	3. Кожен шар НМ формує вхідні дані для наступного шару
2. Просування назад
	1. Після проходження всіх шарів, отримується передбачення НМ. Вводиться функція втрат (MSE, бінарна перехресна ентропія), яка оцінює точність результату. Завдання всього процесу навчання - підібрати ваги і зміщення в нейронах таким чином, щоб мінімізувати функцію втрат. 
	2. Після оцінки результату, обчислюється градієнт функції втрат і вплив кожної ваги і зміщення на похибку через правила ланцюгового диференціювання 
	3. Функцією оптимізації (зазвичай стохастичного градієнтного спуску) перераховуються ваги і зміщення в нейронах таким чином, щоб зменшити значення функції втрат при наступному проходженні. Тут же застосовується параметр швидкості навчання, який регулює, наскільки сильнозмінюються ваги післі кожної ітерації
3. Ітераційне навчання
	Процес просування вперед, оцінки функції втрат, і просування назад повторюється циклічно впродовж усього процесу навчання до виконання певної умови (досягнута кількість циклів навчання або необхідна точність)


#### Типи нейронних мереж, відмінності міх ними

Визначення: Нейронні мережі - це моделі машинного навчання, які відтворюють принцип функціонування нейронів людського мозку для вирішення складних задач прогнозування. Модель НМ складається зі зв'язаних між собою вузлів або нейронів, які обробляють дані і вивчають патерни напряму з даних

типи НМ:

1. FFNN
	1. Одношаровий перцепртон - найпростіша версія НМ, де перцептрон отримує вхідні дані, проводить лінійну трансформацію і використовує функцію активації, яка й видає результат
	2. Багатошаровий перцептрон - класичний приклад НМ з 3 або більше шарами
	3. Згорткові НМ (CNN) - використовуються для обробки матричних даних (часто зображень). Вони використовують згорткові шари для виявлення закономірностей
2. RNN - Обробляє послідовні дані, використовуючи цикли зворотного зв’язку для збереження контексту з часом.
	1. LSTM (Long Short-term Memory networks) - тип (RNN) з комірками пам'яті та воротами, що дозволяють враховувати довготривалі залежності й уникати проблеми зникнення градієнтів.
	2. GRU (Gated Reccurent Unit) - різновид RNN, що використовує механізм керування потоком інформації (гейтинг), подібно до LSTM, але має меншу кількість параметрів.
3. UNN
	1. Автоенкодери - нейронні мережі з прямим поширенням, які кодують вхідні дані у латентний простір, а потім їх реконструюють. Енкодер відображає вхідні дані у стисле представлення, а декодер — відтворює їх.
4. Трансформери(BERT, GPT) - використовують механізм самоуваги, що забезпечує паралельний процес, який прискорює обробку вхідних даних для токенізації і, таким чином, покращує виявлення залежностей.

#### Навчання без вчителя

Навчання без вчителя - це область МН, в якій використовуються лише непромарковані дані, і яка дозволяє відкрити приховані структури і взаємозв'язки в наборах даних. Навчання без вчителя застосовується для таких завдань:
- виявлення аномалій
- зменшення розмірності
- кластеризація

Компоненти Автоенкодера:
- енкодер-декодер: енкодер зменшує розмірність даних для роботи НМ, декодер реконструює дані після оборбки НМ
- Латентний простір: результат роботи енкодера. Це абстрактне представлення даних зі збереженням ключових ознак
- навчальний алгоритм: алгоритм підбору ваг і зміщень (зазвичай SGD або ADAM)
- функція втрат: оцінює ефективність НМ

Типи UNN
1. Автоенкодери - Це НМ, які навчаються стискати і реконструювати дані. Компоненти Автоенкодера:
	- енкодер-декодер: енкодер зменшує розмірність даних для роботи НМ, декодер реконструює дані після оборбки НМ
	- Латентний простір: результат роботи енкодера. Це абстрактне представлення даних зі збереженням ключових ознак
	- навчальний алгоритм: алгоритм підбору ваг і зміщень (зазвичай SGD або ADAM)
	- функція втрат: оцінює ефективність НМ
2. RBM (обмежена машина Больцмана) - НМ, яка використовується для виоркемлення ознак з неструктурованих даних, 
3. GAN (Генеративні змагальні мережі) - НМ, яка складається з генератора і дискримінатора. Генератор намагається створити дані, схожі на реальні, а дискримігатор намагається відрізнити згенеровані дані від справжніх. Результатом навчання є алгоритм, який може створювати реалістичні дані
#### Навчання з підкріпленням

навчання з підкріпленням (RL) - це галузь машинного навчання, яка дозволяє досягти задовільних рішень методом проб і помилок і відгуком у вигляді покарання або нагород. 

Ключові поняття:
- Агент - суб'єкт (модель МН), який виконує дії
- Середовище - система, в якій оперуує агент
- Стан - умови, в яких перебуває агент
- Дія - рішення, яке приймає агент, і яке призводить до відгуку (нагороди або покарання)
- Нагорода - відгук середовища на дію агента

Процес навчання:
1. Агент спостерігає стан середовища
2. Він обирає та виконує дію відповідно до своєї політики.
3. Середовище реагує, переходячи в новий стан і надаючи винагороду (або штраф).
4. Агент оновлює свої знання (політику, функцію цінності) на основі отриманої винагороди та нового стану.
5. Цей цикл повторюється, при цьому агент підтримує баланс між дослідженням (випробуванням нових дій) та використанням (застосуванням відомих ефективних дій) з метою максимізації сукупної винагороди з плином часу.

Цей процес математично формулюється як процес прийняття рішень маркова (MDP), в якому майбутні стани залежать лише від поточного стану та дії, а не від попередньої послідовності подій.
#### Q- навчання

Q- навчання - це популярний метод навчання з підкріпленням без застосування моделей, в якій агент безпосередньо взаємодіє з середовищем і отримує відгук у вигляді штрафів або нагород. Мета Q-навчання - навчити агента приймати оптимальні або задовільні рішення в складних системах

Ключові компоненти Q-learning:
- Q-значення або значення дій - це значення які представляють очікувану нагороду за здійснену дію, і оновлюються кожної ітерації
- нагороди та епізоди - агент рухається через різні стани, і отримує нагороди. Коли він досягає термінального стану - епізод закінчується
- Часова різниця (TD-update) - агент оновлює q-значення після кожного стану за формулою:
	Q(S,A)←Q(S,A)+α(R+γQ(S′,A′)−Q(S,A)).
	де:
	- S - терепішній стан
	- A — дія, яку виконує агент.
	- S' — наступний стан, у який переходить агент.
	- A' — найкраща наступна дія у стані S'.
	- R — винагорода, отримана за виконання дії A у стані S.
	- γ (гамма) — коефіцієнт дисконтування, який зрівноважує негайні винагороди з майбутніми.
	- α (альфа) — швидкість навчання, що визначає, наскільки нова інформація впливає на старі Q-значення.
- Політика ϵ-greedy (дослідження проти застосування)
    - Застосування: агент обирає дію з найвищим Q-значенням з імовірністю 1−ϵ. Це означає, що агент використовує свої поточні знання для максимізації винагород.
    
    - Дослідження: з імовірністю ϵ агент обирає випадкову дію, досліджуючи нові можливості, щоб дізнатися, чи існують кращі способи отримання винагород. Це дозволяє агенту відкривати нові стратегії та з часом вдосконалювати процес прийняття рішень
- Q-таблиця — структура пам’яті, в якій агент зберігає інформацію про те, які дії приносять найкращі винагороди в кожному стані, і на основі якої агент приймає рішення. на кожному новому стані агент оновлює Q-таблицю.

Процес навчання:
1. Початок у стані (S)
	Середовище надає агенту початковий стан
2. Агент обирає дію (A)
	На основі поточного стану агент обирає дію, керуючись своєю політикою. Це рішення ґрунтується на Q-таблиці, яка оцінює потенційні винагороди для різних пар «стан-дія». Зазвичай агент використовує ε-жадібну стратегію:
3. Дія виконується, і середовище реагує
	Агент виконує обрану дію. Після цього середовище надає:
	- Новий стан (S′) — результат дії.
	- Винагороду (R) — зворотний зв’язок щодо ефективності дії.
4. Алгоритм навчання оновлює Q-таблицю
	Агент оновлює Q-таблицю, використовуючи новий досвід: Він коригує значення пари «стан-дія» на основі отриманої винагороди та нового стану. 
5. Політика вдосконалюється, і цикл повторюється
	Маючи оновлені Q-значення, агент:
	- Вдосконалює свою політику, щоб у майбутньому приймати кращі рішення.
	- Продовжує цей цикл — спостерігаючи за станами, виконуючи дії, отримуючи винагороди та оновлюючи Q-значення протягом багатьох епізодів.

З часом агент засвоює оптимальну політику, яка стабільно приносить максимально можливу винагороду в середовищі.

#### Поняття функції активації, її приклади

Функція активації - це останній етап обчислень в нейроні НМ, який застосовується до зваженої суми вхідних даних і використовується для введення нелінійності, щоб дозволити мережі вивчати комплексні закономірності

Прикладифункцій активації:
- Лінійна: f(x) = x - те саме, що й відсутність ф-ї активації
- ReLU: f(x) = max(0, x) - прирівнює всі від'ємні значення до 0. Легко обчислюється і є основою для декількох інших ф-й активації
- leaky ReLU: f(x) = ax if x < 0 else x - пропускає від'ємні значення, але зменшує їх вплив
- Сигмоїд f(x) = 1/(1+e^(-x)) - утворює плавний перехід на області значень [0, 1]. Підходить для оптимізації SGD. Також застосовується у вихідному шарі 
- функція гіперболічного тангенса: f(x) = 1 - 2/(1+e^(-2x)) - розтягнутий сигмоїд на області значень [-1, 1]
- SoftPlus: f(x) = log(1 + e^x) - схоже на ReLU, але з плавним переходом в точці 0
- SoftMax - використовується у вихідному шарі і конвертує результати у ймовірності (нормалізує, щоб їх сума дорівнювала 1)






#### Градієнтний спуск, його використання для оптимізації

Градієнтний спуск — це алгоритм оптимізації, що використовується для мінімізації похибки моделі машинного навчання шляхом оновлення параметрів (ваг і зміщень) у напрямку зменшення втрат.

Формула:
w=w−α ∂L/∂w
​b=b−α ∂L/∂b​
де
α:швидкість навчання
L:Функція втрат
∂L/∂w,∂L/∂b​​:градієнти втрат

Варіації:
- стохастичний градієнтний спуск - рахується не на всьому наборі даних, а на малій вибірці. Це сповільнює збіжність, але економить ресурси
- пакетний градієнтний спуск - рахується на всьому наборі даних, що підвищує точність

Застосовується в:
1. Лінійній регресії
	- Обчислює, як змінюється функція втрат залежно від ваги $w$ та зміщення $b$
	- Поступово оновлює ці параметри для зменшення помилки прогнозування
	- Повторює цей процес, доки значення функції втрат не стане дуже малим і не буде знайдено найкращу пряму
2. Нейронних мережах
	- Використовує градієнти зворотного поширення для оновлення ваг у кожному шарі
	- Коригує ваги крок за кроком, щоб зменшити похибку прогнозування
	- Ітеративно покращує навчання, доки модель не фіксує кращі закономірності
3. Методі опорних векторів
	- Оновлює параметри моделі для зменшення втрати «hinge loss»
	- Коригує межу, якщо точки класифіковано неправильно або вони розташовані надто близько до неї
	- Повторює процес для збільшення margin і підвищення точності класифікації

#### Способи визначення гіперпараметрів нейронної мережі

Параметри нейронної мережі - це ваги і зміщення в нейронах, які оптимізуються в процесі навсання. Гіперпараметри - це параметри, які визначають сам процес навчання. Ефективний вибір гіперпараметрів дозволяє уникнути перенавчання і досягти бажаних резльтатів

Способи визначення гіперпараметрів:
1. GridSearchCV - метод грубої сили. Він проводить навчання моделі за всіма наперед заданими комбінаціями гіперпараметрів і вкінці якість навчання оцінюються крос-валідацією. В результаті обираємо той набір гіперпараметрів, який показав найкращі метрики після оцінки
2. RandomizedSearchCV - для кожного гіперпараметра генерується набір випадкових значень в певних межах. решта процесу виглядає як і в GridSearchCV
3. Баєсівська оптимізація - цей підхід розглядає процес підбору гіперпараметрів як окрему задачу оптимізації. 
	- алгоритм будує ймовірнісну модель, яка прогнозує ефективність на основі гіперпараметрів.
	- модель оновлюється після кожної оцінки.
	- Модель підбирає новий набір гіперпараметрів
	- Алгоритм Повторюється доти, доки не буде знайдено оптимальну комбінацію. 
	Функція оптиміцації може бути: 
	- Гаусівським процесом
	- випадковим лісом
  

Гаусові процеси

Регресія методом випадкового лісу

Оцінювачі Парзена з деревоподібною структурою (TPE)

#### Методи регуляризації нейронних мереж

регуляризація НМ - це процес запобігання перенавчанню і надмірному ускладненню НМ через впровадження штрафів (penalties) і допомагає досягненню кращого узагальнення в процесі навчання

Методи регуляризації
- Регресія L1 або Lasso (Least absoule shrinkage and solution operator): додає абсолютне значення величини коефіцієнта як штраф до функції втрат. Це дозволяє зменшити деякі коефіцієнти до 0 і приводить до вибору лише важливих ознак в моделях МН
	Формула:
	sum(|w_j|)*lambda
- Регресія L2 або Ridge: додає квадрат значення величини коефіцієнта як штраф до функції втрат. Це дозволяє зменшити надмірний вплив кожної окремої ознаки
	Формула:
	sum(w_j^2)*lambda
- Регресія Elastic Net: Комбінація двох попереднії методів. До функції додаються і абсолютне, і квадрат значення величини коефіцієнта. Вводиться додатковий гіперпараметр, який визначає відношення впливу регуляризації L1 та L2

#### Згорткові нейронні мережі (CNN), принципи їх роботи

Згорткові нейронні мережі - це моделі глибогого навчання, які використовуються для обробки матричних даних (таких як зображення), і є основою для сучасних застосувань комп'ютерного зору

Елементи CNN:
- Згорткові шари: застосовують згорткові операції до вхідних зображень за допомогою фільтрів або ядер для виявлення ознак
- Шари пулінгу: зменшують просторові розміри вхідних даних, знижуючи обчислювальну складність та кількість параметрів у мережі. Max pooling — це поширена операція пулінгу, під час якої обирається максимальне значення з групи сусідніх пікселів.
- функції активації: вони вводять нелінійність у модель, дозволяючи їй навчатися більш складним взаємозв’язкам у даних.
- Повністю з’єднані (компактні) шари: з’єднують кожен нейрон одного шару з кожним нейроном наступного шару.

Принцип застосування:
- Вхідне зображення: CNN отримує попередньо оброблене вхідне зображення
- Згорткові шари: До вхідного зображення застосовуються фільтри для виокремлення ознак, таких як краї, текстури та форми.
- Шари пулінгу: ознаки піддаються зменшенню розмірності.
- Компактні шари: ознаки із зменшеною роздільною здатністю проходять через компактні шари для отримання кінцевого результату, наприклад, мітки класифікації.
- Вихідні дані: CNN видає прогноз, наприклад, клас зображення.

Процес навчання
CNN навчаються за допомогою методу навчання з учителем на промаркованих зображеннях

1. Підготовка даних: Зображення для навчання попередньо обробляються, щоб забезпечити їхній однаковий формат і розмір.
2. Функція втрат: Функція втрат використовується для оцінки ефективності роботи CNN на навчальних даних. Зазвичай функція втрат обчислюється як різниця між передбаченими мітками та фактичними мітками навчальних зображень.
3. Оптимізатор: Оптимізатор використовується для оновлення ваг CNN з метою мінімізації функції втрат.
4. Зворотне поширення: Зворотне поширення — обчислення градієнтів функції втрат відносно ваг CNN. Потім ці градієнти використовуються для оновлення ваг CNN за допомогою оптимізатора.

Метрики оцінки CNN
1. Точність (accuracy) - відношення кількості правильно передбачених класів до всіх передбачень загалом
2. Матриця помилок (confusion matrix) - дає повну картину всіх передбачень класифікаційної моделі (в ідеальному випадку всі значення матриці мали б бути 0, окрім головної діагоналі) - дає можливість побачити, з якими саме класами модель гірше працює
3. Точність (precision) TP/TP+FP
4. відтворюваність (recall) = TP/TP+NP
5. рахунок F1 - Поєднання точності і відтворюваності 2 * presicion * recall / (presision + recall)

#### Вибір оптимізатора для навчання нейронної мережі

оптимізатор в НМ - це функція, яка перераховує значення ваг і зсувів таким чином, щоб досягти кращих результатів (оптимізувати ф-ю втрат) для наступних ітерацій навчання

Серед популярних оптимізаторів виділяють SGD, ADAM, RMSProp,Ньютонівський метод. 

Загалом оптимізатори можна класифіквати наступним чином:
- Методи нульового порядку (прямий пошук)
	- Мінімальне значення ф-ї втрат шукається сліпим ітераційним шляхом (дуже повільно)
- Методи першого порядку (градієнтний спуск, чутливий до темпу навчання)
	- SGD - стохастичний градієнтний спуск - простий і ефективний, зі сталим темпом навчання
	- ADAM (Adaptive Moment estimation) - дозволяє досягти більш ефективного процесу навчання, регулюючи параметр темпу навчання
	- RMSProp - теж регулює параметр темпу навчання, але гірше
- Методи другого порядку (використання похідних 2 порядку) (дуже швидкі в збіжності, але ресурсозатратні для великих НМ)
	- ньютонівський 
	- квазіньютонівський

Методи першого порядку загалом найбільш універсальні, причому метод ADAM найбільш оптимізований серед них

#### Багатошарові нейронні мережі

те саме, що багатошаровий перцептрон
#### Рекурентні нейронні мережі

RNN - це клас нейронних мереж, які застосовуються для обробки послідовних даних і  зберігають інформацію з попередніх кроків. Вони застосовуються для задач, де важливий контекст і порядок

Ключові елементи
- рекурентні нейрони: Рекурентні нейрони здатні «запам’ятовувати» інформацію з попередніх кроків завдяки передачі власного прихованого стану назад у систему, що дозволяє їм уловлювати часові залежності.
- Прихований стан: Усі нейрони мережі мають однакові ваги і зсуви, але вони змінюють свої стани з кожною ітерацією:
	формула обчислення нового прихованого стану
	ht​=σ(U⋅Xt​+W⋅ht−1​+B)
	σ - ф-я активації нейрона
	U, W - матриці ваг
	h - прихований стан
	B - Зсув
	Формула обчислення результату
	Y = O(Vh+C)
	O - ф-я активації
	V - ваги
	C - зсув

Принцип роботи
	На кожному часовому кроці RNN обробляють дані з фіксованою функцією активації. Ці дані мають внутрішній прихований стан, який виконує роль пам’яті, що зберігає інформацію з попередніх часових кроків. Ця пам’ять дозволяє мережі зберігати минулі знання та адаптуватися на основі нових вхідних даних.

Процес навчання
	параметри ваг вхідного нейрона, рекурентних нейронів і вихідного нейрона оновлюються за допомогою методу зворотного поширення у часі (BPTT). У методі BPTT градієнти проходять зворотне поширення через кожен часовий крок, враховуючи кожен прихований стан.
		1. Обчислюється градієнт
		2. Оновлюється кожен прихований стан
		3. Градієнт ділиться на явну і неявн частини
		4. обчислюється остаточна похідна функції втрат за матрицею ваг W
	Процес прямого і зворотнього поширення повторюжться ітеративно до виконання критерію зупинки навчання
		

Різновиди
- one-to-one
- one-to-many
- many-to-one
- many-to-many

Варіації RNN:
- Класична РНМ
- Двонаправна РНМ
- LSTM
- GRU

#### Методи оптимізації навчання нейронних мереж

- Вибір функції активації
- Вибір оптимізатора
- Вибір фуенкції втрат
- Підбір гіперпараметрів
- Регуляризація

TOPICSEPARATOR

#### Поняття графа, їх основні типи

Графи - це нелінійніструктури даних, які складаються з вузлів(вершин) і ребер, які позначають зв'язки між вузлами. На відміну від списків, у графів немає порядку елементів

Типи графів:
- за вагами
	- зважені - ребра мають вагу, представлену у числовому вигляді. Вона може позначати силу зв'язку між вершинами, або складність пересування від однієї вершини до іншої
	- Незважені
- за напрямком
	- Напрямлені - ребра мають напрямок, який позначає односторонній зв'язок між вершинами
	- ненапрямлені
- За наявністю циклів
	- Циклічний граф: граф, що містить принаймні один шлях, який починається і закінчується в одній і тій самій вершині.
	- Ациклічний граф: граф, що не містить циклів.
- За сполученістю: 
	- Зв’язний граф: між будь-якою парою вершин існує шлях. 
	- Незв’язний граф: принаймні до однієї вершини або підграфа неможливо дістатися з інших. 
	- Повний граф: кожна пара різних вершин з’єднана унікальним ребром.

Різновидом графу є Дерево, яка можна визначити як зв’язний ненапрямлений ациклічний граф. Будь-які дві вершини з’єднані рівно одним шляхом.

Види представдення графів:
- Матриця суміжності
- Список суміжності
#### Методи пошуку найкоротшого шляху у графі

Серед алгоритмів пошуку найкоротшого шляху виділяють наступні:
- BFS
	Опис: BFS — шлях до будь-якого вузла, знайдений за допомогою пошуку в ширину, є найкоротшим шляхом до цього вузла, тобто шляхом, що містить найменшу кількість ребер у незважених графах. У BFS спочатку обходяться всі вузли, відстань до яких від джерела дорівнює 1, потім — вузли з відстанню 2, потім — 3 і так далі.
	Часова складність: O(V+E) (V - кількість вершин, E - кількість ребер)
- DFS
	Опис: Алгоритм DFS рекурсивно обходить сусідні вузли, доки не досягне глибини, на якій неможливі подальші дійсні рекурсивні виклики.
	Щоб DFS можна було використовувати як алгоритм пошуку найкоротшого шляху, граф має бути ациклічним, тобто ДЕРЕВОМ. Він трохи швидший за BFS в обході цілого графа, але BFS більш надійний у пошуку найкоротшого шляху, коли довжина цього шляху коротша за глибину графа
	Часова складність: O(V)
- MSBFS
	Опис: запускаємо алгоритм BFS одночасно з кількох вузлів. Коли ланцюжки BFS збігаються, ми знаходимо найкоротший шлях. Зазвичай працює краще за BFS, бо BFS уповільнюється на великій глибині шляху через зростання к-ті сусідів
	Часова складність: O(V)
- Алгоритм Дейкстри
	Опис: знаходить найкоротший шлях від вихідного вузла до всіх інших вузлів у зваженому графі шляхом ітеративного вибору вузла з найменшою попередньою відстанню та оновлення відстаней до його сусідів.
	Часова складність: O(E*log(V))
- A* 
	Опис: Алгоритм пошуку A* є одним із найкращих і найпопулярніших методів, що використовуються для пошуку шляхів та обходу графів.
	Варто також зазначити, що багато ігор та веб-карт використовують цей алгоритм для дуже ефективного пошуку наближеного найкоротшого шляху
	Часова складність: O(E*log(V))


#### Поняття дерева, його застосування для побудови алгоритмів

Дерево — це нелінійна структура даних, у якій сукупність елементів, що називаються вузлами, з’єднана між собою ребрами таким чином, що між будь-якими двома вузлами існує рівно один шлях.

Дерево - це зв'язний ненапрямлений ациклічний граф

Ключові поняття:
- кореневий вузол
- Внутрішній вузол
- листкові вузли
- батьківський вузол
- дитячий вузол
- предок
- нащадок
- Рівень вузла
- Піддерево

Види дерев:
- бінарні
- тернарні
- n-арні

Застосування
- бінаоні дерева пошуку - структура даних, в якій вершини впорядковані таким чином, щоб дивлячись на графічне представлення дерева вершини були впорядковані по зростанню зліва направо. Використовуються для швидкого рекурсивного пошуку
- купи (heaps) - дерево, в якому кожен батьківський вузол має значення більше або рівне (для max heap) за значення його дітей. Така структура даних дозволяє надзвичайно швидко знаходити найбільший (або найменший) елемент з набору даних
- B-дерево - структра, яка мінімізує глибину дерева для швидкого доступу до вузлів. застосовується для індексації в базах даних
- Tries - структура для ефективного збереження набору стрічок


#### Алгоритм Дейкстри для пошуку найкоротших шляхів

Опис: знаходить найкоротший шлях від вихідного вузла до всіх інших вузлів у зваженому графі шляхом ітеративного вибору вузла з найменшою попередньою відстанню та оновлення відстаней до його сусідів.

Алгоритм застосовує структуру даних minheap - пріоритетну чергу для швидкого отримання найменшого значення з набору даних

Часова складність: O(E*log(V))

Порядок виконання:
1. Створюємо масив відстаней dist[] і ініціюємо його значеннями нескінченності для всіх вузлів.
2. змінюємо значення відстані для початкового вузла на 0 в масиві dist[]. Далі додаємо значення відстані і назву вузла в купу
3. витягаємо верхнє значення з купи. Проходимося по всіх сусідах вузла і порівнюємо значення відстані в dist[] зі значенням відстані витягненеого елемента + вага ребра до сусіда. Якщо 2-га відстань менша, оновлюємо значення відстані в dist[] і додаємо цього сусіда в купу
4. Повторюємо кроки 2-3, поки не закінчаться елементи в купі
5. В результаті отримуємо масив dist[], в якому всі значення відповідають найменшим відстаням до кожної вершини

В процесі виконання алгоритму можна записувати не тільки відстані між вершинами, а й найкоротші шляхи від початкової вершини до всіх інших
#### Алгоритми пошуку в глибину та ширину в графах

- BFS
	Опис: Пошук у ширину (BFS) — це алгоритм обходу графа, який починається з вихідного вузла й досліджує граф рівень за рівнем. Спочатку він обходить усі вузли, безпосередньо суміжні з вихідним. Потім він переходить до обходу суміжних вузлів цих вузлів, і цей процес триває, доки не будуть обійдені всі доступні вузли. Для цього використовується масив відвіданих вершин, і черга вершин

	шлях до будь-якого вузла, знайдений за допомогою пошуку в ширину, є найкоротшим шляхом до цього вузла

	Різновидом BFS є MSBFS, який починається одночасно в кільох вершинах для пошуку найкоротшого шляху між ними
	
	Часова складність: O(V+E) (V - кількість вершин, E - кількість ребер)
- DFS
	Опис: Алгоритм DFS рекурсивно обходить сусідні вузли, доки не досягне глибини, на якій неможливі подальші дійсні рекурсивні виклики.
	Щоб DFS можна було використовувати як алгоритм пошуку найкоротшого шляху, граф має бути ациклічним, тобто ДЕРЕВОМ. Він трохи швидший за BFS в обході цілого графа, але BFS більш надійний у пошуку найкоротшого шляху, коли довжина цього шляху коротша за глибину графа

	Часова складність: O(V)

#### Поняття оптимізації маршруту, застосування графів для вирішення цієї задачі

Оптимізація маршруту — це процес пошуку найефективнішого шляху між двома або більше точками. «Ефективність» визначається шляхом мінімізації певної функції втрат, якою може бути відстань, час, витрата палива або грошові витрати, з урахуванням реальних обмежень (наприклад, дорожнього руху, обмежень пропускної здатності, часових рамок доставки).

Графи застосовуються для моделювання задачі оптимізації маршруту, де:
- вершини - це точки, між якими прокладається маршрут
- ребра - це шляхи, якими можна добиратися до вершин
- ваги - це 'вартість' пересування по ребрі (відстань, час, грошові витрати) 

Після побудови моделі, можна застосовувати різні алгоритми пошуку оптимального шляху, серед них:
- Алгоритм Дейкстри - пошук найкоротших шляхів від однієї вершини до всіх інших у зваженому графі
- Алгоритм Флойда-Уоршелла - знаходить найкоротші шляхи між усіма парами вузлів
- Алгоритм Беллмана — Форда - розширена версія алгоритму Дейстри, яка допускає наявність від'ємних ваг
- Алгоритм A* - оптимізована версія алгоритму Дейстри, що швидко знаходить найкоротшу відстань між двома точками

#### Алгоритм Флойда-Уоршелла для знаходження всіх пар найкоротших шляхів

Алгоритм Флойда-Уоршелла - це алгоритм пошуку найкоротшого шляху у графі, резульатом якого є матриця найкоротших відстаней між вершинами графа

Алгоритм працює як для направлених, так і для ненаправлених зважених графів. Він працює з відємними вагами за умови відсутності від'ємних циклів

Складність алгоритму - O(V^3)

Послідовність виконання:
1. Генеруємо матрицю відстаней, в якій суміжні вершини позначені значенням ваги ребра між ними, головна діагональ заповнена нулями, а вершини, які не сполучені ребром, позначені відстанню INF
2. Переходимо до вершини k. Розглядаємо її як проміжну для всіх інших пар вершин
3. Для кожної пари (i, j) вершин у матриці відповідно існують два можливі випадки.
	- k не є проміжною вершиною на найкоротшому шляху від i до j. Ми залишаємо значення dist[i][j] без змін.
	- k є проміжною вершиною на найкоротшому шляху від i до j. Ми оновлюємо значення dist[i][j] як dist[i][k] + dist[k][j], якщо dist[i][j] > dist[i][k] + dist[k][j]
4. Повторюємо цей процес для кожної вершини k, доки не будуть розглянуті всі можливі проміжні вершини.

#### Поняття розфарбування графів, його застосування

Розфарбування графів - це задача, яка полягає в тому, щоб розфарбувати граф мінімальної кількістю кольорів таким чином, щоб жодна суміжна пара вершин не була розфарбована однаковим кольором

Мінімальна кількість кольорів для розфарбування графа називається chromatic number

Алгоритми пошуку chromatic number для графа включають
- Greedy - складність O(E + V)
	Упорядкування вершин: Вершини сортуються у певну послідовність.
	Присвоєння кольорів: Алгоритм послідовно обходить впорядковані вершини. Для поточної вершини він сканує кольори, вже присвоєні її суміжним сусідам
	Стратегія вибору: Присвоюється колір із найнижчим індексом (наприклад, колір 1, потім колір 2), якого наразі немає серед суміжних сусідів.
- Backtracking складність O(m^V)
	Алгоритм намагається по черзі зафарбовувати вершини за допомогою рекурсивної функції. 
	Перш ніж остаточно присвоїти колір $c$ вершині $v$, обмежувальна функція перевіряє, чи не має якась із сусідніх вершин уже колір $c$. 
	Якщо колір $c$ порушує обмеження сусідства, алгоритм переходить до наступного доступного кольору. Якщо для поточної вершини немає жодного доступного кольору, що відповідає обмеженням, алгоритм відкидає поточний шлях, повертається до попередньо забарвленої вершини та намагається змінити її колір.

Застосування задачі розфарбування графів:
- Планування та складання розкладів: розподіл часових інтервалів між подіями (наприклад, університетськими іспитами чи рейсами).
- Розподіл регістрів у компіляторах: оптимізація розміщення програмних змінних у обмеженій кількості фізичних регістрів процесора.
- Розподіл частот: призначення радіочастот або частот стільникового зв’язку передавачам.
- Розфарбовування карт
- Судоку

#### Методи обчислення найменшого остового лісу графа

Опорне дерево графра - це структура, яка містить усі вершини графа, але вводть додаткові обмеження, які дозволяють йому стати деревом(зв'язність, ненаправленість, ациклічність)

Найменше опорне дерево - це таке опорне дерево, в якому сума ваг всіх ребер є мінімальною

Алгоритми пошуку найменшого опорного дерева:
- Алгоритм мінімального опорного дерева Крускала (greedy алгоритм)
	Це один із найпопулярніших алгоритмів для пошуку мінімального опорного дерева у зв’язному неорієнтованому графі. Алгоритм працює наступним чином:
	1. Спочатку він сортує всі ребра графа за їхніми вагами,
	2. потім починає ітерації пошуку опорного дерева.
	3. На кожній ітерації алгоритм по черзі додає ребро з наступною найменшою вагою, при цьому ребра, обрані до цього моменту, не повинні утворювати циклу.
	Цей алгоритм використовує DSU (Disjoint-Set) для відстеження зв’язних компонент графа
- Алгоритм мінімального опорного дерева (MST) Прима: (greedy алгоритм)
	1. Спочатку вибирається довільна вершина, яка додається до MST.
	2. Потім алгоритм повторно перевіряє, яка вага ребра, що з’єднує одну вершину MST з іншою вершиною, яка ще не входить до MST, є мінімальною.
	3. Цей процес триває, доки всі вершини не будуть включені до MST.
	
	цей алгоритм використовує (priority_queue) для зберігання вершин, відсортованих за їхньою поточною мінімальною вагою ребра.
- Алгоритм мінімального опорного дерева Борувки:
	Це один із найстаріших алгоритмів. Алгоритм працює шляхом ітеративного побудови мінімального опорного дерева:	
	1. Ініціалізуємо ліс дерев, де кожна вершина графа є окремим деревом
	2. Для кожного дерева в лісі:
		1. Знаходимо найдешевшу ребро, що з’єднує його з іншим деревом. Додаємо ці ребра до мінімального опорного дерева.
		2. Оновлюємо ліс, об’єднуючи дерева, з’єднані доданими ребрами.
	3. Повторювати вищезазначені кроки, доки ліс не міститиме лише одне дерево, яке і є мінімальним опорним деревом.
	цей алгоритм використовує (priority_queue) для зберігання вершин, відсортованих за їхньою поточною мінімальною вагою ребра.

#### Комбінаторні задачі, їх вирішення за допомогою теорії графів

Комбінаторні задачі полягають у пошуку оптимального значення серед скінченної дискретної множини розв'язків.

Відомі комбінаторіні задачі, з вирішенням з теорії графів включають:
- Розфарбовування графів: присвоєння міток вершинам таким чином, щоб жодні сусідні вершини не мали однакових міток.
- Мінімальне опорне дерево (MST): з’єднання всіх вершин в неорієнтованому графі з мінімальною сумарною вагою ребер без утворення циклів. (Крускал, Прим)
- Задача комівояжера (TSP): Визначення найкоротшого маршруту, який проходить через кожну вершину рівно один раз і повертається до початку. Розраховується на повних, зважених графах. (пошук циклу Гамільтона мінімальної ваги, розв'язується шляхом пошуку мінімальної ваги кожної перестановки вершин)
- Задача китайського листоноші: Пошук найкоротшого замкнутого шляху, який проходить по кожному ребру графа принаймні один раз. Розв’язується за допомогою евклідових контурів.
- Задача найкоротшого шляху: Обчислення шляху з мінімальною сумою ваг ребер між двома вершинами. (Дейкстра, Флойд-Воршелл, A*, Беллман-Форд)


TOPICSEPARATOR

#### Імітаційне моделювання, його основні переваги

Імітаційне Моделювання — це процес створення моделі реальної системи з метою вивчення її поведінки та прогнозування результатів. Воно дозволяє аналізувати складні системи без проведення безпосередніх експериментів, які можуть бути дорогими або недоцільними. 

моделювання передбачає:
- Моделювання реальних процесів, таких як потік клієнтів та продуктивність системи
- Генерування та аналіз різних вхідних умов для спостереження за поведінкою системи

Типи імітаційного моделювання
Моделі імітаційного моделювання можна узагальнено класифікувати за наявністю випадковості.
- Детермінована модель: дає однаковий результат для заданих вхідних даних (без випадковості). Наприклад: розрахунок загальної вартості товарів у кошику
- Стохастична модель: передбачає випадковість і може давати різні результати. Наприклад: підкидання монети або моделювання прибуття клієнтів

Принцип роботи (на прикладі імітаційної моделі піцерії)
1. Реальна система: Починаємо з реальної піцерії (клієнти, замовлення, працівники).
2. Концептуальна модель: Спрощує систему, визначаючи, як прибувають клієнти, як готують піцу та як працює персонал.
3. Програма моделювання: Перетворення моделі на програму на Python для моделювання процесу
4. Верифікація: Перевірка правильності роботи програми.
5. Валідація: Порівняння результатів із реальним поведінкою для забезпечення точності.

Одним із широко використовуваних методів є імітаційне моделювання методом Монте-Карло.

Моделювання методом Монте-Карло — це математичний метод, що використовується для оцінки ймовірності різних результатів шляхом багаторазового запуску моделі з використанням випадкових значень (випадкова вибірка).

Наприклад, Клієнти приходять у різний час, тому для відображення цього використовуються випадкові значення
Це допомагає оцінити, скільки співробітників потрібно

Переваги
- Знижує витрати на експерименти в реальних умовах
- Дозволяє працювати зі складними та динамічними системами
- Дає змогу тестувати різні сценарії
- Підвищує точність прийняття рішень
- Надає візуальні та аналітичні висновки

Недоліки
- Результати залежать від точності моделі
- Може вимагати значних обчислювальних ресурсів
- Вимагає наявності відповідних даних та правильних припущень
- Може надмірно спрощувати реальні системи

Застосування
- Оптимізація бізнес-процесів
- Виробничі та логістичні системи
- Моделювання систем охорони здоров’я
- Аналіз фінансових ризиків
- Моделювання мереж та трафіку
- Обслуговування клієнтів та управління чергами
#### Програмна реалізація методів імітаційного моделювання

1. Agent-Based Modeling (ABM)
	Агентне моделювання — це клас обчислювальних моделей, що відтворюють поведінку автономних агентів, таких як люди, тварини, транспортні засоби, організації чи навіть клітини. Кожен агент діє відповідно до певного набору правил і взаємодіє з іншими агентами та навколишнім середовищем, а модель відстежує, як ці локальні взаємодії формують глобальні закономірності.
(Симуляція поширення хвороби через ООП)
	
2. Monte Carlo Simulation
	Принцип роботи:
	1. Визначення проблеми яку потрібно змоделювати. Це може бути що завгодно — від цін на акції до інженерних моделей.
	2. Моделювання вхідних даних Обирається відповідний розподіл ймовірності (наприклад, нормальний) і генеруються набори даних, які представляють невизначені фактори системи
	3. Запуск симуляцій: Генерація даних і процес моделювання повторюється багато разів (часто тисячі або мільйони разів)
	4. Аналіз результатів: Після завершення симуляцій ми отримаємо розподіл можливих результатів. Аналізуючи ці дані, можна приймати обґрунтовані рішення, спираючись на діапазон імовірних сценаріїв

(Пошук числа Пі)

#### Типи моделей в імітаційному моделюванні

Типи імітаційного моделювання
Моделі імітаційного моделювання можна узагальнено класифікувати за наявністю випадковості.
- Детермінована модель: дає однаковий результат для заданих вхідних даних (без випадковості). Наприклад: розрахунок загальної вартості товарів у кошику, моделювання на основі агентів (поширення хвороби)
- Стохастична модель: передбачає випадковість і може давати різні результати. Наприклад: підкидання монети або моделювання прибуття клієнтів, методи Монте Карло (визначення числа Пі)


#### Стохастичне імітаційне моделювання

Те саме, що типи імітаційного моделювання, але з акцентом на метод Монте Карло

#### Методи генерування випадкових чисел в імітаційному моделюванні

Методи імітаційного моделювання використовують для симуляції складних систем з елементом невизначеності для передбачення їхньої поведінки або розуміння їхньої природи. 

Такі методи (наприклад, метод Монте-Карло), покладаються на генерацію випадкових чисел для симуляції складних процесів (флуктуації цін на ринку, час прибуття клієнтів і т.д)

В програмній реалізації імітаційних методів використовують псевдовипадкові числа

1. Псевдовипадкові генератори чисел (PRNG) за своєю суттю генерують послідовності рівномірно розподілених цілих чисел, які потім масштабуються до значень в інтервалі $[0, 1)$. 
2. Вихор Мерсенна (Mersenne Twister): сучасний алгоритм, що використовується за замовчуванням у більшості мов програмування (зокрема в Python). Він забезпечує і рівномірний розподіл у просторах високої розмірності. 
3. Початкове значення (seed). Оскільки PRNG є детермінованими, їм потрібен початковий стан, відомий як «seed» (або початкове значення, $X_0$). Ініціалізація моделі з однаковим початковим значенням гарантує отримання ідентичної послідовності «випадкових» чисел. Така відтворюваність є математично необхідною в імітаційному моделюванні для ізоляції змінних, налагодження та порівняння різних стратегій втручання за однакових стохастичних умов.

Також використовують різні розподіли випадкових величин (норальний, поліноміальний, пуассона, заданий CDF або КФР і т.д, в залежності від специфіки системи: прибуття клієнтів - НР, точки в колі - уніформ розподіл)

Загалом для імтаційних методів використовують інверсію CDF

#### Основні кроки при розробці програми для імітаційного моделювання

Розробка програми імітаційного моделювання —  це процес, який сильно залежить від специфіки реальної системи, яка моделюється, і потребує особливої уваги до валідації і верифікації результатів.

Розглянемо процес розробки програми на прикладі моделювання піцерії

Принцип роботи (на прикладі імітаційної моделі піцерії)
1. Реальна система: Починаємо з реальної піцерії (клієнти, замовлення, працівники).
2. Концептуальна модель: Спрощує систему, визначаючи, як прибувають клієнти, як готують піцу та як працює персонал.
	- визначення цілей
	- визначення компонентів і параметрів
	- математичне формулювання (закон розподілу часу прибуття клієнтів)

3. Програма моделювання: Перетворення моделі на програму на Python для моделювання процесу
	- вибір моделі (або парадигми): монте карло, на основі агентів, дискретне імітаційне
	- реалізація генерації ПВЧ
	- побудова логіки

4. Верифікація: Перевірка правильності роботи програми.
	- детерміноване таестування
	- стохастичне тестування

5. Валідація: Порівняння результатів із реальним поведінкою для забезпечення точності.
	- історичний аналіз
	- тестування на різних наборах параметрів

6. Експериментування та аналіз - запуск системи для виконання поставлених цілей і оцінка точності

#### Особливості методів Монте-Карло та їх застосування в імітаційному моделюванні

Метод Монте-Карло - це метод імімтаційного моделювання, в якому на основі генерації великих наборів випадкових чисел симулюються системи з елементом невизначеності, і який використовується для передбачення поведінки складних систем

Принцип роботи:
1. Визначення проблеми яку потрібно змоделювати. Це може бути що завгодно — від цін на акції до інженерних моделей.
2. Моделювання вхідних даних Обирається відповідний розподіл ймовірності (наприклад, нормальний) і генеруються набори даних, які представляють невизначені фактори системи
3. Запуск симуляцій: Генерація даних і процес моделювання повторюється багато разів (часто тисячі або мільйони разів)
4. Аналіз результатів: Після завершення симуляцій ми отримаємо розподіл можливих результатів. Аналізуючи ці дані, можна приймати обґрунтовані рішення, спираючись на діапазон імовірних сценаріїв

Приклад: визначення числа Пі

Особливості:
- велика кількість симуляцій
- Велика кількість способів застосування
- Різні способи інтерпретації результатів

Сфери застосування
- Фінанси, визначення ризиків
- Складні математичні задачі
- Оптиміцація гіперпараметрів у МН
- Елемент пошуку новизни в навчанні з підкріпленням



#### Переваги і недоліки методів імітаційного моделювання в порівнянні з іншими методами моделювання

Моделі імітаційного моделювання в основному порівнюють з моделями аналітичного (чи математичного) моделювання

Аналітичні моделі використовують рівняння (наприклад, із математичного аналізу чи алгебри) для отримання точних рішень, тоді як імітаційні моделі відтворюють поведінку системи в часі для стохастичного оцінювання результатів.

Переваги імітаційного моделювання
- Дозволяє моделювати надзвичайно складні, нелінійні та динамічні системи, для яких аналітичні розв’язки (точні рівняння) є математично неможливими або не мають замкнутих форм.
- Менше спрощувальних припущень, відповідно, краща відповідність реальній системі
- Дозволяє виявляти емерджентні властивості системи, які не були передбачені в розробці імітаційної моделі
- Гнучкість в підборі параметрів
- Дає можливість отримувати візуалізацію результатів і поведінки системи 

Недоліки імітаційного моделювання
- Високі обчислювальні витрати, особливо для моделей, які точно імітують реальні системи
- аналітичне моделювання зазвичай дає точні, оптимальні рішення, а імітаційне - лише наближені (визначення числа Пі)
- Ілюзія точності: Можливість візуалізації систем може створювати помилкову впевненість у точності імітаційної моделі

#### Реалізація верифікації результатів імітаційного моделювання

перевірка результатів роботи моделей імітаційного моделювання ділиться на 2 етапи:
- Внтрішня відповідність (Верифікація) - перевірка чи програмна реалізація відповідає концептуальній моделі
	- покрокове відстеження окремого об’єкта в усій системі для перевірки логічних переходів між станами.
	- Детерміноване тестування: фіксація всіх випадкових величин на постійних значеннях
	- Граничне тестування: введення екстремальних або неприпустимих значень для виявлення логічних помилок, нескінченних циклів
	- візуальні перевірки: спостереження за графічним відображенням для виявлення очевидних аномалій 
	
- Зовнішня точність (Валідація) - перевірка, чи результати модеді коректно відображають поведінку реальної системи
	- Порівняння з історичними даними: введення історичних початкових умов і використання статистичних тестів (наприклад, t-критерію, ANOVA) для перевірки того, чи відповідають результати моделювання відомим історичним показникам.
	- Аналіз чутливості: варіювання параметрів для перевірки того, чи узгоджуються величина та напрямок змін вихідних даних із очікуваною динамікою реальної системи.
	- Експертний тест Тюрінга: представлення результатів моделювання разом із даними реальної системи профільним експертам. Якщо експерти не можуть відрізнити змодельовані дані від реальних, модель має високий рівень зовнішньої обґрунтованості (face validity).
	- Прогностична валідація: запуск моделі для прогнозування майбутнього стану, очікування настання відповідної події в реальному світі та порівняння змодельованого прогнозу з фактичним результатом.

#### Програмні інструменти для імітаційного моделювання

1. **AnyLogic** (top commercial)

* **Парадигма:** Мультипарадигмальна (ABM agent based modelling, DES discrete event simulation, SD system dinamics).

* **Статус:** Домінуючий комерційний стандарт для корпоративного та промислового моделювання.

* **Ключова особливість:** Використовує графічний інтерфейс типу «перетягни та кинь», але дозволяє писати базову логіку на Java.


1. **NetLogo** (top open-source)

* **Парадигма:** Агентне моделювання (ABM).

* **Статус:** Основний стандарт з відкритим кодом для академічних досліджень, біологічного моделювання та соціальних наук.

* **Ключова особливість:** Використовує дуже доступну, спеціалізовану мову програмування (діалект Logo), спеціально пристосовану для взаємодії агентів.


1. **SimPy** (top framework)

* **Парадигма:** Моделювання дискретних подій (DES).

* **Статус:** Стандарт програмного моделювання в екосистемі науки про дані.

* **Ключова особливість:** Чистий фреймворк на Python. Не має графічного інтерфейсу, але нативно інтегрується зі стандартними конвеєрами аналізу даних Python (наприклад, Pandas, NumPy).

TOPICSEPARATOR

#### Поняття математичного моделювання і його використання

Математичне моделювання — це процес представлення реальних задач або систем у математичних термінах. Воно передбачає визначення змінних, рівнянь та обмежень для моделювання або прогнозування поведінки складних систем. Ці моделі можна використовувати для моделювання, аналізу та прогнозування поведінки складних систем.

У науці про дані математичні моделі використовуються для таких завдань, як регресійний аналіз, класифікація, кластеризація, оптимізація тощо.

Етапи виконання математичного моделювання в Python:
1. Формулювання задачі: Чітко визначте задачу, яку потрібно змоделювати. Визначте відповідні змінні, параметри та взаємозв’язки, що беруть участь у процесі.
2. Формулювання моделі: перетворення реальної задачі на математичні рівняння. Тип моделі, який ви оберете, залежатиме від характеру задачі. До поширених типів моделей належать:
	- Лінійні моделі: використовуються для задач, у яких взаємозв’язок між змінними є лінійним.
	- Нелінійні моделі: використовуються для задач із нелінійними взаємозв’язками.
	- Диференціальні рівняння: використовуються для моделювання динамічних систем, що змінюються з часом.
	- Стохастичні моделі: використовуються для систем, що містять випадковість або невизначеність.
3. Реалізація: Реалізуйте математичну модель у середовищі програмування. Цей крок передбачає написання коду для представлення рівнянь та їх чисельного розв’язання.
4. Валідація та аналіз: Проведіть валідацію моделі, порівнявши її прогнози з реальними даними або результатами експериментів. Проаналізуйте поведінку моделі за різних умов та параметрів.


Застосування математичного моделювання в науці про дані
- Прогностична аналітика: часові ряди, фінансова сфера

- Оптимізація: логістика, виробництво

- Класифікація: медицина, маркетинг

- Кластеризація: сегментація клієнтів, аналіз зображень та біоінформатика.

- Моделювання: епідеміологія, інженерія та економіка.

#### Загальна постановка та класифікація задач математичного програмування, поняття складності алгоритмів

Постановка задачі математичного програмування

Задача математичного програмування (оптимізації) полягає у пошуку оптимальних значень для набору змінних, які мінімізують або максимізують цільову функцію за умови дотримання певних обмежень.

Тобто, в загальному випадку у розв'язок задачі МП виглядає так:
min(f(x)), x є X, де
	x - вектор змінних
	X - множина значень змінних
	f(x) - ф-я, яку оптимізовують
	Обмеження нерівності
	Обмеження рівності

Класифікація задач математичного програмування
- Лінійне програмування - ф-я оптимізації підпорядковується строго лінійні залежності
- Нелінійне програмування - цільова ф-я фбо принаймні одне з обмежень місять нелінійну залежність
- Стохастичне програмування - наявність невизначених або випадкових параметрів, представлені розподілами ймовірностей
- Цілочисельне програмування - усі змінні x є дискретними цілими числами
- Опукле програмування - цільова ф-я є опуклою. в такому випадку будь-який локальний оптимум - це також глобальний оптимуум

Складність алгоритмів
1. Нотація Big O
	O(1) - константна складність (операція додавання)
	O(ln n) - логарифмічна складність (бінарний пошук)
	O(n) - лінійна складність (цикл операцій зі складністю O(1) з n витків)
	O(n^2) - вбудований цикл
	O(2^n) - пошук n-го числа Фібоначчі рекурсивно без оптимізацій (замап'ятовування, динамічне програмування)
	
2. Класи складності
	- Клас P - ті, які можна розв'язати за поліноміальний час 
	    Клас P — це, як правило, сукупність обчислювальних задач, які є розв’язуваними та ефективно розв’язуваними (трактабельними). ​​Термін «ефективно розв’язувані» означає, що задачі можна розв’язати як теоретично, так і на практиці. Натомість задачі, які можна розв’язати теоретично, але неможливо — на практиці, називають неефективно розв’язуваними (інтрактабельними).
	    - merge sort
	    - Пошук НСД
	- Клас NP (Non-deterministic Polynomial Time)
		Це сукупність задач прийняття рішень, які можуть бути вирішені недетермінованою машиною (зауважте, що наші комп’ютери є детермінованими) за поліноміальний час.
		Розв’язки задач класу NP може бути важко знайти, оскільки їх вирішує недетермінована машина, але ці розв’язки легко перевірити.
		- розфарбовування графу
		- Пошук Гамільтонівського шляху в графі
	- NP-складна
		NP-важка задача є принаймні такою ж важкою, як найважча задача в NP, Їх перевірка займає багато часу. Це означає, що якщо надано рішення NP-важкої задачі, то перевірка його правильності займає багато часу.
		- Відсутність гамільтонового циклу.
	- NP-повна
		Задача є NP-повною, якщо вона одночасно належить класу NP і є NP-складною.
		NP-повні задачі є особливими, оскільки будь-яку задачу з класу NP можна перетворити або звести до NP-повної задачі за поліноміальний час.
		- Гамільтонів цикл.
		
![[Pasted image 20260824112930.png]]

#### Типи математичних моделей, відмінності між ними

математичні моделі класифікують за такими ознаками:
1. Визначеність
	- детерміновані - Результати детерміновані і повністю визначені вхідними параметрами, і повторюються за повторення умов (Закон планетарного руху)
	- стохастичні - з елементом невизначеності або випадковості (Флуктуації цін на ринку)
2. Залежність від часу
	- статичні - незалежні від часу (аналіз стуктурного навантаження)
	- динамічні - змінні з часом (моделі росту популяції)
3. Типи змін станів (лише для динамічних)
	- Дискретні - скіненна кількість станів моделі в дискретні моменти часу (game of life)
	- Неперервні - Змінні набувають будь-якого значення в обмеженому проміжку (динаміка рідин)
4. Пропорційність
	- Лінійні - результат пропорційний до параметрів. Складні задачі можна декомпозувати на прості складники (закон Гука)
	- Нелінійні - наявність сладних взаємопов'язяних мехенізмів. Такі завдання складно розв'язати аналітично (Подвійний маятник)
5. Джерело інформації
	- механістичні - з чітко визначеними і зрозумілими законами внутрішньої взаємодії (фундаментальні закони фізики)
	- емпіричні - будуються виключно на основі спостережуваних даних без намагання пояснити природу внутрішньої взаємодії системи
#### Теорія ігор, галузі її застосування

Теорія ігор — це галузь математики та економіки, що вивчає стратегічну взаємодію між раціональними суб'єктами, які приймають рішення. Вона визначає формальний підхід до оцінювання ситуацій, у яких результат рішення окремої особи залежить від рішень інших.

Також Теорія ігор - це тематика задач спортивного програмування, які передбачають постановку умови у вигляді гри, де змагаються 2 або більше учасників, і в якій прописані чіткі і зрозумілі правила, зазвичай без випадкових елементів і з почерговими діями гравців. Завдання таких задач зводиться у передбачені переможця або пошуку оптимальної стратегії гри

Галузі застосування:
- Комп'ютерні науки та розробка алгоритмів (маршрутизація комп'ютерних мереж, розподіл хмарних ресурсів)
- Економіка та бізнес (Динамічне ціноутворення в електронній комерціЇ, Цінове лідерство на олігопольних ринках (Лідер ринку утворює ціну з розрахунку собівартості, інші відповідають))
- Дизайн комп'ютерних систем (Керування перевантаженням у мережевих системах)
- Політика та міжнародні відносини (Торговельні переговори, переговори щодо контролю над озброєннями)
- Аукціони (англійськіб Вікрі (приватні))


#### Застосування теорії ігор для вирішення конфліктних ситуацій

1. Визначення рівноваги Неша
	Основним методом математичного вирішення конфліктів є знаходження рівноваги Неша.
	- Механізм: він визначає стан, у якому жоден гравець не може збільшити свою вигоду шляхом односторонньої зміни своєї стратегії, за умови, що всі інші гравці залишають свої стратегії незмінними.
	- Вирішення: Воно дозволяє передбачити найбільш ймовірний стабільний результат конфлікту. Навіть якщо це не є глобально оптимальним результатом (як це видно на прикладі «Дилеми в’язня»), воно представляє раціональну точку зупинки, де досягається взаємне стримування.

	Рівновага Неша - це не завжди оптимальний варіант (дилема в'язня)

2. Зміна структури гри (Проектування механізмів)
	Якщо природна рівновага конфлікту є деструктивною (сценарій, у якому всі програють), теорія ігор застосовується у зворотному напрямку — у вигляді проектування механізмів — для зміни правил з метою примусу до кооперативного вирішення.
	- Зміна виграшів: Введення зовнішніх штрафних санкцій (штрафів, санкцій) або винагород (субсидій) для математичної зміни матриці виграшів, що зміщує рівновагу Неша в бік співпраці.
	- Впровадження ітерації: Одноразовий конфлікт часто призводить до зради. Якщо взаємодія повторюється нескінченно (ітераційна дилема в’язня), такі стратегії, як «око за око», математично доводять, що співпраця стає домінуючою, самореалізуючою стратегією завдяки «тіні майбутнього».

3. Теорія кооперативних ігор (Формування коаліцій)
	- Механізм: зосереджується на тому, як гравці можуть утворювати коаліції для створення прибутку, та як цей прибуток слід справедливо розподілити, щоб забезпечити стабільність коаліції.
	- Значення Шеплі: конкретна математична формула, що використовується для розподілу вигод під час вирішення конфлікту на основі точного граничного внеску кожного гравця, що забезпечує справедливе врегулювання.

#### Основні поняття в теорії ігор (ігри з нульовою сумою, стратегічні ігри)

Основні терміни теорії ігор
- Гравці: Зазвичай у грі беруть участь два гравці. Наприклад, гравець А та гравець Б, або компанія А та компанія Б.

- Стратегії: Стратегія — це курс дій, який обирає гравець; наприклад, компанія може застосовувати різні стратегії для збільшення обсягів продажів. Як правило, у теорії ігор розрізняють дві стратегії: перша — чиста стратегія, друга — змішана стратегія. Якщо компанія обирає лише одну конкретну стратегію, відкидаючи решту, то це називається чистою стратегією. Якщо гравець дотримується більше ніж однієї стратегії, то кажуть, що він дотримується змішаної стратегії

- Матриця виплат: Приклад матриці виплат наведено нижче. Є два гравці, гравець А та гравець В, кожен з яких має три стратегії, а саме 1, 2 та 3. Внутрішні значення в матриці — це результати різних комбінацій. Якщо гравець А обирає 3-ю стратегію, а гравець Б — 1-шу, то результат становитиме 35; якщо гравець А обирає 2-гу стратегію, а гравець Б також обирає 2-гу стратегію, то результат становитиме 15. Якщо результат є додатним, то це виграш для гравця А і втрата для гравця В. Якщо результат є від’ємним, то це втрата для гравця А і виграш для гравця В. Розглянемо наведену нижче матрицю виплат: якщо результат становить -25, то гравець А втрачає 25 очок, а гравець В отримує 25 очок.

- Принцип maximin: максимізує мінімальні гарантовані виграші.

- Принцип minimax: мінімізує максимальні втрати.

- Точка сідла: гра матиме точку сідла, якщо значення максіміна та значення мінімакса рівні, тобто точка перетину буде рівною. Якщо в грі немає точки сідла, то кажуть, що гра має змішану стратегію.

- значення гри: якщо гра має точку сідла, то результат у клітинці в точці сідла називається значенням гри.

- Двоособова гра з нульовою сумою: У змагальній грі з двома гравцями, якщо виграш одного гравця дорівнює втраті іншого гравця, така гра називається двоосібною грою з нульовою сумою. Для кращого розуміння дивіться наведену вище матрицю виплат: якщо результат гри становить 40, то це виграш для гравця А, але втрата для гравця Б, а якщо результат становить -25, то це втрата для гравця А, але виграш для гравця Б.

- Ігри з ненульовою сумою: Ігри, в яких існує результат, коли сума виплат гравцям не рівна нулю. Вони передбачають співпрацю для спільної вигоди або рівновагу Неша у спільній втраті

- Рівновага Неша - концепт, який визначає стан, у якому жоден гравець не може збільшити свою вигоду шляхом односторонньої зміни своєї стратегії, за умови, що всі інші гравці залишають свої стратегії незмінними.

- Домінанатна стратегія: стратегія, яка гарантує отримання максимальної виплати незалежно від вибору стратегії інших гравців (Задачі пошуку домінінтної стратегії часто зустрічаються в спортивному програмуванні)

#### Методи визначення оптимальних стратегій в грі за допомогою теорії ігор
Визначення оптимальних стратегій у теорії ігор залежить від топології гри (одночасна чи послідовна) та від того, чи є взаємодія нульовою сумою чи не нульовою сумою.

1. Ітеративне виключення домінованих стратегій
	Застосовується в одночасних іграх у нормальній формі для зменшення простору стратегій.
	* **Механізм:** Стратегія є «строго домінованою», якщо інша стратегія завжди дає вищий виграш, незалежно від вибору супротивника.
	* **Реалізація:** Раціональні гравці ніколи не обиратимуть доміновану стратегію. Алгоритм ітеративно видаляє доміновані рядки та стовпці з матриці виграшів, доки не залишаться лише оптимальні, не доміновані стратегії.
	* Приклад: дилема в'язня
2. Метод мінімакс (або максімін)
	Базовий алгоритм для двосторонніх ігор з нульовою сумою.
	* **Механізм:** Працює на основі припущення про найгірші сценарії. Гравець оцінює мінімальну можливу виграшну суму для кожної зі своїх доступних стратегій.
	* **Реалізація:** Оптимальним вибором є стратегія, яка забезпечує найвищий математичний мінімум. Вона мінімізує максимально можливий збиток, який може завдати супротивник.
	* Приклад: хрестики-нулики
3. Максимізація очікуваної корисності (змішані стратегії)
	Застосовується, коли матриця не має рівноваги Неша з чистими стратегіями 
	* **Механізм:** Гравці вибирають свої дії випадковим чином. Вони присвоюють ймовірність $p$ одній дії та $(1-p)$ — іншій.
	* **Реалізація:** Оптимальний розподіл ймовірностей знаходять, зрівнюючи очікувані виграші стратегій опонента між собою. Це робить опонента математично байдужим до власних виборів, що максимізує вашу базову очікувану корисність.
	* Приклад: камінь-ножиці-папір
4. Зворотна індукція
	Стандартний метод розв’язання послідовних ігор, представлених у розгорнутій формі (дерева рішень).
	* **Механізм:** Аналізує гру від кінця до початку.
	* **Виконання:** Починаючи з кінцевих вузлів (кінцевих виграшів), алгоритм визначає оптимальний хід для гравця, який приймає останнє рішення. Потім він переміщується на один вузол вгору по дереву, замінюючи кінцевий вузол цим оптимальним виграшем, і повторює процес аж до початкового кореневого вузла. Це дозволяє виділити «досконалу рівновагу Неша в підгрі».
	* Приклад: Нім
5. Лінійне програмування
	Використовується для складних, великомасштабних матричних ігор, де алгебраїчні методи виявляються неефективними.
	* **Механізм:** Задача пошуку оптимальних змішаних стратегій перетворюється на стандартну математичну задачу оптимізації.
	* **Виконання:** Цільова функція мінімізує або максимізує очікуваний виграш з урахуванням нерівностей-обмежень (сума ймовірностей повинна дорівнювати 1, а виграші повинні відповідати порогу мінімакс). Вона розв’язується обчислювальним шляхом за допомогою алгоритмів, таких як метод Симплекс.
	* Приклад: Техаський Холдем для двох гравців


#### Принцип нульової суми і як він використовується в теорії ігор

Двоособова гра з нульовою сумою: У змагальній грі з двома гравцями, якщо виграш одного гравця дорівнює втраті іншого гравця, така гра називається двоосібною грою з нульовою сумою. Для кращого розуміння дивіться наведену вище матрицю виплат: якщо результат гри становить 40, то це виграш для гравця А, але втрата для гравця Б, а якщо результат становить -25, то це втрата для гравця А, але виграш для гравця Б.

Матриця виплат: Приклад матриці виплат наведено нижче. Є два гравці, гравець А та гравець В, кожен з яких має три стратегії, а саме 1, 2 та 3. Внутрішні значення в матриці — це результати різних комбінацій. Якщо гравець А обирає 3-ю стратегію, а гравець Б — 1-шу, то результат становитиме 35; якщо гравець А обирає 2-гу стратегію, а гравець Б також обирає 2-гу стратегію, то результат становитиме 15. Якщо результат є додатним, то це виграш для гравця А і втрата для гравця В. Якщо результат є від’ємним, то це втрата для гравця А і виграш для гравця В. Розглянемо наведену нижче матрицю виплат: якщо результат становить -25, то гравець А втрачає 25 очок, а гравець В отримує 25 очок.

Застосування:
- Моделювання чистого конфлікту: це обмежує топологію гри ситуацією абсолютної конкуренції. Тут немає можливості для взаємної вигоди, співпраці чи результатів типу «виграш-виграш». 
- Спрощення матриць виграшів: у матриці нормальної форми властивість гри з нульовою сумою вдвічі зменшує обсяг необхідних даних. Якщо виграш гравця А за певного результату становить $x$, то виграш гравця Б за визначенням дорівнює $-x$. 
- Застосування теореми мінімаксу: принцип нульової суми є фундаментальним припущенням, необхідним для теореми мінімаксу Джона Неймана. Оскільки мета гравця Б — суто мінімізувати виграш гравця А, останній може математично вирішити гру, обравши стратегію, що максимізує його мінімально можливий виграш (найвищий із мінімальних рівнів). 
- Алгоритмічне вирішення: обмеження нульової суми дозволяє звести задачу пошуку оптимальних змішаних стратегій безпосередньо до моделі лінійного програмування, що робить її розв’язуваною за поліноміальний час за допомогою симплекс-методу.

#### Визначення рівноваги Неша для ігор

Основні поняття
- Рівновага Неша - це поняття, яке визначає стан, у якому жоден гравець не може збільшити свою вигоду шляхом односторонньої зміни своєї стратегії, за умови, що всі інші гравці залишають свої стратегії незмінними.
- Рівновага Неша стосується некооперативних ігор з двома або більше гравцями
- Оскільки стратегія залишається оптимальною, а користувач не отримує жодного стимулу, це також означає, що гравці знають про стратегію один одного і тому взагалі не відхилятимуться.
- Враховуючи, що інший гравець залишається незмінним у своїй стратегії, індивід не може отримати додаткової вигоди від такого відхилення. Гра може мати декілька або жодного стану рівноваги Неша.
- Класичним прикладом визначення рівноваги Неша є дилема в'язня
- матриця виплат
- кожна скінченна гра має рівновагу, коли дозволена рандомізація (змішані стратегії).

Як знайти рівновагу Неша

- Щоб знайти рівновагу Неша, потрібно спочатку постулювати всі можливі сценарії в грі, а потім знайти оптимальний з них.
	
	Якщо жоден з них не відхилився від цієї стратегії, тоді можна сказати, що рівновага Неша настала.
	
Приклади:

- Приклад гри з декількома станами рівноваги Неша (вступ 2-х друзів на курс)

- Не завжди необхідно, щоб ігри мали рівновагу Неша. (гра про найбільше число)

- Рівновага Неша знаходиться також в іграх зі змішаною стратегією (футболіст пробиває пенальті) 


#### Типи рівноваги в теорії ігор

Стан рівноваги в теорії ігор передбачає, що гравці не мають стимулу відхилятися від обраних стратегій. Вони класифікуються на основі структури гри (статична або послідовна) та наявності інформації про дії суперника (повнаб неповна).

1. Статичні ігри з повною інформацією

Рівновага Неша: Стан, коли жоден гравець не може покращити свій виграш, односторонньо змінивши свою стратегію, припускаючи, що всі інші гравці зберігають свою.
- РН чистої стратегії: Гравці вибирають одну детерміновану дію.
- РН змішаної стратегії: Гравці рандомізують можливі дії, використовуючи розподіл ймовірностей.

2. Послідовні ігри з повною інформацією

Ідеальна рівновага Неша в підгрі: Удосконалення рівноваги Неша, що використовується в покрокових іграх. стратегія є ІРН, якщо вона становить рівновагу Неша в кожній підгрі вихідного дерева гри. ІРН знаходиться за допомогою зворотної індукції

3. Статичні ігри з неповною інформацією

Байєсівська рівновага Неша (БРН): Застосовується, коли гравці не знають точних виграшів або «типів» інших гравців, але вони знають розподіл ймовірностей цих типів. Гравці максимізують свою очікувану корисність, враховуючи свій власний тип та свої переконання щодо типів інших.

4. Послідовні ігри з неповною інформацією

Ідеальна байєсівська рівновага (ІРН): Поєднує концепції БРН та ІРН. Гравці оновлюють свої переконання щодо типів інших гравців на основі спостережуваних дій, використовуючи теорему Байєса. Стратегії повинні бути оптимальними, враховуючи ці оновлені переконання в кожному вузлі ігрового дерева.

#### Застосування математичного моделювання для прогнозування різних процесів

Математичне моделювання екстраполює майбутні стани шляхом виявлення та кількісної оцінки закономірностей в історичних даних або базовій механіці системи. Застосування залежить від характеру прогнозованого процесу.

Типи прогностичних математичних моделей і сценарії застосування:
1. Стстастичні (Застосовується, коли прогнозування виключно спирається на історичні значення самої змінної (ендогенне прогнозування), припускаючи, що минулі закономірності збережуться.)
	1. ARIMA (Autoregressive Integrated Moving Average) 
	2. SARIMA - Сезонна ARIMA
	3. Holt Winters - Експонеційне згладження ( прогнозі більшу вагу мають нещодавні події. Вага попередніх подій зменшується експоненційно з часом)
2. Економетричні (Застосовується, коли прогнозована змінна залежить від зовнішніх, незалежних змінних (екзогенне прогнозування).)
	1. Множинна лінійна регресія - обчислює пропорційний вплив декількох незалежних факторів на залежну змінну
	2. Векторна авторегресія - моделювання багатовимірних часових рядів, де взаємозалежні змінні впливають однна на одну
3. Моделі МН (Застосовується до високонелінійних процесів з масивними наборами даних, де основні математичні співвідношення є занадто складними для явних рівнянь.)
	1. Random forests - паралельний ансамбль дерев
	2. Gradient boosting - послідовний ансамбль дерев
	3. RNN - НМ зі станом 'пам'яті', корисні для NLP та прогнозування
	4. LSTM - Long Short Time Memory (різновид РНМ для прогнозування часових рядів)
4. Імітаційні (Застосовується, коли історичних даних мало або під час прогнозування впливу безпрецедентних змін у правилах системи.)
	1. ABM - Прогнозування систем на основі поведінки і взаємодії багатьох незалежних елементів системи (поширення хвороби)
	2. SD - використовує диф рівняння для прогнозування безперервних, сукупних змін (наприклад, епідеміологічних кривих, макроекономічних зрушень).

#### Поняття оптимізації, основні види оптимізаційних задач

Оптимізація - це процес пошуку найкращого значення серед визначеної множини за домопогою пошуку максимального (або мінімального) значення цільової функції

Класифікація задач оптимізації:
- Неперервні чи дискретні
- Лінійні чи нелінійні
- Опуклі чи неопуклі
- Обмежені чи необмежені
- Детерміновані чи стохастичні

Класифікація видів оптимізації:
- оптиміцація першого рівня (використання першої похідної або градієнта функції)
	- Градієнтний спуск (Масштабні, необмежені неперервні задачі)
	- стохастичні методи (Проблеми з притаманно зашумленими цільовими функціями або дуже неопуклими ландшафтами, що вимагають виходу з локальних мінімумів.)
	- еволюційні алгоритми (Змішане цілочисельне програмування (MIP), розривні задачі, задачі чорного ящика та задачі з високим рівнем неопуклості)
	- алгоритми рою (Комбінаторні задачі маршрутизації (дискретні) та складні неопуклі багатовимірні простори (неперервні).)
	- Adam (для мінімізації ф-ї втрат в МН)
- оптимізація другого рівня (використання першої і другої похідної. Вони швидше збігаються, але більш обчислювально затратні)
	- Ньютонівський метод (Низьковимірні, гладкі, строго опуклі, неперервні задачі)
	- Квазіньютонівські методи (Середньо- та великомасштабні, гладкі, неперервні нелінійні задачі)
- лінійне програмування
	- Симплекс метод
	- Графічний метод
- Нелінійне програмування
 
#### Методи розв’язання задач лінійного програмування

Лінійне програмування (ЛП) – це математичний метод, що використовується для визначення найкращого можливого рішення для задачі, що включає обмежені ресурси та лінійні обмеження.

- Термін «лінійний» означає, що цільова функція та обмеження представлені лінійними рівняннями або нерівностями.
- Термін «програмування» стосується планування або визначення оптимального курсу дій
- Лінійне програмування використовується для оптимізації використання обмежених ресурсів.
- Мета полягає в тому, щоб отримати максимальне або мінімальне значення лінійної функції, задовольняючи при цьому всі задані обмеження.

Є два основні методи розв'язування задач ЛП:
1. Графічний метод - використовується, коли задача лінійного програмування містить дві змінні рішення. Він включає побудову всіх обмежень на координатній площині та визначення допустимої області.
	1. Перетворіть кожну нерівність у рівняння. 
	2. Побудуйте відповідні лінії на координатній площині. 
	3. Визначте допустиму область, яка задовольняє всі обмеження. 
	4. Знайдіть кутові точки допустимої області. 
	5. Оцініть цільову функцію в кожній кутовій точці. 
	6. Виберіть точку, яка дає максимальне або мінімальне значення цільової функції.
	
2. Симплекс метод – це алгебраїчний метод, який використовується для розв'язання задач ЛП, що включають кілька змінних та обмежень. Метод систематично переходить від одного допустимого рішення до іншого, доки не буде отримано оптимальне рішення.
	1. Сформулюйте задачу лінійного програмування. 
	2. Перетворіть нерівності на рівняння, використовуючи нерівності, надлишки або штучні змінні. 
	3. Побудуйте початкову симплекс-таблицю. 
	4. Визначте стовпець та рядок зведення. 
	5. Виконайте операції з рядками, щоб отримати нову таблицю. 
	6. Повторюйте процес, доки всі записи в цільовому рядку не задовольнятимуть умову оптимальності. 
	7. Прочитайте оптимальне рішення з кінцевої симплекс-таблиці.

Види задач ЛП:
- Виробничі задачі – це задачі, що стосуються кількості одиниць продукції, які слід виробити або продати для максимізації прибутку, коли кожен продукт вимагає фіксованої робочої сили, машино-годин та сировини.
- Задачі дієти використовуються для розрахунку кількості різних видів компонентів, які слід включити до раціону, щоб отримати мінімальну вартість, залежно від наявності продуктів харчування та їх цін.
- Транспортні задачі використовуються для визначення графіка транспортування, щоб знайти найдешевший спосіб транспортування продукту з заводів/фабрик, розташованих у різних місцях, на різні ринки.
#### Основні теореми лінійного програмування

Лінійне програмування (ЛП) спирається на набір фундаментальних математичних теорем, які визначають, як обмежуються можливі рішення та як знаходяться оптимальні рішення.

1. Фундаментальна теорема лінійного програмування. 
	Якщо задача лінійного програмування має оптимальне рішення, воно повинно знаходитися в крайній точці (вершині) допустимої області. 
	
	Математичне визначення: Для опуклого багатогранника, визначеного як $Ax le b$ та $x ge 0$, якщо цільова функція $Z = c^T x$ має скінченний максимум (або мінімум), це екстремальне значення розташоване в одній або кількох вершинах багатогранника. 
	
	Наслідок: Ця теорема обмежує простір пошуку. Алгоритми (такі як симплекс-метод) не повинні перевіряти кожну точку в межах неперервної допустимої області; їм потрібно лише оцінити перетини обмежень.

2. Теорема слабкої дуальності. 
	Кожна задача ЛП (первісна) має математично пов'язану дзеркальну задачу (дуальну). Об'єктивне значення будь-якого допустимого розв'язку первісної задачі забезпечує межу для дуальної задачі. 
	
	Математичне визначення: Якщо $x$ є допустимим розв'язком первісної задачі максимізації ($c^T x$), а $y$ є допустимим розв'язком її мінімізації дуальної задачі ($b^T y$), то:$$c^T x le b^T y$$Наслідок: Допустиме розв'язання дуальної задачі гарантує верхню межу максимально можливого значення первісної задачі.

3. Теорема сильної дуальності. Якщо або Первісна, або Дуальна задача має скінченний оптимальний розв'язок, інша задача також має скінченний оптимальний розв'язок, і їхні об'єктивні значення абсолютно рівні. Математичне визначення: Якщо $x^*$ є оптимальним розв'язком для Первісної, а $y^*$ є оптимальним розв'язком для Дуальної, тоді:$$c^T x^* = b^T y^*$$Наслідок: Розв'язання Дуальної задачі гарантує точне оптимальне розв'язання Первинної задачі. Це критично важливо для обчислювальної ефективності та аналізу чутливості (наприклад, визначення точної "тіньової ціни" ресурсу).

4. Теорема про додаткову невикористану ресурсну здатність. Зв'язує змінні рішення однієї задачі з невикористаними ресурсами обмежень іншої задачі в оптимальності. Математичне визначення: В оптимальності ($x^*, y^*$), для кожної змінної рішення $x_j^*$ у первинній задачі та відповідного обмеження $A_j^T y^* ge c_j$ у подвійній задачі:$$x_j^* (A_j^T y^* - c_j) = 0$$Наслідок: Якщо обмеження в первинній задачі не є обов'язковим (є невикористаний ресурс або "невикористаний ресурс"), відповідна подвійна змінна (тіньова ціна) повинна дорівнювати точно нулю. Якщо подвійна змінна додатна, її відповідне первинне обмеження має бути ідеально жорстким (зв'язуючим).

#### Двоїстість. Поняття прямої та двоїстої задач. Основні теореми двоїстості

1. Двоїстість
	Дуальність (або двоїстість) — це математичний принцип, згідно з яким оптимізаційні задачі існують парами. Кожну задачу можна розглядати з двох різних, але математично еквівалентних точок зору. Розв'язання однієї автоматично вирішує іншу.
	
2. Пряма та двоїста задачі
	Початкове формулювання — це первісна задача. Її пара — це дуальна задача. Якщо первісна задача є задачею максимізації, то дуальна — задачею мінімізації. Вони побудовані з використанням суворої структурної транспозиції матриць: Первісна задача (стандартна форма):$$max_{x} c^T x$$За умови:$$Ax le b$$$$x ge 0$$$c$: Коефіцієнти цільової функції.
	$A$: Матриця коефіцієнтів обмежень.
	$b$: Обмеження ресурсів (межі).
	$x$: Первісні змінні рішення. 
	
	Дуалістична задача:$$min_{y} b^T y$$За умови:$$A^T y ge c$$$$y ge 0$$$b$: Обмеження ресурсів з Первісної задачі стають об'єктивними коефіцієнтами Дуальної задачі.
	$A^T$: Транспонування матриці обмежень Первісної задачі.
	$c$: Об'єктивні коефіцієнти з Первісної задачі стають межами обмежень Дуальної задачі.
	$y$: Дуальні змінні рішення (що представляють граничну вартість або "тіньову ціну" Первісних ресурсів).
	
3. Теореми двоїстості
	 - Слабка теорема дуальності: Будь-яке допустиме рішення задачі мінімізації дуальності забезпечує верхню межу задачі первинної максимізації.$$c^T x le b^T y$$
	 - Сильна теорема дуальності: Якщо оптимальне рішення існує для однієї задачі, оптимальне рішення існує і для іншої, і їхні кінцеві цільові значення точно рівні.$$c^T x^* = b^T y^*$$
	 - Теорема додаткової нестабільності: В оптимальності змінна рішення є строго позитивною лише тоді, коли її відповідне обмеження в парній задачі є ідеально зв'язуючим (нульова нестабільність).$$x_j^* (A_j^T y^* - c_j) = 0$$$$y_i^* (b_i - A_i x^*) = 0$$
	 

#### Транспортні задачі та їх застосування 

Транспортна задача – це особливий вид задачі лінійного програмування, у якій товари транспортуються з множини джерел до множини пунктів призначення, залежно від попиту та пропозиції джерел та пункту призначення відповідно, таким чином, щоб мінімізувати загальну вартість транспортування. Її також іноді називають задачею Хічкока. 

Типи транспортних задач: 
- Збалансована: Коли попит та пропозиція рівні, то задача називається збалансованою транспортною задачею. 
- Незбалансована: Коли попит та пропозиція не рівні, то задача називається незбалансованою транспортною задачею. У цьому типі задачі додається фіктивний рядок або фіктивний стовпець відповідно до вимоги, щоб зробити її збалансованою. Тоді її можна розв'язати подібно до збалансованої задачі. 
- З проміжними вузлами, або без

Методи розв'язання: 
1. Для знаходження початкового базового допустимого рішення існує три методи:
	- Метод північно-західної кутової комірки.
	- Метод найменших витрат.
	- Метод апроксимації Фогеля (МАП).
2. Для оптимізації початкового базового допустимого рішення використовується Метод UV, з урахуванням збалансоаності і наявністю проміжних вузлів

Застосування:
- Фізична логістика та ланцюг поставок (Буквельне застосування моделі.)
- Розподіл завдань між персоналом 
- розподіл ресурсів у хмарних обчисленнях
* **Телекомунікації:** Маршрутизація пакетів даних через мережеві вузли
* **Гідрологія та комунальні послуги:** Спрямування води або електроенергії з водосховищ/електростанцій до міст, балансуючи втрати передачі з витратами на виробництво.

#### Схема гілок і границь та її основні структурні елементи

Метод гілок і границь – це метод, що використовується в задачах комбінаторної оптимізації для систематичного пошуку найкращого рішення. Алгоритм гілок та границь зазвичай використовується в таких задачах, як комівояжер та планування розкладу робіт.

Метод гілок і границь– це парадигма проектування алгоритмів, яка зазвичай використовується для вирішення задач комбінаторної оптимізації. Ці задачі зазвичай мають експоненціальну складність з точки зору часу та в найгіршому випадку можуть вимагати дослідження всіх можливих перестановок. Метод розгалужень та меж вирішує ці задачі відносно швидко.

Алгоритм:
1. Розгалуження: Основна задача розбивається на менші підзадачі, утворюючи деревоподібну структуру, де кожен вузол представляє часткове рішення.
2. Обмеження: Для кожного вузла алгоритм обчислює верхню або нижню межу найкращого можливого рішення в межах цієї підзадачі. Якщо ця межа гірша за поточне найкраще відоме рішення, вузол обрізається (тобто не досліджується далі).
3. Ітерація: Виключаючи гілки, які не можуть дати кращих рішень, ніж поточне найкраще рішення, алгоритм ітеративно застосовує кроки 1-2 до пошуку оптимального рішення

Метод гілок та границь можна класифікувати на три типи залежно від порядку, в якому виконується пошук у дереві простору станів. Обчислення всередині вузлів не відрізняються, але відрізняється порядок проходження вузлів
- FIFO (queue, BFF)
- LIFO (stack, DFS)
- Метод з найменшою вартістю (якщо вартість на будь-якому з вузлів перевищує вартість одного зі знайдених рішень - він обтинається)

Основні структурні елементи схеми:
- Генерація дерева простору станів: B&B генерує дерево простору станів для ефективного пошуку в просторі рішень заданого екземпляра задачі.

- Оцінка кандидата на рішення
	- Спосіб призначення межі найкращих значень заданих критеріальних функцій кожному вузлу в дереві простору станів: Вона створюється шляхом додавання додаткових компонентів до часткового рішення, заданого цим вузлом.
	- Найкращі значення заданої критеріальної функції, отримані на даний момент: Вона описує верхню межу для задачі максимізації та нижню межу для задачі мінімізації.

Приклад: 0/1 Рюкзак з використанням методу «Гілок та меж»

#### Генетичні алгоритми для розв’язання задач оптимізації

Генетичні алгоритми  -  це методи еволюційної оптимізації, надхненні принципами природнього відбору та природньої еволюції. Вони працюють шляхом ітераційної еволюції популяції кандидатів рішень використовуючи оператори такі як селекція, мутації, перехрещення для пошуку рішення, близького до оптимального в умовах, коли стандартних методів оптиміхації недостатньо

Вони математично підходять для класів задач, де традиційні методи на основі градієнтів (такі як метод Ньютона або градієнтний спуск) зазнають невдачі або застрягають.

Ключові поняння

- Популяція - Набір рішень на певній стадії алгоритму. Більший розмір популяції зазвичай приводить до кращих фінальних рішень запобігає ранній збіжності, але потребує більше обчислювальних ресурсів
- Хромосома - набір генів, в яких закодований кожен елемент рішення. Хромосома і являє в собі рішення з набору популяції
- Ген - найменший елемент хромосоми або рішення (змінна, переметр або ознака)
- Кодувальні методи - методи кодування елементів рішень у хромосоми
- Функція пристосованості - функція, яка оцінює якість рішення. Відрізняється для кожної задачі
- Критерій зупинки - умова виходу з алгоритму (перевищення часу виконання, отримання задовільного рішення, стагнація якості рішень, перевищення заданої кількості поколінь)
- Селекція - відбір хромосом з популяції з найкращими значеннями функції пристосованості (випадковий з розподілом ймовірностей, турнір(найкращі кандидати з випадково відібраних множин)). Хромосоми, які пройшли селекцію, стають батьками для нового покоління
- Перехрещення - перемішування генів між батьками для побудови нової популяції рішень
- Мутація - випадкові зміни в генах для збереження різноманітності популяції і запобігання ранній збіжності

Алгоритм:
1. Випадкова ініціалізація популяції
2. застосування Функції пристосованості для оцінки якості рішень
3. Селекція батьків
4. Перехрещення хромосом
5. Випадкові мутації
6. Формування нової популяції
7. Повторення кроків 2-6 до виконання критерію зупинки

Застосування в звдвачах оптимізації:
 1. Комбінаторна оптимізація
	Задачі, що включають масивні, дискретні простори перестановок, де пошук методом грубої сили обчислювально неможливий ($O(n!)$). (комівояжера, маршрутизація)
 2. Сильно неопукла оптимізація
	 задачі з багатьма локальними мінімумами
3. недиференційовані задачі
	Задачі, де цільова функція є розривною, шумною або не має обчислюваної математичної похідної. (підбір гіперпараметрів)

#### Нелінійне програмування

Нелінійне програмування (НЛП) – це математичний процес розв'язання задачі оптимізації, де або цільова функція, або принаймні одне з обмежень, є нелінійними.

На відміну від лінійного програмування, яке має справу виключно з прямими лініями та плоскими площинами, НЛП має справу з кривими, поверхнями та складними багатовимірними ландшафтами, що містять поліноми, експоненти або тригонометричні функції.

Математичне формулювання задач НЛП
$$min_{x} f(x)$$За умов:$$g_i(x) le 0, quad i = 1, dots, m$$$$h_j(x) = 0, quad j = 1, dots, p$$

$$x in X$$
да або f(x) або g або h є нелінійними

Ознаки
- Відсутність граничної оптимізації: У лінійному програмуванні оптимальне рішення завжди лежить на межі (вершині) допустимої області. У NLP оптимальне рішення може лежати будь-де, включаючи глибоко всередині допустимої області або на криволінійній межі.

- Проблема локальних мінімумів: Найважливіша математична проблема в NLP полягає в розрізненні локального мінімуму (найнижчої точки в певній долині) та глобального мінімуму (абсолютно найнижчої точки в усьому ландшафті). Якщо проблема не є строго опуклою, алгоритми можуть легко потрапити в пастку локальних мінімумів.

- Розв'язувачі на основі похідних: Оскільки функції криволінійні, розв'язання задач NLP вимагає обчислення градієнтів (перших похідних) та іноді матриці Гессе (других похідних) для визначення нахилу та кривизни математичного ландшафту.

Класифікація
- Квадратичне програмування (QP): Цільова функція є квадратичною (містить квадратичні члени, такі як $x_1^2$ або $x_1 x_2$), але всі обмеження залишаються суворо лінійними.
- Квадратично обмежене квадратичне програмування (QCQP): Як цільова функція, так і обмеження містять квадратичні члени. 
- Опукле програмування: Спеціалізована підмножина, де цільова функція є опуклою (має форму чаші), а область допустимих результатів є опуклою множиною.

Методи розв'язяння
- оптиміцація першого рівня (використання першої похідної або градієнта функції)
	- Градієнтний спуск (Масштабні, необмежені неперервні задачі)
	- еволюційні алгоритми (Змішане цілочисельне програмування (MIP), розривні задачі, задачі чорного ящика та задачі з високим рівнем неопуклості)
	- алгоритми рою (Комбінаторні задачі маршрутизації (дискретні) та складні неопуклі багатовимірні простори (неперервні).)
- оптимізація другого рівня (використання першої і другої похідної. Вони швидше збігаються, але більш обчислювально затратні)
	- Ньютонівський метод (Низьковимірні, гладкі, строго опуклі, неперервні задачі)
	- Квазіньютонівські методи (Середньо- та великомасштабні, гладкі, неперервні нелінійні задачі)


#### Методи глибокого пошуку для вирішення задач оптимізації

- DFS
	Опис: Алгоритм DFS рекурсивно обходить сусідні вузли, доки не досягне глибини, на якій неможливі подальші дійсні рекурсивні виклики.
	Щоб DFS можна було використовувати як алгоритм пошуку найкоротшого шляху, граф має бути ациклічним, тобто ДЕРЕВОМ. Він трохи швидший за BFS в обході цілого графа, але BFS більш надійний у пошуку найкоротшого шляху, коли довжина цього шляху коротша за глибину графа

	Часова складність: O(V)

Приклад застосування в задачі оптимізації: метод гілок та границь (генерація дерева станів - DFS для пошуку допустимого рішення і для обходу дерева загалом)

Альтернативи: BFS, метод найменшої вартості

#### Методи стохастичної оптимізації

Методи стохастичної оптимізації інтегрують математично контрольовану випадковість у процес пошуку для навігації по дуже неопуклих, перервних функціях та уникнення потрапляння в локальні мінімуми.

Методи стохастичної оптимізації
- Імітація відпалу - надхненна процесом відпалу в металуургії, вводить поняття температури, яка визначає ймовірність прийняття рішень, гірших за наявне, і ітеративно зменшується
- генетичні алгоритми - надхненні природнім еволюційним процесом і вводить багато понять, пов'язаних з природнім відбором
- алгоритми рою - надхненні популяціями птахів або мурах в пошуку їжі. Генеруються багато точок у просторі рішень із заданими напрямком і швидкістю. кожна точка ітеративнозмінює своє положення в залежності від своїх попередніх найкращих позицій і найкращих позицій популіції, а також своєї інерції до досягення збіжності
- стохастичний градієнтний спуск - У традиційному градієнтному спуску градієнти обчислюються на основі всього набору даних, що може бути обчислювально ресурсоємним для великих наборів даних. У стохастичному градієнтному спуску градієнт обчислюється для кожного навчального прикладу (або невеликої підмножини навчальних прикладів), а не для всього набору даних.

#### Оптимізація з обмеженнями

Обмеження – це математичні умови, яким повинні відповідати змінні рішення, щоб рішення вважалося дійсним. Вони визначають «допустиму область», яка є геометричним простором, що містить усі прийнятні комбінації змінних.
1. Типи обмежень
	- Обмеження рівності ($h(x) = 0$): Обмежують рішення точними лініями, кривими або поверхнями. Вони представляють абсолютні баланси або суворі вимоги, такі як забезпечення точної відповідності обсягу виробництва попиту.
	- Обмеження нерівності ($g(x) le 0$ або $g(x) ge 0$): Встановлюють межі з одного боку математичної функції. Вони представляють верхні межі (максимальний бюджет або матеріальна ємність) або нижні межі (мінімальні пороги безпеки).
	- Обмеження області: Визначають допустимий набір значень для окремих змінних незалежно від інших змінних. Приклади включають обмеження невід'ємності ($x ge 0$) або цілочисельні обмеження ($x in mathbb{Z}$), які запобігають дробовим рішенням у дискретних задачах.

2. Стан обмежень в оптимальності
	- Зв'язуючі (активні) обмеження: Оптимальне рішення лежить точно на межі обмеження. Ресурс повністю споживається (наприклад, $g(x) = 0$). Математичний "резерв" дорівнює нулю. (ЛП)
	- Незв'язуючі (неактивні) обмеження: Оптимальне рішення лежить всередині межі, тобто обмеження активно не обмежує оптимальну точку. Є залишок ресурсу (резерв більше нуля). (НЛП)




#### Детерміновані та стохастичні моделі оптимізації і основні підходи до їх розв’язування

1. **Детерміновані моделі оптимізації**
Усі параметри, обмеження та коефіцієнти відомі з абсолютною достовірністю. Математична система не містить випадковості; певний набір параметрів завжди дає абсолютно однаковий результат.

методи розв'язання:

* **Симплексний алгоритм:** Розв'язує задачі лінійного програмування шляхом математичної навігації по вершинах допустимих меж області.
* **Градієнтні методи:** (наприклад, метод Ньютона, SQP). Розв'язує неперервні нелінійні задачі шляхом обчислення похідних для знаходження найкрутішого нахилу до локального або глобального мінімуму.
* **Гілки та межі:** Розв'язує задачі дискретного або змішаного цілочисельного програмування шляхом вичерпного відображення дерева рішень, одночасно математично обрізаючи шляхи, які не можуть дати кращого рішення.

2. **Стохастичні моделі оптимізації**
Дані невизначені. Один або декілька параметрів не є фіксованими значеннями, а представлені розподілами ймовірностей. Метою зазвичай є оптимізація очікуваного значення або мінімізація ризику.

Методи стохастичної оптимізації інтегрують математично контрольовану випадковість у процес пошуку для навігації по дуже неопуклих, перервних функціях та уникнення потрапляння в локальні мінімуми.

методи розв'язання:

- Імітація відпалу - надхненна процесом відпалу в металуургії, вводить поняття температури, яка визначає ймовірність прийняття рішень, гірших за наявне, і ітеративно зменшується
- генетичні алгоритми - надхненні природнім еволюційним процесом і вводить багато понять, пов'язаних з природнім відбором
- алгоритми рою - надхненні популяціями птахів або мурах в пошуку їжі. Генеруються багато точок у просторі рішень із заданими напрямком і швидкістю. кожна точка ітеративнозмінює своє положення в залежності від своїх попередніх найкращих позицій і найкращих позицій популіції, а також своєї інерції до досягення збіжності
- стохастичний градієнтний спуск - У традиційному градієнтному спуску градієнти обчислюються на основі всього набору даних, що може бути обчислювально ресурсоємним для великих наборів даних. У стохастичному градієнтному спуску градієнт обчислюється для кожного навчального прикладу (або невеликої підмножини навчальних прикладів), а не для всього набору даних.

#### Проблема багатокритерійності та ії розв’язання

Проблема багатоваріантності (часто звана комбінаторним вибухом або прокляттям розмірності) виникає, коли кількість можливих рішень у просторі рішень або оптимізації зростає експоненціально зі збільшенням кількості змінних або дискретних станів. 

Математично, якщо задача має $n$ змінних, кожна з яких може приймати $k$ станів, кількість варіантів дорівнює $k^n$. Це робить вичерпний пошук (оцінку всіх варіантів методом грубої сили) обчислювально неможливим або надзвичайно неефективним

Для вирішення проблеми багатокритерійності застосовують різні методи оптимізації:
- Гілок та меж - задача розбивається на підзадачі з утворенням дерева рішень, в якому потрібно знайти шлях від кореня до листка за найменшу вартість
- Динамічне програмування - складна багатокритерійна задача розбивається на підзадачі, які перетинаються між собою. Кожна підзадача вирішується лише раз і її розв'язок запам'ятовується
- Метаевристичні методи - замість пошуку оптимального рішення, шукають достатньо хороше рішення, зменшуючи складність задачі:
	- Генетичні алгоритми
	- Алгоритми рою
- Методи зменшення розмірності (переведення даних високої розмірності у простір нижчої розмірності)
	- Методи лінійної алгебри




#### Оптимізація в задачах комбінаторної оптимізації

Комбінаторна оптимізація — це математичний процес знаходження оптимального рішення зі скінченної, дискретної множини можливих варіантів. Оскільки кількість комбінацій зростає експоненціально з розміром вхідних даних, ці задачі (такі як задача комівояжера, маршрутизація та планування) зазвичай є NP-складними.

Методи розв'язку задач комбінаторної оптимізації:
1. Точні алгоритми (гарантують знаходження абсолютного глобального оптимуму), але їх застосування обмежене у складних задачах

	- Метод гілок та меж: Організовує простір рішень у деревоподібну структуру. Він обчислює межі (границі) для певних гілок та повністю видаляє секції, які математично не можуть дати краще об'єктивне значення, ніж поточне найвідоміше рішення.
	- Динамічне програмування: Розкладає складну задачу на перекриваючі підзадачі. Він вирішує кожну підзадачу рівно один раз та зберігає результат (запам'ятовування), витягуючи його для майбутніх обчислень для зменшення часової складності.

2. Апроксимуючі методи
	- Жадібні алгоритми: Роблять абсолютно найкращий негайний вибір на кожному окремому кроці (як алгоритм найближчого сусіда) без урахування ширших глобальних наслідків, часто потрапляючи в пастку локальних оптимумів.

	- Ройові та еволюційні обчислення: використовує ймовірнісні механізми, що імітують біологію (генетичні алгоритми, оптимізація колоній мурах), для одночасної оцінки та мутації наборів рішень, сходячись на високоякісних наближеннях.

Приклад: 0/1 Рюкзак з використанням методу «Гілок та меж»

TOPICSEPARATOR

#### Архітектура NGN

Мережа наступного покоління (NGN) – це мережа на основі пакетів, яка може використовуватися як для телекомунікаційних послуг, так і для передачі даних.

Головною метою мережі наступного покоління (NGN) є заміна телефонної мережі загального користування (PSTN) та цифрової мережі з інтегрованими послугами (ISDN).

Телефонія, Інтернет та стільникові мережі відносяться до різних доменів, і кожна з них має свій власний протокол та послуги. Ідея мережі наступного покоління (NGN) полягає в тому, що єдина мережа передає всі типи даних та надає послуги у формі пакетів, подібних до тих, що використовуються в Інтернеті. Зазвичай NGN будуються на основі інтернет-протоколу (IP). 

Послуги, що підтримуються в NGN:
- Послуги передачі даних.
- Мультимедійні послуги.
- Послуги симуляції (PSTN)/(ISDN).
- Послуги емуляції (PSTN)/ (ISDN)

Архітектура NGN

![[Pasted image 20260831140642.png]]

#### Архітектура мережі мобільного зв’язку 5G

5G – це останнє покоління мобільних мереж. Воно пропонує дуже високошвидкісний інтернет з піковою швидкістю до 20 Гбіт/с та середньою швидкістю понад 100 Мбіт/с. Воно використовує технологію OFDM (ортогональне частотне мультиплексування) та працює на широких частотних каналах від 100 до 800 МГц.

5G розроблений для підтримки всіх типів зв'язку, не лише мобільного, але й для голосового, неголосового, важливих та регулярних послуг, пристроїв IoT (Інтернету речей).

На відміну від старіших мереж, ядро ​​5G повністю програмне та створене для роботи в хмарі. ядро ​​5G працює відповідно до глобального стандарту 3GPP, що гарантує безперебійне керування всіма частинами мережі 5G

Функції мережі 5G
- NRF (Network Repository Function) (Функція мережевого репозиторію): Усі функції мережі 5G (NF) в мережі оператора зберігаються централізовано у функції мережевого репозиторію (NRF).
- PCF (Policy Control Function) (Функція контролю політик): PCF встановлює правила роботи мережі 5G. 
- BSF (Binding Support Function) (Функція підтримки зв'язування): Коли в мережі є багато систем PCF, BSF допомагає їм безперебійно працювати разом та підтримує порядок.
- SCP(Service Communication Proxy) (Проксі-сервер зв'язку послуг): спрямовує дані туди, куди їм потрібно, підтримує надійність мережі
- NSSF (Network Slicing Selection Function) (Функція вибору мережевого сегментування): 5G може розділити мережу на частини (так звані сегменти) для різних цілей. NSSF допомагає вибрати правильний сегмент для кожного сервісу чи програми користувача.
- UDM (Unified Data Management) & UDR (User Data Repository)(Уніфіковане керування даними Сховище даних користувачів):
- AUSF (Authentication Server Function) (Функція сервера автентифікації): Під час процесу реєстрації AMF (Функція доступу та мобільності) відповідає за вибір правильної функції сервера автентифікації (AUSF).
- NWDAF (Network Data Analytics Function) (Функція аналізу мережевих даних): NWDAF збирає та вивчає мережеві дані для покращення взаємодії з користувачем

Архітектура мережі
У представленні на основі послуг зображується взаємодія між мережевими операціями
![[Pasted image 20260831151156.png]]


#### Забезпечення якості сервісу (QoS). Методи забезпечення QoS

Якість обслуговування (QoS) – це набір механізмів управління та контролю трафіку, що використовуються в комп'ютерних мережах для визначення пріоритетів та регулювання передачі даних на основі вимог програм.

Параметри QoS
- Втрата пакетів: Деякі пакети втрачаються в мережі (часто через перевантаження). Це знижує якість дзвінків, відео та завантажень.
- Джиттер: Джиттер – це зміна часу надходження пакетів, спричинена перевантаженням, змінами маршрутизації або різницею в часі.
- Затримка: Затримка – це час, необхідний для подорожі пакета від джерела до пункту призначення.
- Пропускна здатність: Пропускна здатність відображає максимальну пропускну здатність мережевого з'єднання протягом заданого періоду часу.
- Пропускна здатність: Пропускна здатність – це фактична швидкість, з якою дані успішно передаються мережею.
- Коефіцієнт помилок: Коефіцієнт помилок вказує на частоту пошкоджених або втрачених пакетів під час передачі.

Методи забезпечення якості сервісу:
1. Політика трафіку
	Перевіряє швидкість трафіку на відповідність встановленому ліміту та негайно знижує пріоритет пакетів, які його перевищують.
	- Вимірює трафік на основі попередньо визначеної швидкості або політики
	- Працює без буферизації надлишкових пакетів
	- Запобігає надмірному використанню пропускної здатності окремим користувачем або програмою
	- Зазвичай впроваджується в точках входу мережі для контролю вхідного трафіку
2. Управління перевантаженнями
	Регулює черги пакетів та реагує на зростання рівня трафіку для підтримки стабільної продуктивності мережі.
	- Управління перевантаженнями контролює накопичення черг та забезпечує впорядковану передачу пакетів.
	- Уникнення перевантажень виявляє ранні сигнали перевантаження до переповнення буферів.
	- Раннє реагування допомагає мінімізувати затримки та запобігає масштабним повторним передачам.
	- Випадкове раннє виявлення (RED): вибірково скидає пакети, щоб повідомити відправників про перевантаження.
	- Зважене RED (WRED): змінює ймовірність відкидання залежно від пріоритету трафіку для захисту критичних потоків.
3. Контроль доступу
	Дозволяє нові потоки трафіку лише тоді, коли мережа має достатньо ресурсів для їх підтримки, не завдаючи шкоди продуктивності існуючих послуг.
	- Перевіряє доступність пропускної здатності, запас затримки та ємність буфера.
	- Допускає новий потік лише за умови, що поточні рівні QoS все ще можуть підтримуватися.
	- Допомагає уникнути перевантаження та неконтрольованого перевантаження.
	- Підтримує передбачувану продуктивність для трафіку в режимі реального часу та високопріоритетного трафіку.
	- Поширений у критично важливих мережевих середовищах та мережах з гарантованим обслуговуванням.

4. Резервування ресурсів
	Виділяє певну мережеву ємність для вибраних потоків трафіку для забезпечення стабільної та передбачуваної продуктивності.
	- Виділяє пропускну здатність та необхідні ресурси перед початком передачі
	- Забезпечує гарантоване обслуговування для програм, чутливих до затримки
	- Мінімізує конкуренцію за найкращого трафіку Підходить для середовищ, що вимагають суворих гарантій продуктивності
	- RSVP (Протокол резервування ресурсів) концептуально сигналізує та встановлює резервування по всьому шляху

5. Надмірне виділення ресурсів
	Підхід до проектування мережі, який додає додаткову ємність, щоб звичайні піки трафіку з меншою ймовірністю спричинили перевантаження та проблеми з продуктивністю.
	- Збільшує пропускну здатність/ресурси каналу для поглинання пікових навантажень
	- Знижує ймовірність перевантаження, не покладаючись сильно на елементи керування QoS Найкраще працює, коли мережа завантажена від легкого до помірного рівня Не може забезпечити передбачуване обслуговування під час серйозного або непередбачуваного перевантаження Дорогий та неефективний у масштабі через невикористану зарезервовану ємність
	
6. Класифікація та маркування трафіку
	Процес ідентифікації різних типів мережевого трафіку та маркування пакетів, щоб мережа могла застосовувати до них відповідні політики QoS.
	- Класифікація трафіку групує пакети на основі таких параметрів, як тип програми, протокол, номер порту або адреса джерела/призначення (наприклад, голос, відео, дані найкращого рівня).
	- Маркування пакетів призначає значення пріоритету класифікованим пакетам (наприклад, DSCP або біти пріоритету), щоб вказати, як мережеві пристрої повинні їх обробляти.
	- Марковані пакети дозволяють маршрутизаторам і комутаторам розрізняти трафік і ефективно застосовувати такі механізми, як черга пріоритетів
	- Без класифікації та маркування весь трафік обробляється однаково, що робить забезпечення QoS неефективним.

Моделі Qos


#### Механізми обслуговування черг

Механізми обслуговування черг (або активне керування чергою - AQM) керують тим, як мережевий маршрутизатор або комутатор обробляє пакети даних, коли його буфер пам'яті наближається до максимальної ємності. Ці алгоритми визначають, які пакети приймаються в чергу, а які відкидаються, щоб запобігти колапсу мережі через перевантаження.

Методи AQM
1. Drop Tail (відкидання хвоста) - Найпростіший і найпоширеніший механізм за замовчуванням. Маршрутизатор приймає всі вхідні пакети, доки його буфер не буде математично заповнений (100% ємності). Як тільки черга досягає максимального ліміту, кожен наступний пакет, що надходить, відкидається без розбору.

	Проблема: Викликає «глобальну синхронізацію». Коли буфер заповнюється, кілька TCP-потоків одночасно втрачають пакети, що призводить до того, що всі сервери-відправники різко знижують швидкість передачі одночасно. Використання мережі різко падає, а потім повільно зростає, доки буфер знову не заповниться, створюючи неефективні, нерівномірні сплески пропускної здатності.
	
	Приклад: Стандартний домашній некерований комутатор отримує запит на передачу файлу зі швидкістю 1 Гбіт/с, намагаючись вивести його на порт зі швидкістю 100 Мбіт/с.
	
2. RED (Random Early Detection) випадкове раннє виявлення -  механізм, розроблений для проактивного запобігання повному заповненню черги. Він контролює середню глибину черги з часом.
	
	Механізм: Коли середній розмір черги перевищує визначений мінімальний поріг, маршрутизатор починає випадковим чином відкидати невеликий відсоток вхідних пакетів. Коли розмір черги наближається до максимального порогу, ймовірність відкидання пакета лінійно зростає.
	
	Приклад: Основний маршрутизатор інтернет-провайдера керує трафіком магістральної мережі, активно відкидаючи 2% пакетів у години пік, щоб підтримувати низьку загальну затримку.
	
3. WRED (Weighted Random Early Deteection) Зважене випадкове раннє виявлення - Розширення RED, яке інтегрує пріоритети якості обслуговування (QoS).
	
	Механізм: трафік з низьким пріоритетом (наприклад, фонові торренти) досягне порогу відкидання раніше та матиме вищу ймовірність відкидання, ніж трафік з високим пріоритетом (наприклад, VoIP або відеоконференції).
	
	Приклад: Маршрутизатор корпоративної мережі, налаштований на агресивне відкидання великих пакетів передачі файлів (FTP), захищаючи пакети викликів Zoom (UDP), коли корпоративний висхідний канал наближається до 80% пропускної здатності.
	
2. Deficit Round Robin Дефіцитний циклічний режим - Замість підтримки єдиної монолітної черги, ці механізми математично сегментують буфер на окремі підчерги для кожного потоку трафіку (для кожної IP-адреси або порту).

	Механізм: Маршрутизатор циклічно проходить через підчерги, обслуговуючи пакети за циклічним режимом. Якщо один потік намагається перевантажити систему, він заповнює лише свій власний виділений буферний простір; він не може математично витіснити інші потоки.
	
	Приклад: Спільна мережа університетських гуртожитків, що запобігає масовому завантаженню одного студента, яке може заблокувати перегляд веб-сторінок усіх інших студентів на тому ж маршрутизаторі.


#### Механізм зворотного зв’язку

Механізми зворотного зв'язку – це процеси, в яких вихідний сигнал системи подається назад у систему як вхідний. Цей механізм дозволяє системі саморегулюватися та адаптуватися на основі своєї продуктивності та зовнішніх умов. Механізми зворотного зв'язку є фундаментальними в багатьох природних, мережевих та інженерних системах

Існує два основних типи зворотного зв'язку:
- Позитивний зворотний зв'язок: Посилює зміни або відхилення від норми. У розподілених системах позитивний зворотний зв'язок може призвести до експоненціального зростання або ескалації певних процесів, що може бути корисним у таких сценаріях, як швидке масштабування програм.
- Негативний зворотний зв'язок: Протидіє відхиленням від норми, прагнучи стабілізувати систему. У розподілених системах негативний зворотний зв'язок часто використовується для виправлення помилок, балансування навантажень або підтримки стабільності системи.

Види зворотного зв'язку:
Механізми зворотного зв'язку можна класифікувати за їх призначенням та реалізацією:
1. Механізми балансування навантаження між вузлами - для уникнення перевантаження на кожному отремому вузлі системи
2. Механізми масштабування - для збільшення або зменшення к-ті вузлів залежно від запиту (в хмарних обчисленнях)
3. Механізми моніторингу справності - для запуску процесів принесправності системи (перезапуск сервісів)
4. Механізми налаштування продуктивності - налаштування параметрів на основі відгуку для оптимізації продуктивності 
5. Механізми управління ресурсами - для розподілу ресурсів системи (процесор, пам'ять та сховище)

Роль механізмів зворотного зв'язку
- Підтримка балансу
- Підвищення стійкості
- Підвищення ефективності
- Сприяння автоматизації
- Забезпечення самоадаптації

Приклади
- Автоматичне масштабування Amazon Web Services (AWS) для автоматичного коригування кількості ресурсів на зміни попиту
- Горизонтальне автомасштабування подів Kubernetes (HPA) HPA масштабує кількість реплік подів вгору або вниз, щоб підтримувати оптимальну продуктивність та використання ресурсів. 
- Мережі доставки контенту (CDN): якщо певний периферійний сервер має високий трафік, CDN може перенаправляти запити на інші сервери, щоб збалансувати навантаження та зменшити затримку. 
- Оптимізація запитів до бази даних: Плани виконання запитів коригуються на основі відгуків про продуктивність запитів, таких як час виконання та використання ресурсів, для підвищення ефективності та скорочення часу відгуку.

#### Протокол резервування ресурсів RSVP

Визначення
Протокол резервування ресурсів (RSVP)  - це протокол передачі даних, який використовується в системах реального часу для переважно для ефективної передачі мультимедійних данмх

Особливості протоколу резервування ресурсів:
- RSVP ініціюється приймачем. Вузол приймача в системі реального часу ініціює протокол.
- RSVP є симплексним (однонаправленим). Вузол приймача лише отримує пакети та не надсилає жодних даних.
- RSVP забезпечує QoS
- Він динамічно адаптується до зміни маршруту для ефективної передачі повідомлень.
- це не протокол маршрутизації. Він залежить від інших протоколів маршрутизації
- RSVP працює на транспортному рівні моделі OSI та використовується для резервування ресурсів для певного потоку даних 
- Його можна використовувати як для одноадресного, так і для багатоадресного зв'язку.
- RSVP використовує механізм м'якого стану
- Він підтримує різні типи трафіку, включаючи постійний бітрейт, змінний бітрейт та трафік on demand.
- RSVP можна використовувати разом з диференційованими послугами (DiffServ) для забезпечення якості обслуговування (QoS) у мережі.
- Він використовує сигнальне повідомлення під назвою RSVP PATH для запиту ресурсів та повідомлення RSVP RESV для резервування ресурсів для певного потоку.
- Він широко використовується в мультимедійних додатках, таких як відеоконференції, потокове передавання та онлайн-ігри.

Види повідомлень
- Повідомлення про резервування (resv): Одержувач надсилає відправнику повідомлення про резервування (resv), яке визначає всі необхідні ресурси та параметри для встановлення протоколу
	![[Pasted image 20260831182228.png]]
- Повідомлення про шлях (path): Після отримання повідомлення про резервування від одержувача відправник розсилає всім одержувачам повідомлення про шлях (path), яке визначає деталі маршрутизації пакета
	![[Pasted image 20260831182239.png]]

Переваги
	Передбачуваний розподіл ресурсів
	Детермінована поведінка
	Гарантії якості обслуговування
	Оптимізація ресурсів

Недоліки
	Збільшення витрат ресурсів
	Обмежена гнучкість
	Складність масштабування
	Ризики конфліктів резервування та блокувань

#### Потокові протоколи

Протоколи потокової передачі – це стандартизовані правила передачі медіафайлів мережею. Вони фрагментують потокові аудіо- та відеодані на послідовні пакети, що дозволяє клієнтському пристрою відтворювати їх до завантаження повного файлу.

Види потокових протоколів:
1. HLS (HTTP Live Streaming) (TCP через HTTP, затримка 10-30 секунд)
	* **Механізм:** Протокол, розроблений Apple, який використовує адаптивну потокову передачу з бітрейтом (ABR). Він сегментує відео на невеликі фрагменти (зазвичай 2-10 секунд) та передає їх через стандартні HTTP-з'єднання.
	* **Використання:** Використовується для потокової передачі в прямому ефірі та відео на вимогу (VOD) для широкої аудиторії майже у всіх веббраузерах, мобільних операційних системах та Smart TV.
2. MPEG-DASH (Dynamic Adaptive Streaming over HTTP) (TCP через HTTP, затримка 10-30 секунд)
	* **Механізм:** Міжнародний стандарт з відкритим кодом, математично подібний до HLS, але незалежний від кодеків (він не вимагає специфічних відеокодеків, таких як H.264).
	* **Використання:** Основна альтернатива HLS з відкритим стандартом. Широко використовується такими платформами, як YouTube, Netflix та екосистемою Android
3. WebRTC (Веб-зв'язок у реальному часі) (UDP через RTP/SRTP, затримка до півсекунди)
	* **Механізм:** Відкритий фреймворк, що використовує UDP для встановлення прямих однорангових з'єднань. Він надає пріоритет швидкості над абсолютною надійністю пакетів для досягнення затримки менше секунди.
	* **Використання:** Інтерактивний зв'язок у реальному часі, де затримка неприйнятна. Використовується для відеоконференцій на базі браузера (Google Meet), VoIP, телемедицини та інтерактивних прямих трансляцій.
4. RTMP (протокол обміну повідомленнями в реальному часі) (TCP, затримка 3-5 секунд)
	* **Механізм:** Застарілий протокол на основі TCP, спочатку розроблений для Adobe Flash. Він підтримує постійне, безперервне з'єднання, а не завантажує окремі фрагменти HTTP.
	* **Використання:** Хоча він застарів для відтворення глядачами, він залишається галузевим стандартом для завантаження відео "першої милі". використовується для передачі відео в реальному часі з кодера (наприклад, OBS) на центральний потоковий сервер (наприклад, Twitch), який потім перекодує та перепакує стрічку в HLS або DASH для кінцевих глядачів.



#### Управління перевантаженнями

У комп'ютерних мережах перевантаження виникає, коли через мережу одночасно передається забагато даних, що призводить до затримок, втрати пакетів або навіть колапсу мережі. Це схоже на затор на автомагістралі – коли забагато автомобілів намагаються рухатися одночасно, все сповільнюється.

Управління перевантаженнями – це набір методів та механізмів, що використовуються для запобігання, виявлення та контроль перевантажень

Вплив контролю перевантажень
- Покращена стабільність мережі: Запобігає перевантаженню та забезпечує безперебійну роботу мережі.
- Зменшення затримки та втрати пакетів: Забезпечує швидшу доставку даних з меншою кількістю повторних передач.
- Підвищена пропускна здатність: Максимізує обсяг даних, успішно переданих за заданий час.
- Справедливість розподілу ресурсів: Рівномірно розподіляє пропускну здатність, щоб жоден користувач не монополізував ресурси.
- Кращий користувацький досвід: Забезпечує швидший доступ до веб-сайтів, програм та послуг.
- Запобігання колапсу перевантаження: Уникає серйозних збоїв, коли мережа стає майже непридатною для використання.

Алгоритми управління перевантаженнями:
- Алгоритм витоку пакетів (Leaky Bucket): контролює потік пакетів, надсилаючи їх з постійною фіксованою швидкістю, незалежно від вхідного пакетного трафіку. Пакети поміщаються в кошик (чергу), і якщо кошик переповнюється, надлишкові пакети відкидаються
	Обмеження: Занадто жорсткий, марнує доступну пропускну здатність, якщо трафік сильно нерівномірний
	1. Пакети надходять -> поміщаються в відро. 
	2. відро витікає (передає пакети) з постійною швидкістю. 
	3. Пульсуючий трафік згладжується в рівномірний трафік.
- Алгоритм Token Bucket: забезпечує більшу гнучкість, генеруючи токени з фіксованою швидкістю. Пакет може бути переданий лише за наявності токена, і кожен пакет споживає один токен. Якщо накопичується достатня кількість токенів, можна швидко надсилати пакетний трафік, що покращує обробку змінних моделей трафіку без зайвих падінь.
	Перевага: Ефективно обробляє імпульсивний трафік без зайвої втрати даних.
	1. Токени додаються до відра через регулярні проміжки часу.
	2. Кожен токен дозволяє надсилання одного пакета.
	3. Якщо токени існують -> пакети можна передати негайно.
	4. Якщо токенів немає -> пакети мають чекати.

Переваги контролю перевантаження
- Забезпечує стабільну та надійну роботу мереж.
- Зменшує затримки та повторні передачі.
- Мінімізує втрати даних.
- Оптимізує використання ресурсів.
- Добре масштабується разом із зростаючими мережами

Недоліки контролю перевантаження
- Ускладнює проектування мережі.
- Може створювати накладні витрати на обробку.
- Може бути чутливим до стану мережі.
- Може мати проблеми з пріоритезацією ресурсів у критичних сценаріях.



#### Стандарти QoS в IP-мережах

Стандарти або Моделі QoS керують пропускною здатністю, затримкою, джиттером та втратою пакетів в IP-мережах і визначають, як пріоритезується трафік і як розподіляються мережеві ресурси для задоволення потреб продуктивності застосунків.

Найбільш базова модель QoS - це BE(Best Effort) - Усі пакети мають однаковий пріоритет без гарантій доставки

На практиці застосовуються 2 основні стандарти QoS: IntServ та DIffServ
1. Інтегровані послуги (IntServ): забезпечують суворі гарантії якості обслуговування (QoS), резервуючи ресурси для кожного окремого потоку до початку трафіку.
	
	Компоненти QoS IntServ
	- Резервування ресурсів: Маршрутизатори резервують пропускну здатність/буфери для потоку та виконують перевірки доступу на кожному стрибку.
	- Планування з урахуванням QoS: Планувальники, такі як WFQ, допомагають справедливо розподіляти пропускну здатність, дотримуючись пріоритетів.
	- Маршрутизація з урахуванням QoS: Маршрутизація QoS намагається вибрати шляхи, які можуть відповідати необхідному рівню обслуговування.
	- Відкидання пакетів QoS: Під час перевантаження пакети з нижчим пріоритетом відкидаються першими для захисту критичних потоків.
	Обмеження: Дуже ресурсоємний та складно масштабується для великих мереж.
	
	Приклади:
	- RSVP (Протокол резервування ресурсів) – це протокол, який використовується з IntServ для резервування мережевих ресурсів.
	- Керування допуском викликів (Call Admission Control) гарантує, що мережа приймає лише той трафік, який вона може підтримувати, не погіршуючи існуючі послуги.
	
1. Диференційовані послуги (DiffServ): забезпечують QoS, визначаючи пріоритети класів трафіку замість резервування ресурсів для кожного потоку.
	Характеристики:
	- Трафік класифікується за класами (голос, відео, BE), а не обробляється для кожного окремого потоку.
	- DiffServ пропонує відносний пріоритет (краще оброблення для вищих класів), а не суворі наскрізні гарантії.
	- Пакети маркуються (зазвичай за допомогою DSCP), щоб пристрої знали, який клас і пріоритет застосовувати.
	- Краще масштабуються у великих мережах


#### Диференційоване обслуговування DiffServ

Диференційовані послуги (DiffServ) визначають як модель класу послуг (COS), яка використовується для контролю трафіку IP-мережі за класами. Головною метою диференційованих послуг є надання пріоритету конкретному трафіку, який потребує безперебійного потоку даних. У диференційованих послугах трафік поділяється на кілька класів, і кожен клас обробляється та має різний пріоритет.

Порівняно з підходом IntServ, диференційовані послуги забезпечують більш масштабований та гнучкий спосіб контролю трафіку. У моделі диференційованих послуг в полі DSCP (DiffServ Codee Point) кожному пакету надається одна з 64 можливих моделей пересилання (значення від 0 до 63). per hop behavior (PHB) визначає процедури пересилання пакетів кожного вузла на основі значення поля DSCP

Принцип роботи
	Домен DiffServ використовується для визначення області дії протоколу DiffServ. Домен складається з двох вузлів (граничні маршрутизатори і Основні маршрутизатори)
	1. граничні маршрутизатори: розташовані на межах домену. Вони призначають значення DSCP усім пакетам відповідно до інформації QoS, зазначеної вхідною мережею. 
	2. Основні маршрутизатори: присутні всередині домену. вони забезпечують пересилання пакетів з різними політиками відповідно до їхніх значень DSCP
	Класи трафіку групуються на три типи за протоколом DiffServ. Вони такі:
		1. Прискорене пересилання (EF): Expedited Forwarding визначає трафік зі специфічними вимогами до якості обслуговування (QoS), наприклад, телефонія.
		2. Гарантоване пересилання (AF): Assured Forwarding (AF) складається з класів трафіку, таких як AF1, AF2, AF3 та AF4.
		3. Best effort (BE): не гарантує QoS.

Переваги DiffServ
- Немає потреби підтримки м'якого стану та періодичного оновлення кожного зарезервованого вузла для відновлення після помилок.
- є більш масштабованими, оскільки розподіл ресурсів відбувається на рівні класу.

Недоліки DiffServ
- не забезпечують гарантованої продуктивності.
- працюють ефективніше лише тоді, коли пріоритетний трафік менший.

#### Швидкі UDP Інтернет з’єднання QUIC

QUIC – це мережевий протокол транспортного рівня, розроблений для пришвидшення та підвищення надійності веб-зв'язку. На відміну від старіших версій HTTP, які покладаються на TCP, QUIC працює через UDP, поєднуючи швидкість та безпеку в одному рукостисканні.

HTTP/2 = TCP + TLS (кілька рукостискань, вища затримка)
HTTP/3 = QUIC (одинарне рукостискання, нижча затримка)

TCP забезпечує надійну доставку пакетів, але ціною додаткових циклів обміну під час встановлення з'єднання. Коли клієнт підключається до сервера через HTTP/2:
1. Він надсилає запит SYN (синхронізація).
2. Сервер відповідає SYN-ACK.
3. Клієнт відповідає ACK.
4. Якщо з'єднання безпечне (HTTPS), для перевірки сертифіката TLS/SSL потрібен ще один цикл обміну, що додає ще більшої затримки

На відміну від TCP, який розділяє фази транспортування та шифрування, QUIC об'єднує їх в одне єдине рукостискання, що означає, що дані можуть почати надходити майже одразу після першого обміну пакетами.

Принцип роботи QUIC
	QUIC працює на транспортному рівні, безпосередньо поверх UDP. UDP є легким і надзвичайно швидким, але традиційно ненадійним, оскільки не гарантує доставку пакетів або їх порядок. QUIC підвищує надійність UDP завдяки:
	- Встановленню послідовності пакетів
	- Відновленню втрат
	- Шифруванню (вбудований TLS 1.3)
	- Мультиплексуванню потоків (кілька потоків в одному з'єднанні)

QUIC робить UDP надійним, подібним до TCP, але без накладних витрат TCP. Оскільки UDP вже широко підтримується, QUIC не потребує масштабних змін інфраструктури. Це полегшує його впровадження браузерами та серверами.

QUIC впроваджений в HTTP/3, останню версія протоколу HTTP. Великі технологічні компанії та браузери вже використовують його. (Google, Amazon, Meta, Microsoft)

Недоліки QUIC:
- Складне керування потоком: Управління перевантаженням та керування потоком через UDP складніше, ніж через TCP.
- Різна поведінка при перевантаженні: Контроль перевантаження QUIC поводиться інакше, ніж TCP, що може спричиняти невідповідності в деяких мережевих умовах.

#### Методи забезпечення QoS в безпровідних мережах

Якість обслуговування (QoS) – це набір механізмів управління та контролю трафіку, що використовуються в комп'ютерних мережах для визначення пріоритетів та регулювання передачі даних на основі вимог програм.

Механізми QoS в бездротових мережах визначають, як обмежені радіочастотні ресурси розподіляються між конкуруючими пристроями та типами трафіку. Оскільки середовище є спільним та нестабільним через перешкоди, бездротовий QoS спирається на активний контроль доступу до середовища та динамічне планування ресурсів.

1. Забезбечення QoS у WiFi мережах	
	- Категоризація трафіку: WMM групує пакети у чотири категорії доступу (AC Access Categories):
		- AC_VO
		- AC_VI
		- AC_BE
		- AC_BK
	- Розширений розподілений доступ до каналів (EDCA  Enhanced Distributed Channel Access): Замість того, щоб усі пристрої чекали однаковий випадковий період очікування перед передачею, трафіку з високим пріоритетом призначається математично коротший час очікування, що статистично гарантує, що вони першими отримають доступ до ефіру.
	
2. Забезбечення QoS у мобільних мережах (4G, 5G)
	Стільникові мережі використовують централізоване планування, де базова станція має абсолютний контроль над тим, який пристрій передає дані та коли.
	- QCI QoS Class Identifier: У LTE та 5G кожному носії даних призначається значення (наприклад, від 1 до 9 у LTE). Це значення визначає бюджет затримки пакета, допустимий коефіцієнт помилок пакета та те, чи гарантує з'єднання певну швидкість передачі даних (GBR) чи є негарантованою (Non-GBR).
	- Динамічний розподіл ресурсів (OFDMA): базова станця розділяє частотний спектр на блоки ресурсів і динамічно призначає ці блоки різним користувачам на основі їхнього пріоритету QCI
	- Розподіл мережі (5G): розділяє фізичну інфраструктуру 5G на незалежні, наскрізні віртуальні мережі. Це ізолює трафік фізично та логічно, дозволяючи «фрагменту» з низькою затримкою (наприклад, автономному керуванню) працювати повністю незалежно від «фрагменту» з високою пропускною здатністю (наприклад, мобільного широкосмугового зв'язку) на тій самій вежі стільникового зв'язку.
	
3. Забезбечення QoS у загальному розподілі радіоресурсів
	- Контроль доступу: Мережа активно відхиляє нові запити на з'єднання, якщо поточні радіоресурси не можуть математично підтримувати запитувану якість обслуговування (QoS), не порушуючи гарантій затримки або пропускної здатності існуючих активних з'єднань. 
	- Адаптивна модуляція та кодування (AMC): Динамічно змінює складність радіосигналу на основі поточних перешкод. Якщо якість сигналу падає, мережа знижує швидкість передачі даних, щоб підтримувати стабільне з'єднання та запобігати втраті пакетів

#### Технологія SDH/SONET, NGSDH

SONET (Синхронна оптична мережа) та SDH (Синхронна цифрова ієрархія) – це дві  системи, які часто використовуються як взаємозамінні; вони описують передачу цифрових сигналів через оптоволоконні мережі. Обидві повсюдно впроваджуються в телекомунікаціях для забезпечення високошвидкісної передачі даних, хоча вони мають деякі регіональні та технічні відмінності. SONET використовується в Північній Америці, тоді як SDH, використовується переважно в Європі та інших частинах світу. 

Переваги SONET
- Ефективна синхронізація
- системи SONET сумісні з раніше створеними мережами, новіші технології можна впроваджувати без необхідності перебудовувати всю мережу.

Переваги SDH
- Гнучка швидкість передачі даних: SDH має можливість надавати різні варіанти швидкості передачі, що дозволяє впроваджувати його в різних мережах, від малих до великих.
- Підтримка різних типів даних: Телекомунікаційні мережі можуть підтримувати різні види трафіку, включаючи голосовий, відео та IP-трафік, в одній мережі.
- може працювати як у синхронному, так і в асинхронному режимі.

NG-SDH (Next generation SDH) - це покращення стандарту SDH
Оригінально SDH був розроблений виключно для голосового трафіку з постійною швидкістю передачі даних. Він був дуже неефективним для обробки імпульсних даних зі змінною швидкістю передачі даних, таких як Ethernet. NG-SDH дозволяє застарілим телекомунікаційним мережам одночасно та ефективно передавати дані IP/Ethernet та традиційний голосовий трафік по одному оптичному волокну.

SDH, SONET, NG-SDH переважно вважаються застарілими системами, їх поступово витісняють стандарти Carrier Ethernet (PTN), Optical Transport Network (OTN) та DWDM (Dense Wavelength Division Multiplexing)

#### Технологія DWDM

Щільне мультиплексування з поділом довжин хвиль або DWDM – це технологія передачі даний через оптоволокно. цей метод дозволяє підводити кілька довжин хвиль до волокна. Наразі існує система, яка підтримує сто шістдесят довжин хвиль на одне волокно.

Компоненти DWDM:
1. Оптичний Мультиплексор/демультиплексор (OADM) – об'єднує кілька оптичних сигналів в одне оптичне волокно та відповідно розділяє оптичні сигнали з волокна
2. OXC (Optical cross-connect) – допомагає встановлювати перехресне з’єднання між «N» кількістю вхідних портів та «M» кількістю вихідних портів
3. Оптичний підсилювач – підсилює оптичні індикатори, щоб сигнал міг поширюватися на великі відстані.
4. Регенератор - забезпечує ефективність оптичного підсилювача

Переваги
- Він має гарну масштабованість. 
- Забезпечує хорошу оптоволоконну ємність.

Недоліки
- має високу вартість.
- Має високі вимоги до частот вхідних сигналів

Застосування
1. телекомунікації передачі на довгі відстані
2. З'єднання датацентрів (DCI)
3. Мережі міських районів (MAN) та 5G-бекхол
![[Pasted image 20260901111804.png]]
#### Оптичні транспортні мережі

OTN (Оптична транспортна мережа) – це стандарт, що забезпечує універсальну «цифрову оболонку» для передачі різноманітних протоколів даних через оптичне волокно. Він поєднує в собі можливості SDH/SONET з масштабованою пропускною здатністю DWDM.

OTN інкапсулює дані клієнта (Ethernet, мережі зберігання даних, відео, SONET) у структуровану математичну ієрархію перед передачею їх по DWDM

![[Pasted image 20260901111756.png]]

Функції OTN:
- Інкапсуляція даних (Сигнал клієнта повністю інкапсульований, зберігаючи його власний таймінг, заголовки та корисне навантаження)
- Виправлення помилок (виявлення та корекція для бітових помилок, спричинених фізичною деградацією сигналуб що дозволяє передавати його на великі відстані)
- Асинхронне мультиплексування (Поєднання декількох низькошвидкісних контейнерів в один високошвидкісний контейнер для економію ресурс довжин хвиль DWDM)

#### Технологія MPLS

Багатопротокольна комутація за мітками (MPLS Multi-Protocol Label Switching) – це метод пересилання пакетів, що використовується в сучасних мережах. Замість того, щоб змушувати маршрутизатори перевіряти таблиці маршрутизації для кожного IP-пакета, MPLS використовує мітки для рішень щодо пересилання. Ці мітки створюють заздалегідь визначені, ефективні шляхи по мережі, що підвищує швидкість, масштабованість та управління трафіком.

MPLS знаходиться між 2-м рівнем (канальним рівнем) та 3-м рівнем (мережевим рівнем) моделі OSI, тому його часто називають протоколом 2.5 рівня.

Заголовок MPLS - це 32 біти між 2 і 3 рівнями:
20 бітів - мітка
3 біти - Exp (для забезпечення QoS)
1 біт - BoS (позначка чи це остання мітка в стеку)
8 біт - TTL (для запобіганню циклам, зменшується на 1 прикожній ітерації)

Принцип роботи
- Вхідний етап (Push): маршрутизатор клієнта надсилає IP-пакет до маршрутизатора провайдера. Він призначає мітку на основі пункту призначення та додає заголовок MPLS.
- Основний етап (Swap): Проміжні маршрутизатори пересилають пакет лише на основі мітки, оновлюючи її
- Вихідний етап (Pop): Вихідний маршрутизатор провайдера видаляє заголовок MPLS та пересилає оригінальний IP-пакет до маршрутизатора клієнта.

#### Захист даних у відповідності до вимог GDPR

Загальний регламент про захист даних (GDPR) – це закон, прийнятий Європейським Союзом, який регулює процес збору, обробки та остаточного видалення персональних даних з комп’ютерної системи.

GDPR замінює Директиву ЄС про захист даних, яка набула чинності у 1995 році. Це було задовго до того, як Інтернет перетворився на потужний онлайн-бізнес, яким він є сьогодні.

GDPR вимагає від підприємств захищати персональні дані клієнтів. Персональні дані в GDPR визначені наступним чином:
- Основна ідентифікаційна інформація, така як ім’я, адреса та номери посвідчень особи.
- Дані про здоров’я та генетичні дані.
- Біометричні дані.
- Дані про расову приналежність.
- Політичні погляди.

На практиці дотримання GDPR означає:
- Явна згода про обробку персональний даних має бути надана у зрозумілій та легкодоступній формі.
- Право на доступ та портативність: Користувачі можуть дізнатися, чи обробляються їхні персональні дані і як.
- Право бути забутим: Дозволяє суб'єкту даних вимагати від контролера даних видалення його або її персональної інформації (і потенційно третіх осіб також).

Технічні засоби забезпечення дотримання GDPR:
- Шифрування та псевдонімізація: Криптографічний захист даних під час зберігання та під час передачі.
- Захист даних за проектом та за замовчуванням: Системи розроблені для обробки лише абсолютно необхідного мінімуму даних.
- Контроль доступу: Впровадження контролю доступу на основі ролей (RBAC) та багатофакторної автентифікації (MFA) для забезпечення принципу найменших привілеїв у внутрішніх базах даних.
- Автоматизоване видалення даних: Заплановані завдання або тригери бази даних, які остаточно видаляють або безповоротно анонімізують записи користувачів після закінчення терміну дії правової підстави для зберігання."""

import re
import random

class Question:
    def __init__(self, name, answer):
        self.name = name
        self.answer = answer

    def get_answer(self):
        return self.answer

class Topic:
    def __init__(self, name, questions):
        self.questions = questions
        self.name = name


chunks = raw_text.split("TOPICSEPARATOR")

topics = []

for i, v in enumerate(chunks):
    items = re.findall(r"(####[^\n]*)([^#]*)", v, re.DOTALL)
    questions = []
    for item in items:
        questions.append(Question(item[0][5:], item[1])) 
    topics.append(Topic(f"Topic{i+1}", questions))


selected_topics = random.choices(topics, k=5)
selected_questions = []
for topic in selected_topics:
    selected_questions.append(random.choice(topic.questions))

for i, q in enumerate(selected_questions):
    print(f"{i+1}. {q.name}")

for _ in range(5):
    index = int(input("\nWhich question you want to see the answer for? (1-5) ")) -1
    print(f"\n{index+1}. {selected_questions[index].name}")
    print(selected_questions[index].answer)

